{
  "url": "https://www.library.northwestern.edu/research/teaching-with-the-libraries/index.html",
  "title": "Teach with the Libraries: Libraries - Northwestern University",
  "content": "We encourage faculty to draw upon the Libraries' collections, technology, professional staff, and facilities to enrich their teaching and promote student learning. We provide expertise, tailor our instruction to faculty needs, and aim to make students comfortable navigating the library's rich resources, including archival and special collections. Our instruction includes customized activities that facilitate classroom discussion, student-led inquiry, and critical thinking. As part of the Libraries' services for faculty, we offer the following instructional services: Contact your subject librarian to talk about ways you can teach with the Libraries, or complete the instruction request form to get started. Subject librarians are available to help faculty with course modifications to accommodate remote instruction. We can identify and suggest alternate course or research materials that will be accessible to remote learners, and provide library instruction via Canvas, Zoom, or Panopto. Contact your subject librarian for more information. The library developed three Canvas modules to strengthen students’ digital and information literacy skills. Adding one or more of these modules to your Canvas course provides students with an opportunity to improve their knowledge of the research process and build their understanding of the library’s print and online holdings. After working through the modules, one Northwestern third-year student said, “I would want to encounter this kind of information when I'm working on research papers and projects throughout my undergrad career — I honestly wish I had known about them earlier because now I'm thinking about all the past papers I could have done so much better on had I known that this information was out there.” Faculty can review the modules in Canvas Commons. You can import one or more of the modules to your Canvas course, or contact your subject librarian or Anne Zald for more customized instruction. Librarians with expertise in your subject can work with you to create a research guide highlighting key resources for your course or particular subject. Examples: SOCIOL 101: Birthright Citizenship: Race, Law, and Belonging in the United States, Quisumbing King COMM 102: Public Speaking, Professor Bullock HIST 200: Sickness and Health in Latin America,  Professor Ramirez IS 395: AI is Eating the World: Market of AI , Professor Lehoucq GSS 361: Shame! Histories and Cultures of an Emotion, Professor Parkinson More available here: Course Guides I want students to become familiar with the library and to use its resources, including consulting (human) librarians. Additionally, I think it is important that first-year students begin to understand the concept of \"expertise,\" and seeing that a librarian has research expertise that their professors and the students themselves do not is an important lesson. They did better research for the target research paper AND for later papers for our class. ” Bringing my classes to special collections...would be impossible without the amazingly knowledgeable and generous staff. The librarians make the visit possible and also help shepherd students through individual follow up visits.” This assignment comes the first week of fall quarter freshman year--I believe actively getting the students to the library and to see what they can get from the library as early as possible in their academic careers is vital to future success.”",
  "timestamp": 1729732684.146396
}