{
  "url": "https://www.library.northwestern.edu/about/contact/james-lee.html",
  "title": "James Lee: Libraries - Northwestern University",
  "content": "James Lee, PhD is the Associate University Librarian for Academic Innovation at Northwestern University. Lee also serves as Associate Professor in the Medill School for Journalism, Media, and Integrated Marketing Communications. He is responsible for leading the Libraries’ mission of building new academic collaborations and partnerships with Northwestern’s colleges and schools, centers, departments, and other units, specifically by applying and developing new methods of digital scholarship and data science. He is particularly focused on strengthening the Libraries’ role as a nexus for academic collaboration and a catalyst for innovative interdisciplinary research and learning. Lee engages with librarians, faculty, technical experts, students, and staff across academic programs to enrich the span of Northwestern’s research services and promote new research methods, learning experiences, and modes of scholarly publishing. Previously, Lee was a leader in digital scholarship at the University of Cincinnati, where he was the Associate Vice Provost for Digital Scholarship, Director of the Digital Scholarship Center, and Director of the interdisciplinary data science AI for All Lab. At Cincinnati, Lee also held faculty appointments in the College of Arts and Sciences (Digital Humanities) and in the College of Medicine (Biomedical Informatics). His research and teaching focus on the areas of machine learning and natural language processing techniques adapted to historical data, social network analysis, and data visualization of high-dimensional models. Much of his work has used machine learning methods applied to large text corpora and other unstructured datasets to study: (1) the intertwined histories of climate change and colonialism and (2) how language is used to shape the emotional and rational discourse of social media networks. Methodologically, his research investigates ways to display the results of machine learning models through human-interpretable interactive visualizations that enables non-technical audiences to explore and to ask questions of otherwise forbidding high-dimensional data. In the domain of biomedical informatics, Lee’s research has focused on the use of natural language processing to assist clinicians in better understanding ambiguous or uncertain language patterns in electronic health records in pediatrics and neurology. The results of his research projects have been published in a wide range of venues, including the Harvard Data Science Review, New Media and Society, Applied Linguistics, Social Media and Society, the Journal of Hospital Medicine, Public Books, the Publications of the Modern Language Association (PMLA), Digital Humanities Quarterly, Cultural Analytics, and New Literary History, among others. His work has been generously supported by the Andrew W. Mellon Foundation and the National Science Foundation. Lee received his BA from Cornell University and his PhD from the University of California, Berkeley.",
  "timestamp": 1729732711.3100805
}