{
  "url": "https://www.library.northwestern.edu/libraries-collections/music/find-use/index.html",
  "title": "Find and Use Materials: Libraries - Northwestern University",
  "content": "Start your research by identifying the materials you need. Use NUsearch, our online catalog, to search the books, scores and recordings held in the Music Library and other NU libraries. (Note: While Northwestern University musical performances since 1995 can be located in NUsearch; earlier performances can be located by speaking with a staff member.) Circulating materials are available for pickup and delivery through NUsearch. A limited amount of printed music and music books are held in the Oak Grove Library Center (OGLC), as well as music master theses and PhD dissertations, and periodicals older than one year.  All phonodisc (LP) sound recordings are located in on-campus storage. Many materials from the Music Library's collection can be borrowed according to the circulation policies that apply to other University Libraries' items. The Borrowing Materials section of our website can provide information on borrowing cards and loan limits. However, some items are limited to use in the library or are available to faculty and grad students only for an abbreviated lending period. Exceptions and restrictions are listed below. Use of these materials vary by audience: students, staff and guests cannot check out these materials. Faculty can borrow them for up to three days. Rare books, scores, archival and manuscript collections are managed by the McCormick Library of Special Collections and University Archives. Appointments are encouraged prior to using rare collections. Visit the McCormick Library site to learn more about accessing rare music related materials, or contact them at specialcollections@northwestern.edu to schedule an appointment. The majority of the CD and LP collection is available to circulate to the Northwestern community and are currently administered by the Mitchell Multimedia Center and subject to their policies. Archival recordings of Northwestern performances since 2006 are available to the Northwestern community via Digital Collections. You must sign in with your netID and password to access these recordings. For recordings prior to 2006, contact Greg MacAyeal, Music Library Curator at g-macayeal@northwestern.edu. We will assist you in locating materials for your research.Email musiclibrary@northwestern.edu to set up a research consultation.",
  "timestamp": 1729732686.3828473
}