{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/plan-a-visit/index.html",
  "title": "Plan a Visit: Libraries - Northwestern University",
  "content": "Appointments are available for the current quarter, Monday through Friday, 9am - 4:30pm. The McCormick Library is open to the public and our collections are non-circulating. In order to view collection materials in-person, all patrons must first register and create a user account in the McCormick Library Request System . Use your account to request materials through the online catalog and to keep a record of your transactions. Once you arrive at the McCormick Library,  check in at the service desk and present a valid government-issued photo identification. Guests from outside the Northwestern community will be required to make an appointment prior to arriving and to show ID to enter the library building. To set up an appointment contact us directly at specialcollections@northwestern.edu. You may also email us at specialcollections@northwestern.edu if you would like to request a remote reference session via Zoom. You will be able to view materials virtually through our document camera, assisted by a staff member. See our policies and procedures page for detailed information. The McCormick Library of Special Collections and University Archives is temporarily ocated in University Library, Lower Level.  To navigate there via GPS, use the address below. University Library1970 Campus DriveEvanston, IL  60208 If you're visiting from out of town, see the out-of-town visitor page for detailed information on parking, lodging options, and area resources. To request reproductions of materials, please see our Research & Instruction page. It is Northwestern University Libraries' policy to make all collections and services available to users with disabilities. See our accessibility services page for more information, and please contact us with any questions or concerns.",
  "timestamp": 1729732700.287205
}