{
  "url": "https://www.library.northwestern.edu/visit/events-exhibits/event-calendar.html",
  "title": "Event Calendar: Libraries - Northwestern University",
  "content": "Find upcoming workshops, tours or speaker events. View all or filter the events by audience type. 3:00 PM - 4:00 PM, Evanston Students who participate in protests, organizing, or political groups often have documentation of their activism. Fliers, signs, photos, and social media posts are commonly created. This workshop will discuss the best practices to preserve this material, both physical objects and digital formats. Learn about appropriate storage, care and handling, damaged materials, born-digital files, and social media in order to best steward your own collection. Archival materials, both physical and digital, that document past activism will be on display.Â \nPresented by Katie Risseeuw, Preservation Librarian; Kelsey OâConnell, Digital Archivist; and Andrea Martinez, Archival Processing Specialist Students who participate in protests, organizing, or political groups often have documentation of their activism. Fliers, signs, photos, and social media posts are commonly created. This workshop will discuss the best practices to preserve this material, both physical objects and digital formats. Learn about appropriate storage, care and handling, damaged materials, born-digital files, and social media in order to best steward your own collection. Archival materials, both physical and digital, that document past activism will be on display.Â Presented by Katie Risseeuw, Preservation Librarian; Kelsey OâConnell, Digital Archivist; and Andrea Martinez, Archival Processing Specialist 2:00 PM - 3:00 PM, Online Canopy IIIF is an open-source static site generator that allows you to quickly create digital exhibits using collections in digital repositories. You can use this tool to introduce your research to a wide audience, incorporate multimedia into essays, and provide deeper context to an array of digital objects. Geared toward students and faculty with an interest in public and digital humanities, this workshop will walk you through creating your own digital exhibit using Github and Canopy. It will also introduce you to the image sharing framework, IIIF, which is used by many libraries and museums as a way to share high-quality images. For an example of a Canopy site, check out abolition now. from the Univerity of Tennessee.Â \nPresented by Mat Jordan, Front End Developer; and Basia Kapolka, Digital Humanities LibrarianÂ Canopy IIIF is an open-source static site generator that allows you to quickly create digital exhibits using collections in digital repositories. You can use this tool to introduce your research to a wide audience, incorporate multimedia into essays, and provide deeper context to an array of digital objects. Geared toward students and faculty with an interest in public and digital humanities, this workshop will walk you through creating your own digital exhibit using Github and Canopy. It will also introduce you to the image sharing framework, IIIF, which is used by many libraries and museums as a way to share high-quality images. For an example of a Canopy site, check out abolition now. from the Univerity of Tennessee.Â Presented by Mat Jordan, Front End Developer; and Basia Kapolka, Digital Humanities LibrarianÂ 3:00 PM - 4:00 PM, Evanston Keeping track of your research can be an overwhelming task. Fortunately, Zotero is a tool that can help! In this session we will introduce you to the citation management application, Zotero, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a freely available citation management software application that works as standalone software or through a web browser. Zotero is easy to use and allows you to collect, manage, Â and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs, Microsoft Word, and LibreOffice. Keeping track of your research can be an overwhelming task. Fortunately, Zotero is a tool that can help! In this session we will introduce you to the citation management application, Zotero, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a freely available citation management software application that works as standalone software or through a web browser. Zotero is easy to use and allows you to collect, manage, Â and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs, Microsoft Word, and LibreOffice. 2:00 PM - 3:00 PM, Online Keeping track of your research can be an overwhelming task. Fortunately, EndNote can help! In this session, we will introduce you to a powerful citation management application, EndNote, which can help you organize your research materials and save you countless hours in the course of your researching, reading, and writing. EndNote is available at no cost to Northwestern students, staff, and faculty. It's easy to use and allows you to collect, manage, and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Microsoft Word. Keeping track of your research can be an overwhelming task. Fortunately, EndNote can help! In this session, we will introduce you to a powerful citation management application, EndNote, which can help you organize your research materials and save you countless hours in the course of your researching, reading, and writing. EndNote is available at no cost to Northwestern students, staff, and faculty. It's easy to use and allows you to collect, manage, and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Microsoft Word. 2:00 PM - 3:00 PM, Online Copyright is a growing concern among researchers, who may have questions like âWhen can I use someone elseâs copyrighted work?â or âWhat rights do I have in my own research?â This workshop will cover basic copyright principles, as well as taking a deeper dive into how exceptions to the law like fair use apply in an academic setting. Expect large-group discussion of real-life fair use case studies. Participants are encouraged to bring examples of texts, images, and other copyrighted materials they would like to incorporate into their work for the group to discuss.\nThis workshop will be presented over Zoom, led by Liz Hamilton, Copyright Librarian.\nA Northwestern Zoom Account is required to access the session. Copyright is a growing concern among researchers, who may have questions like âWhen can I use someone elseâs copyrighted work?â or âWhat rights do I have in my own research?â This workshop will cover basic copyright principles, as well as taking a deeper dive into how exceptions to the law like fair use apply in an academic setting. Expect large-group discussion of real-life fair use case studies. Participants are encouraged to bring examples of texts, images, and other copyrighted materials they would like to incorporate into their work for the group to discuss. This workshop will be presented over Zoom, led by Liz Hamilton, Copyright Librarian. A Northwestern Zoom Account is required to access the session. 3:00 PM - 4:00 PM, Online Do you need to find statistics to support an argument? Â Or a dataset to analyze as part of a research project? Â Finding datasets from authoritative sources can be challenging. This workshop will point you to the best places to start looking for data to streamline the discovery process. Â How to cite datasets will also be addressed.Â \nTopics NOT addressed in this session: Â cleaning data, analysis methods or software.\nThis workshop is presented by Becca Greenstein, STEM Librarian; and Anne Zald, Government Information Librarian. Do you need to find statistics to support an argument? Â Or a dataset to analyze as part of a research project? Â Finding datasets from authoritative sources can be challenging. This workshop will point you to the best places to start looking for data to streamline the discovery process. Â How to cite datasets will also be addressed.Â Topics NOT addressed in this session: Â cleaning data, analysis methods or software. This workshop is presented by Becca Greenstein, STEM Librarian; and Anne Zald, Government Information Librarian. 3:00 PM - 3:30 PM, Online This session will provide an overview of systematic and scoping reviews, how they differ from literature reviews, what you should be thinking about as you plan your research, and the support available through Northwestern Libraries. This session is geared towards faculty, postdocs, graduate students, and other researchers.\nThis session is presented by Lauren McKeen McDonald, Open Education Librarian; and Jason Kruse, Undergraduate Engagement Librarian.\nA Northwestern Zoom Account is required to access this session. This session will provide an overview of systematic and scoping reviews, how they differ from literature reviews, what you should be thinking about as you plan your research, and the support available through Northwestern Libraries. This session is geared towards faculty, postdocs, graduate students, and other researchers. This session is presented by Lauren McKeen McDonald, Open Education Librarian; and Jason Kruse, Undergraduate Engagement Librarian. A Northwestern Zoom Account is required to access this session. 11:00 AM - 12:00 PM, No Location This session will introduce you to the steps in the systematic review process, and the support services that Northwestern Libraries provides. Topics covered include different types of reviews, what to do before starting a review, software & tools, and scaling down projects using systematic review techniques. This session is geared towards faculty, postdocs, graduate students, and other researchers.\nThis workshop is presented by Lauren McKeen McDonald, Open Education Librarian; and Jason Kruse, Undergraduate Engagement Librarian.\nA Northwestern Zoom Account is required to access this session. This session will introduce you to the steps in the systematic review process, and the support services that Northwestern Libraries provides. Topics covered include different types of reviews, what to do before starting a review, software & tools, and scaling down projects using systematic review techniques. This session is geared towards faculty, postdocs, graduate students, and other researchers. This workshop is presented by Lauren McKeen McDonald, Open Education Librarian; and Jason Kruse, Undergraduate Engagement Librarian. A Northwestern Zoom Account is required to access this session. 2:00 PM - 3:00 PM, Online Keeping track of your research can be an overwhelming task. Fortunately, Zotero is a tool that can help! In this session we will introduce you to the citation management application, Zotero, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a freely available citation management software application that works as standalone software or through a web browser. Zotero is easy to use and allows you to collect, manage, Â and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs, Microsoft Word, and LibreOffice. Keeping track of your research can be an overwhelming task. Fortunately, Zotero is a tool that can help! In this session we will introduce you to the citation management application, Zotero, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a freely available citation management software application that works as standalone software or through a web browser. Zotero is easy to use and allows you to collect, manage, Â and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs, Microsoft Word, and LibreOffice. 12:00 PM - 1:00 PM, Online While the research literature grows at an exponential rate, the time available to graduate students to discover, read, and evaluate the importance of literature in oneâs field of study remains fixed. Through discussion, mini-lecture, and hand-on activities participants in this workshop will explore strategies to keep current with the literature in their field of study as well as to use their time effectively to accomplish that goal. Strategies discussed include: citation chaining and cited reference searching; pre-print repositories; database & publisher alerts. Â Social media strategies will be lightly touched upon. Those studying in the social sciences, humanities, the sciences, and technology will be able to incorporate at least one of these strategies into their ongoing practice.\nThis workshop will be presented online via Zoom by Anne Zald, Government Information Librarian.\nA Northwestern Zoom account is required to access this session. While the research literature grows at an exponential rate, the time available to graduate students to discover, read, and evaluate the importance of literature in oneâs field of study remains fixed. Through discussion, mini-lecture, and hand-on activities participants in this workshop will explore strategies to keep current with the literature in their field of study as well as to use their time effectively to accomplish that goal. Strategies discussed include: citation chaining and cited reference searching; pre-print repositories; database & publisher alerts. Â Social media strategies will be lightly touched upon. Those studying in the social sciences, humanities, the sciences, and technology will be able to incorporate at least one of these strategies into their ongoing practice. This workshop will be presented online via Zoom by Anne Zald, Government Information Librarian. A Northwestern Zoom account is required to access this session. 3:00 PM - 4:00 PM, Online Do you need to find statistics to support an argument? Â Or a dataset to analyze as part of a research project? Â Finding datasets from authoritative sources can be challenging. This workshop will point you to the best places to start looking for data to streamline the discovery process. Â How to cite datasets will also be addressed.Â \nTopics NOT addressed in this session: Â cleaning data, analysis methods or software.\nThis workshop is presented by Becca Greenstein, STEM Librarian; and Anne Zald, Government Information Librarian. Do you need to find statistics to support an argument? Â Or a dataset to analyze as part of a research project? Â Finding datasets from authoritative sources can be challenging. This workshop will point you to the best places to start looking for data to streamline the discovery process. Â How to cite datasets will also be addressed.Â Topics NOT addressed in this session: Â cleaning data, analysis methods or software. This workshop is presented by Becca Greenstein, STEM Librarian; and Anne Zald, Government Information Librarian. 3:00 PM - 4:00 PM, Online As you prepare your dissertation, you may have questions about copyright. Can you use articles youâve published during your time at Northwestern? What about images and texts by other creators? This workshop will help you understand copyright as it applies to your dissertation, from the basics of copyright ownership to exceptions like fair use. No matter where you are in your program, come to discuss real-life examples â and feel free to bring your own.Â \nThis workshop will be presented over Zoom, led by Liz Hamilton, Copyright Librarian.\nA Northwestern Zoom Account is required to access the session. As you prepare your dissertation, you may have questions about copyright. Can you use articles youâve published during your time at Northwestern? What about images and texts by other creators? This workshop will help you understand copyright as it applies to your dissertation, from the basics of copyright ownership to exceptions like fair use. No matter where you are in your program, come to discuss real-life examples â and feel free to bring your own.Â This workshop will be presented over Zoom, led by Liz Hamilton, Copyright Librarian. A Northwestern Zoom Account is required to access the session. 2:00 PM - 3:00 PM, Online The HathiTrust Research Center (HTRC) enables beginner-to-advanced text analysis on the HathiTrust Digital Library collection, which is home to millions of digitized books and publications (18 million and counting!). This workshop will focus on the beginner features of the HTRC, including building a workset and running the built-in algorithms.\nThis workshop is presented online via Zoom by Jamie Carlstone, Authority Metadata Librarian.\nA Northwestern Zoom account is required to access this session. The HathiTrust Research Center (HTRC) enables beginner-to-advanced text analysis on the HathiTrust Digital Library collection, which is home to millions of digitized books and publications (18 million and counting!). This workshop will focus on the beginner features of the HTRC, including building a workset and running the built-in algorithms. This workshop is presented online via Zoom by Jamie Carlstone, Authority Metadata Librarian. A Northwestern Zoom account is required to access this session. 4:00 PM - 5:00 PM, Online While the research literature grows at an exponential rate, the time available to graduate students to discover, read, and evaluate the importance of literature in oneâs field of study remains fixed. Through discussion, mini-lecture, and hand-on activities participants in this workshop will explore strategies to keep current with the literature in their field of study as well as to use their time effectively to accomplish that goal. Strategies discussed include: citation chaining and cited reference searching; pre-print repositories; database & publisher alerts. Â Social media strategies will be lightly touched upon. Those studying in the social sciences, humanities, the sciences, and technology will be able to incorporate at least one of these strategies into their ongoing practice.\nThis workshop will be presented online via Zoom by Anne Zald, Government Information Librarian.\nA Northwestern Zoom account is required to access this session. While the research literature grows at an exponential rate, the time available to graduate students to discover, read, and evaluate the importance of literature in oneâs field of study remains fixed. Through discussion, mini-lecture, and hand-on activities participants in this workshop will explore strategies to keep current with the literature in their field of study as well as to use their time effectively to accomplish that goal. Strategies discussed include: citation chaining and cited reference searching; pre-print repositories; database & publisher alerts. Â Social media strategies will be lightly touched upon. Those studying in the social sciences, humanities, the sciences, and technology will be able to incorporate at least one of these strategies into their ongoing practice. This workshop will be presented online via Zoom by Anne Zald, Government Information Librarian. A Northwestern Zoom account is required to access this session. 6:00 PM - 8:00 PM, Off-Campus Evanston is making Black history. Although Black residents comprise only 16% of Evanstonâs population, Black Evanstonians currently hold many crucial political, managerial, and civic leadership posts in the areas of education, public safety, the libraries, parks and recreation, philanthropy, and more. Northwestern Universityâs Black Studies Department is also a part of Black Evanston. Our faculty, students, and staff work, live, rest, learn, organize and play in Evanston. With this event, we hope to build and strengthen the ties between Black Evanston and Black Northwestern. Under the banner of âBlack Evanston: Leadership for Growth,â this program will convene a panel of Black Evanston leaders to share and discuss their visions for and practices towards growing Black Evanston. Growth can mean actual population growth, but it also means cultivating the growth of community assets and investments, growing the next generation of leaders in Evanstonâs Black youth, and sustaining ongoing efforts at progressive policy growth, despite the various headwinds such as the end of affirmative action, the attacks on Black curricula and DEI, and the lawsuit against reparations. This program is a part of the annual Allison Davis Lecture Series, sponsored by the Black Studies Department at Northwestern, with support from the Weinberg College of Arts and Sciences. Evanston is making Black history. Although Black residents comprise only 16% of Evanstonâs population, Black Evanstonians currently hold many crucial political, managerial, and civic leadership posts in the areas of education, public safety, the libraries, parks and recreation, philanthropy, and more. Northwestern Universityâs Black Studies Department is also a part of Black Evanston. Our faculty, students, and staff work, live, rest, learn, organize and play in Evanston. With this event, we hope to build and strengthen the ties between Black Evanston and Black Northwestern. Under the banner of âBlack Evanston: Leadership for Growth,â this program will convene a panel of Black Evanston leaders to share and discuss their visions for and practices towards growing Black Evanston. Growth can mean actual population growth, but it also means cultivating the growth of community assets and investments, growing the next generation of leaders in Evanstonâs Black youth, and sustaining ongoing efforts at progressive policy growth, despite the various headwinds such as the end of affirmative action, the attacks on Black curricula and DEI, and the lawsuit against reparations. This program is a part of the annual Allison Davis Lecture Series, sponsored by the Black Studies Department at Northwestern, with support from the Weinberg College of Arts and Sciences. 4:00 PM - 5:00 PM, Evanston Keeping track of your research can be an overwhelming task. Fortunately, EndNote and Zotero are both tools that can help keep your research organized! In this session we will introduce you to the citation management applications, Zotero and EndNote, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a free and open-source citation management software application that works as standalone software or through a web browser, and EndNote is free to download for Northwestern users. Both are easy to use and allow you to collect, manage, and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs and Microsoft Word.\nNo registration needed. Drop by any time during these hours for help getting started using EndNote or Zotero, if you're already using the software and need help, or if you're just curious how a citation management tool can work for you! Keeping track of your research can be an overwhelming task. Fortunately, EndNote and Zotero are both tools that can help keep your research organized! In this session we will introduce you to the citation management applications, Zotero and EndNote, which can help you organize your research materials and save you countless hours in the course of your reading and writing. Zotero is a free and open-source citation management software application that works as standalone software or through a web browser, and EndNote is free to download for Northwestern users. Both are easy to use and allow you to collect, manage, and share your research sources. You can also insert properly formatted citations and bibliographies as you write in Google Docs and Microsoft Word. No registration needed. Drop by any time during these hours for help getting started using EndNote or Zotero, if you're already using the software and need help, or if you're just curious how a citation management tool can work for you! All Events",
  "timestamp": 1729732733.5284672
}