{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2022/requirements-for-using-library-spaces.html",
  "title": "Winter 2022 Requirements for Using Library Spaces: Libraries - Northwestern University",
  "content": "Update to this story on 2/28/2022: Beginning Feb. 28, masking will be optional in all University Libraries non-classroom communal spaces. Masks will remain a requirement in classrooms and other spaces where instruction takes place. Proof of vaccination will no longer be required to enter the building. For the latest updates on Northwestern University's COVID-19 safety measures, see  COVID-19 and Campus Updates. Per the Evanston Health and Human Services Department's requirements, Northwestern Libraries require proof of vaccination effective Tuesday, January 18, 2022. Visitors with an active Wildcard are required to show a green badge with their SymptomTracker.  The green badge will indicate that the Wildcard holder has not been identified as having a positive test, has not self-reported Covid symptoms, is in compliance with testing and/or vaccination requirements. Visitors without an active Wildcard are required to show proof of vaccination status. Proof of vaccination status can be: Alternatively, a negative COVID-19 test taken within 24 hours of visiting the Libraries can be used to enter. A physical hardcopy, digital photo or app that shows test results can be shared. Testing is available for visitors to campus, at no charge, between 9 a.m. and 4 p.m. Monday through Friday at the Jacobs Center or 345 East Superior St. in Chicago. Visitors who are tested at one of these locations will be able to show proof of a negative test result on their mobile phone within 30 minutes of testing. Information will not be collected or stored by the Libraries to protect individual health information. All visitors must be masked in the building following Northwestern masking guidelines. Visitors who do not have a Wildcard will be required to make an appointment in advance to visit the Charles Deering McCormick Library (see Plan a Visit). Visitors who have appointments should notify the Welcome Desk when they arrive.",
  "timestamp": 1733796658.9269629
}