{
  "url": "https://www.library.northwestern.edu/about/administration/departments/preservation-conservation/reformatting.html",
  "title": "Reformatting: Libraries - Northwestern University",
  "content": "Items from the general collection that are too deteriorated to be used or repaired are reviewed for replacement, digitization or withdrawal from the collection. Preservation Department staff determine the status of current holdings, the availability of reprints and the cost of digitization and then recommend the best preservation option. Assuming that the book has not already been digitized and archived in HathiTrust, digitization is often the best option for preserving content. Digitization provides many advantages over traditional reformatting techniques. Digital facsimiles of fragile material can be browsed easily and without disturbing the originals. In addition, access to digital files is significantly more convenient than access to conventional options such as microfilm. Items selected for digitization are sent to the Repository and Digital Curation Department for in-house digitization or to The HF Group for vendor-based digitization. The current challenge is the development  and maintenance of digital repository systems to address the preservation of newly created digital collections as well as the growing number of born digital assets being added to the collection each year. The institutional members of the Committee on Institutional Cooperation (CIC) have partnered with Google to digitize millions of bound volumes in their library collections. For Northwestern, this partnership was an important step to preserve print legacy collections and to provide present-day and future users with broad, in-depth access to historically significant print resources. The Preservation Department played an active role in the Google Books Project at Northwestern by managing all aspects of the pulling and shipping process and by carefully reviewing all materials before and after shipment to Google. By carefully reviewing material for digitization, the Preservation Department helped maximize the number of items sent for digitization while insuring that physical volumes were maintained in good condition.",
  "timestamp": 1733797185.1604035
}