{
  "url": "http://www.library.northwestern.edu/libraries-collections/mccormick-library/services.html",
  "title": "Research & Instruction: Libraries - Northwestern University",
  "content": "Librarians are available to meet with you in-person, or answer your questions via email or over the phone. Onsite visitors are welcome to use personal cameras or cell phones to take photographs of non-restricted materials for research purposes. Self-service scanners are also available onsite and can be used for up to 30 minutes at a time once they have notified McCormick Library staff of their intention to scan. Plan a Visit to the Reading Room to request your materials and make an appointment. Many materials can be reproduced on request. At no charge, the McCormick staff can scan up to 50 pages or spend up to 30 minutes' scan time (whichever comes first) of paper-based materials per research request. Anything beyond that amount is addressed on a case-by-case basis. Turnaround time will vary based on available resources. Patrons can contact the McCormick Library staff if they are interested in reproductions of audio-visual or born-digital materials. Staff reserves the right to limit the number of scans based on physical condition of material or available staff resources. Submit your request using our online request form. If you don’t already have an account with us, you will be asked to create one first. Once you do so and log in, you can click the link to access the form. See our policies and procedures page for information on copyright restrictions. To browse materials that have already been digitized, visit Digital Collections. The McCormick Library is committed to engaging students with collections through teaching. Librarians are available to partner with instructors to use archival and special collections materials in their classes. Instruction sessions are tailored to the specific needs of the class, and may include in-class activities and online components, all of which can help facilitate classroom discussion, student-led inquiry, and critical thinking. To learn more about class visits and using special collections and archival material in your class contact us directly at specialcollections@northwestern.edu. If you'd like to schedule your session, complete the Instruction Request form.",
  "timestamp": 1733797312.8095682
}