{
  "url": "http://www.library.northwestern.edu/about/administration/policies/building-use.html",
  "title": "Building Use Policy: Libraries - Northwestern University",
  "content": "The Northwestern University Libraries building use policy is designed to ensure library users have a variety of safe and welcoming spaces for research, learning, creativity, discovery and collaboration. All university buildings are private property. The following policy applies to all public areas of the libraries. All library staff are authorized to enforce this policy, with the assistance of Northwestern University Police if necessary. Possession and consumption of alcoholic beverages within library spaces is prohibited. Students found in violation of the no-alcohol policy will be reported to the appropriate University authorities. Non-Northwestern library users violating this policy will be reported to Northwestern University Police. Exceptions for alcohol at special events must be approved by Library Administration and must comply with all university regulations and state and federal laws. Animals are not allowed in library buildings except for trained and tethered service animals as described in ADA guidelines. Service animals are defined as dogs that are individually trained to do work or perform tasks for people with disabilities. No other animals are allowed on the private building premises. Should non-service animals be brought on the premises, the owner will be directed to remove the animal from the building immediately. Permission is required for filming, recording, and taking photographs in any areas of the library buildings. Permission for Northwestern affiliates can be sought by completing the Application for filming and photography in the libraries. If you are a journalist or commercial enterprise who would like to film in the library, please reach out to the Office of Global Marketing and Communication. Library rooms cannot be used for events for which an admission fee is charged, or attendees are compensated. Events and activities must support the mission of the libraries. Smoking & vaping in all forms is not permitted in the libraries or within 25 feet of library entrances. Soliciting for donations or sale of items or approaching patrons for the purpose of obtaining signatures on petitions is not allowed within the libraries, including entryways. Posting or placing of bills or flyers within the libraries is prohibited without prior approval from the library. Approval is at the discretion of the Northwestern Libraries. Transportation devices (except those assisting persons with disabilities) may not be used within the libraries. Bicycles may not be brought into library buildings and should be secured outside at provided racks. Skateboards and stand-up scooters may be brought into the libraries if carried or pushed; riding is prohibited. They must not be parked in walkways and/or block egress. Graffiti and destruction of furniture, books, periodicals, etc. are considered destruction of university property and will be reported to University Police. All Northwestern University policies including those not listed here are enforced. The University Police may cite persons who violate the provisions of these and other library policies. Violations by faculty, staff, or students may result in corrective action through administrative channels. The privilege to use the libraries is revocable at any time for violations of these policies. Last Review: December 2022",
  "timestamp": 1733797580.1779494
}