{
  "url": "http://www.library.northwestern.edu/about/administration/deia-at-the-libraries.html",
  "title": "Diversity, Equity, Inclusion and Accessibility at the Libraries: Libraries - Northwestern University",
  "content": "Northwestern University Libraries and Northwestern University Press commit to furthering diversity, equity, inclusion and access in all our work, including collections, services and spaces, with the understanding that our employees and work culture underpin all of it. We invite you to partner with us as we, with intentionality, strive towards demonstrating these ideals. This page is intended for campus collaborators and institutional peers. If you are in need of accessible accommodations, please see Accessibility Services. Northwestern University Libraries' policy is to make all of its collections and services accessible to users with disabilities. For general inquiries on Northwestern Libraries' diversity, equity, inclusion and accessibility initiatives or to collaborate on new initiatives, contact Victoria Akinde, Director of Organizational Development & Diversity or Rashaad Barnett, Associate Director of Culture and Inclusion. Victoria Akindevictoria.akinde@northwestern.edu 847-491-2882 Rashaad Barnettrashaad.barnett@northwestern.edu See below to learn more about specific initiatives. In January 2021, the Libraries convened a group of staff  from across the organization to formulate ways the organization could measurably improve its efforts to be a more diverse, equitable, inclusive, and accessible organization. That group’s work has resulted in the Northwestern University Libraries’ DEIA Strategic Plan. This plan will be implemented by groups and individuals across the organization and will be fostered and monitored by the Director of Organizational Development and Diversity, the Libraries Executive Team and the DEIA Planning Group. Contact Victoria Akinde, Director of Organizational Development & Diversity to learn more about the DEIA Strategic Plan. Victoria Akindevictoria.akinde@northwestern.edu 847-491-2882 DEIA Strategic Plan EDI Planning Group Sharepoint (NetID and password required) The charge of the Decentering Whiteness Steering Committee is to facilitate the long term strategies necessary for dismantling racism in all facets of our work. We hold ourselves to a commitment to identify and eradicate racist elements in our perceptions, beliefs, actions, collections and institutions. Current initiatives: Contact John Dorr, Head of the McCormick Library to learn more about projects in development and how to get involved. John Dorr john.dorr@northwestern.edu 847-467-1506 Northwestern University Libraries is committed to fostering a community of access, belonging and accountability for our users.  We strive to improve digital access and user experiences in accordance with the University’s Digital Accessibility Policy, and conformance with WCAG 2.0 Level AA standards. If you experience any difficulty with NUsearch, research guides or the Libraries website, please contact us at library@northwestern.edu. The work of Digital Products and Data Curation supports the Decentering Whiteness initiative by prioritizing the ethical and careful digitization of collections from marginalized and underrepresented communities and cultures. Current examples for 2022 include the digitization of the Aldridge Collection and the Slavery, Enslaved Persons, and Free Blacks in the Americas Collection. Additionally, as part of this work, we are committed to remediating issues of outdated, inaccurate, objectifying or disrespectful language found on the Digital Collections website. Work has been done to repair metadata for the The Humphrey Winterton Collection of East African Photographs and the Edward S. Curtis's The North American Indian collection, and is ongoing for collections previously digitized. Contact Digital Products and Data Curation, for more information on digitization and repairing metadata in our digital collections. repository@northwestern.edu 847-467-3898 The Northwestern University Press supports and participates in the Mellon University Press Diversity Fellowship Program. The Mellon Fellowship is supported by a four-year, $1,205,000 grant awarded to the University of Washington Press from the Andrew W. Mellon Foundation to support the continued development and expansion of the pipeline program designed to diversify academic publishing by offering apprenticeships in acquisitions departments. Northwestern University Press participates in this cross-press initiative to address the marked lack of diversity in the academic publishing industry. Contact Parneshia Jones, Director of Northwestern University Press, for more information on the University Press Mellon Fellowship. Parneshia  Jonesp-jones3@northwestern.edu847-467-3898 Metadata is the language used in Northwestern University Libraries’ catalog, online tools, archives, and digital collections to describe and manage resources and enable their discovery and ongoing access by the scholarly community. This work occurs within an international community of libraries, archives and systems. Northwestern Libraries acknowledges the reality that our metadata and practices reflect a white supremacist and discriminatory culture. This may lead to problematic language that perpetuates past and present prejudices, especially in respect to race, Indigenous Peoples, sexuality, gender, class, disability, colonialism and Global North bias. Our descriptive practices also historically center English and other western European languages. The Libraries’ metadata creators take responsibility for the language that describes our collections and are committed to remediating issues of outdated, inaccurate, objectifying or disrespectful language, while acknowledging that this reparative work is ongoing. The Libraries’ Metadata Inclusivity Steering Group is charged with leading projects to do this reparative work. This includes maintaining local subject vocabularies and making suggestions to the Library of Congress Subject Headings (LCSH). Contact Jamie Carlstone, Authority Metadata Librarian to collaborate on these topics or other metadata-related DEI projects. Jamie Carlstonejamie.carlstone@northwestern.edu847-491-3487 Research Guide - Current Projects Github The NPEP Library is a collaboration with the Northwestern Prison Education Program (NPEP) and provides services for incarcerated students and NPEP instructors, tutors, staff, and volunteers. Northwestern University Libraries supports the educational mission and activities of NPEP by enabling access to research materials and consultations with librarians, strengthening our collections in social justice, creating open access print and web publications, extending our suite of services to incarcerated students and applying the ethics of librarianship to advocate for alternatives to policing, surveillance and incarceration. Contact Josh Honn, English & Digital Humanities Librarian, for more about prison librarianship and support for incarcerated students. Josh Honnjosh.honn@northwestern.edu847-467-4761 NPEP Library Northwestern Prison Education Program According to a 2021 survey of Northwestern students, 48 percent reported either avoiding certain courses, dropping courses or not purchasing all course materials because of high textbook costs. That’s why Northwestern Libraries support open educational resources (OER) that eliminate the cost of course materials for students. OER are educational materials for teaching, learning and research in any medium – digital or otherwise – that have been released under an open license; such a license permits no-cost access, use, editing and sharing with no or limited restrictions (UNESCO). The Affordable Instructional Resources (AIR) initiative invites Northwestern faculty to apply for $5,000 grants to develop OER for undergraduate courses. Funded by the Associate Provost for Undergraduate Education and University Libraries, the annual AIR grants have gone to faculty who replaced their traditional textbooks by creating and adapting OER. Contact the Affordable Instructional Resources team to learn more about projects in development and how to get involved. air@northwestern.edu Each year beginning in 2022, the Libraries will award a Summer Undergraduate Research Grant to one Northwestern undergraduate student. The grant will support an independent academic or creative project that utilizes library collections and expertise in the field of study of Native American and Indigenous research. The grant provides $4,000 to cover living expenses for eight weeks of full-time independent research under the supervision of a faculty advisor and the guidance of a librarian mentor. For more on library grant opportunities, see Libraries Research Grants. For more on Summer Undergraduate Research Grants, see the Office of Undergraduate Research.",
  "timestamp": 1733797381.2259226
}