{
  "url": "https://www.library.northwestern.edu/libraries-collections/mudd-library/about.html",
  "title": "About: Libraries - Northwestern University",
  "content": "The Astrahan Electronic Information Center, established in 1992, is equipped with: Morton M. Astrahan was educated at Northwestern University, receiving his B.S.E.E. in 1945 and his Ph.D. in 1949 (as a student of Professor Robert Beam). He joined IBM in 1949 and spent his professional career there. After participating in the design of the IBM 701, he managed system planning and part of the development work for the SAGE (Semiautomatic Ground Environment) air-defense computer, the AN/FSQ-7. When deployed in 1958 this was the first large-scale, real-time digital computer supporting a major military mission. Some components from SAGE are mounted in two display cases in Mudd Library. One display case contains a magnetic core memory -- each tiny magnetic doughnut in this hand-woven frame is a single bit, so the entire memory board contains only 64,000 bits! In the other case are a vacuum-tube logic circuit, and a light gun which allowed the operator to select a particular track on the cathode-ray-tube display. The AN/FSQ-7 system weighed 250 tons and had a 3,000 kilowatt power supply. Dr. Astrahan later joined the IBM Research Division. There he was a pioneer in the development of relational database systems, participating in the development of System-R, the first project on the practical feasibility of the relational model. In the relational model, data is stored in two-dimensional tables allowing flexible storage and retrieval. The relational model has become the dominant approach to large database management, and the work on System-R led to Structured Query Language (SQL) -- a high-level language used for communicating with relational databases -- and many later developments. Dr. Astrahan was a Fellow of the IEEE (Institute of Electrical and Electronics Engineers) and received the AFIPS (American Federation of Information Processing Societies) Distinguished Service Award in 1975. In 1980 he was named a recipient of the Northwestern University Alumni Merit Award.",
  "timestamp": 1733796502.5627432
}