{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2020/phased-return.html",
  "title": "Libraries plan for phased return this summer: Libraries - Northwestern University",
  "content": "As part of Northwestern University’s recently announced plans for a phased return to campus, Northwestern Libraries are eager to communicate the resumption of select services. The following information describes the library services that will resume the week of June 8. Faculty, staff, and students will be able to request books from our circulating collections via the NUsearch online library catalog and arrange for a pick-up of requested materials at a designated time, inside the main entrance of University (Main) Library on the Evanston campus. Specific instructions for building access and material pick up will be included with your appointment confirmation. Faculty, staff, and students accessing the Library to pick up requested materials are expected to follow University health and safety guidelines by maintaining social distancing, wearing face masks and monitoring personal health. If you need books that are in your study carrel, library staff can retrieve those for you. Please contact us directly to make arrangements. Faculty, staff, and students will be able to request scans of articles, book chapters and pages from the library’s print collections using the online interlibrary loan system or the course reserves function in Canvas. Please note: Resumption of these services on the Evanston campus does not affect the resumption of services at Pritzker Legal Research Center or Galter Health Sciences Library, which are independently developing plans for renewal of services. At this time, all library buildings remain closed, and there will be no access to the libraries beyond the entry area of University (Main) Library, which will be opened only for scheduled pick-up times. You will not be able to access your study carrel, reading rooms and other public spaces of the library facilities. We realize that many find the Library a preferred place for studying, but in keeping with the broad University policy, at this stage, work that can be performed remotely must continue to be performed remotely. While some services resume and our community’s access to the physical materials in our collection expands, albeit in a limited way, we encourage faculty, staff, and students to continue using the remote and online resources that have been so essential to our community this quarter. Our subject librarians were busier than ever this spring as they helped faculty find materials for remote instruction and students access materials for remote coursework. Your subject librarians continue to be the best resource for customized assistance in finding alternatives to physical materials that remain unavailable while the libraries are closed. HathiTrust offers digital access to approximately 42 percent of Northwestern’s print collections. To see what’s there, log into the website using your NetID and password or find available titles through the NUsearch online library catalog (look for links that say, “Full Text available at HathiTrust” or “Check HathiTrust for access to full text”). We also encourage the use of Open Educational Resources (OER), which are free-to-use instructional materials issued under licenses that allow instructors to retain, reuse, revise, remix, and redistribute content. Explore OER on the Affordable Instructional Resources site or review our Adopt an Open Textbook Guide for assistance navigating these options.",
  "timestamp": 1733797151.5758853
}