{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/collection-highlights/special-projects/index.html",
  "title": "Special Projects: Libraries - Northwestern University",
  "content": "Some of the special projects related to the McCormick Library's collections strategies are below. In 2019, Northwestern University Archives launched a project to help Northwestern undergraduate Residential Colleges and student organizations like yours archive their records as part of their everyday workflow and ultimately deposit them with us for long-term preservation and access. By participating in this project, you: Our end goal is to grow and diversify Northwestern University Archives' holdings to more accurately reflect the richness of undergraduate student life. Get started with the toolkit at libraries.nu/MakeYourMark Right now, we are living history in the making.Because Northwestern University Archives strives to document the history of our institution, we have an obligation to document this history — the coronavirus (COVID-19) epidemic — and how it impacts members of the Northwestern community. Help us capture this experience as it unfolds. We are seeking volunteers who will keep and submit a journal while they \"shelter in place.” We’re interested in your revised daily routines, the effect of these changes on your academic and work lives, and the impact of practicing “social distancing.” The coronavirus has been and will continue to be life-changing for so many. Years from now, the documentation we collect today will inform us of how the pandemic impacted members of our Northwestern community and beyond. See more on this project and submit your journal at libraries.nu/DocumentingCOVID19 The charge of the Decentering Whiteness Steering Committee in Distinctive Collections is to facilitate the long term strategies necessary for dismantling racism in all facets of our work. We keep this issue front-and-center and hold ourselves and our colleagues to a commitment to identify and eradicate racist elements in our perceptions, beliefs, actions, collections, and institutions. Whiteness is a social construct that refers to the core identity of the historically-privileged category of people that occupy positions of cultural, political, and economic power in our society based on their (sometimes perceived) ethnic background and physical appearance, but the concept is complex and multi-layered. Whiteness is not just a skin color. Whiteness is an assertion of identity and power. Whiteness is an idea and a rule and a baseline. Whiteness is an imposition of hierarchical superiority. Whiteness is relational and fluid. Tied up in the idea of whiteness as the normative state are also elements of maleness, straightness, cisgendered-ness, upperclass-ness, European-ness, able-bodied-ness, and more as constituting the normal. These facets form the fabric of an idea that wields immense power and advantage with often unquestioned and unexamined authority. While we recognize the very real prejudice experienced by all of these intersectional identities, and the inability to unravel the threads of these identities, we propose that the central focus of this project remain on BIPOC individuals, ideas, and works. Our goal with this description is not to offer a prescriptive checklist by which one can cleanly determine what is white and what is not. That sort of dichotomy perpetuates the normative structures we aim to undermine. Doing this work requires self-reflection and individual engagement with the ways in which the nuanced facets of one's own identity relate to notions of whiteness, or do not. This is an ongoing process that requires a dedication to sometimes uncomfortable self-realizations. The goal is not to permanently place BIPOC perspectives in the central position of power by simply evicting the perspectives of whiteness (though this may be necessary as a starting point given the hundreds of years of structural racism). The goal is to dismantle the assumed superiority of whiteness and to build a less biased set of perceptions through which to assess, qualify, and describe individuals and the materials they create. The goal is to cultivate and value >a way of seeing the world that is diverse, equitable, and inclusive. The goal is to commit to continuing this work indefinitely. This statement relies heavily on the work on defining whiteness done by the Alberta Civil Liberties Research Centre.",
  "timestamp": 1733796759.5093591
}