{
  "url": "http://www.library.northwestern.edu/visit/visitor-privileges/accessibility-services.html",
  "title": "Accessibility Services : Libraries - Northwestern University",
  "content": "Northwestern University Libraries commits to make all of its collections and services accessible to users with disabilities. Contact Chris Davidson, Campus & Community Engagement Librarian, and Frank Sweis, User Experience Librarian for more information or assistance with access and services. Chris can be reached at c-davidson@northwestern.edu and Frank at frank.sweis@northwestern.edu. You can also call 847-491-7658 during the library's operating hours. If you require specific accommodations, please contact us ahead of your visit at library@northwestern.edu. Library staff are available for assistance while browsing the stacks - if you need assistance navigating the shelving or reaching for materials, please speak to staff at the Circulation Desk or request the materials for pickup or delivery. Masks are optional in all library spaces. University Library Accessible automatic doors are located at the north and south sides of the University Library entrance. Both entrances feature an elevator. Staff at the welcome desk are available to assist you. Deering Library A ramp and an accessible automatic door is located at the west entrance of Deering Library. An elevator is available  in the hall across from Deering 208 to access all three levels of the library, and staff at the welcome desk are available to assist you. Mudd Library Mudd Hall has accessible automatic doors at the north entrance. Mudd Library is accessible by elevator from the north lobby on the first floor. Math Library If you need materials from the Math Library, request the book to be delivered to you or please contact us at library@northwestern.edu. Accessible restrooms with clear floor space, grab bars, and accessible sinks and toilets are located in multiple buildings and areas of the Library. University Library Deering Library The closest accessible restroom is the all-gender single-stall restroom located in University Library. Mudd Library Students who wish to use an ADA parking space can see how to proceed on AccessibleNU's Parking & Transportation page. A full parking map for the University can be found at the Parking Office. Visitors with license plates or placards from a government agency may park in designated ADA spaces or at parking meters at no charge. University & Deering Library Five designated accessible parking spaces are located in the Locy parking lot.  Locy Lot1870 Campus Dr. Evanston, IL 60208 Accessible parking space are also available at the South Campus Parking Garage. Mudd Library Accessible parking is available in the North Campus Parking Garage with WildCard. North Campus Parking Garage/Academic Building 2311 N Campus Drive Evanston, IL 60208 The Libraries offer multiple quiet areas with tables and chairs for individual study: University Library Deering Library Mudd Library Accessible study rooms can be reserved online for groups of various sizes: University Library Mudd Library Service Animals as described in ADA guidelines and Northwestern’s Service, Assistance, and Other Animals at Northwestern policy are permitted in all library buildings. Service animals are defined as dogs that are individually trained to do work or perform tasks for people with disabilities. If you have questions about service animals in campus buildings, please contact the Office of Civil Rights at accommodations@northwestern.edu. Library staff are available to assist with a variety of services. If you need assistance beyond what is listed below, please reach out to Chris Davidson at c-davidson@northwestern.edu. Books and materials can be requested for pickup at Main or Mudd circulation or delivered to a home address. Librarians are available for research assistance in your subject area. For a research consultation, complete an online Appointment Request Form or contact a Subject Librarian directly. You can request scans of most articles and book chapters held in print in Evanston-campus libraries and the Oak Grove Library Center. This service is free of charge. Use your Interlibrary Loan account to request scans and access scanned items. Log in to Interlibrary Loan or create an interlibrary account. Fair use and other applicable copyright law rights and restrictions will be applied to each request. If you have larger requests, reach out to Chris Davidson at c-davidson@northwestern.edu to arrange an alternative way to access materials. SensusAccess  is an online document conversion system that converts text and image-based files into more accessible formats. It can also be used to transform text and image-based files into different outputs including audio, Braille, or e-text formats. Contact Frank Sweis at frank.sweis@northwestern.edu if you need assistance with the materials you are trying to access. Assistive software is installed on all Mac and Windows computers in the library, as well as laptops loaned from the circulation desk. Click on the software below to open help documentation. Two computers with adaptive furniture and assistive software are located in the Information Commons on Level 1. They feature height adjustable desks and chairs, and a trackball mouse. Inquire at the Information Commons desk for any assistance. Northwestern University Libraries is committed to fostering a community of access, belonging and accountability for our users.  We strive to improve digital access and user experiences in accordance with the University’s Digital Accessibility Policy, and conformance with WCAG 2.0 Level AA standards. Please contact Frank Sweis at frank.sweis@northwestern.edu if you have any issues or need any assistance with digital access. To request further accommodations or report a concern, contact the Northwestern Office of Civil Rights at accommodations@northwestern.edu. For more student services and for academic accommodations, contact AccessibleNU.",
  "timestamp": 1733797008.7261095
}