{
  "url": "https://www.library.northwestern.edu/find-borrow-request/borrowing-materials/overdue-lost-damaged.html",
  "title": "Overdue, Lost or Damaged Items: Libraries - Northwestern University",
  "content": "For questions or other payment instructions, please email the Circulation Desk at circulation@northwestern.edu If an item is overdue, lost or damaged, you may need to pay fees or fines. The due dates of all checked-out items are listed on Your Account, where they can also be renewed. Three days before an item is due, one day after it is due, and one week after it is due, we will email a notice as a courtesy. If you are not receiving notices, contact the Circulation desk to verify your email address; you are still liable for fines and fees. Northwestern charges daily overdue fines on highly desirable items, specifically equipment and course reserve recalls. Books that are not returned or renewed within the loan grace period are automatically marked with a \"lost\" status. If you have “lost” items on your account, you can incur overdue fines and/or replacement fees as well as blocks to your library account prohibiting you from checking out any new materials. In some cases, transcript holds will be placed on student accounts. Once an item goes to ‘lost’ status, the library will ask you either to replace the item or pay a replacement fee, commonly $125. Please contact circulation@northwesten.edu to discuss your options. If lost items are returned, the replacement fee will be waived. Damage can be classified as accidental (liquid, animal damage, etc.) or intentional (including highlighting, underlining in pencil or ink, or use of adhesive notes). Library staff try to note damage before an item is allowed to circulate. Patrons will be responsible for any damage that is determined to have occurred while the item was in their care. Fees are assessed according to the severity of damage. Borrowing privileges are automatically blocked (unable to check out or renew books) on accounts which: Log on to Your Account to find out why your account is blocked. Patrons unable to log in should contact circulation@northwestern.edu.",
  "timestamp": 1733796303.4214725
}