{
  "url": "http://www.library.northwestern.edu/libraries-collections/music/collection/john-cage.html",
  "title": "John Cage Collection: Libraries - Northwestern University",
  "content": " “I can’t understand why people are frightened of new ideas. I’m frightened of the old ones.” - John Cage John Cage (1912-1992) is one of the most inventive composers in American history. Through innovations such as the prepared piano, use of chance operations in composing, and using common transistor radios as instruments, he continually challenged our understanding of music. Cage’s lectures and writings are held in equal esteem to his musical compositions. The John Cage Collection held by the Charles Deering McCormick Library of Special Collections and University Archives is a major research collection containing correspondence, the Notations project scores, and ephemeral materials.  Additionally, the collection contains a handful of his musical manuscripts including Music of Changes (1951), the first work utilizing the I Ching. The collection documents Cage's entire life through primary source materials, has been central to many important publications. The correspondence collection holds letters, cards, clippings, photographs, tapes, musical scores, and visual art. Many of Cage’s artistic partners and associates are well represented including Merce Cunningham, Jasper Johns, Robert Rauschenberg and Morton Feldman. The Notations Project collection contains all 463 works and related correspondence gathered by Cage. Working with Alison Knowles, Cage communicated with hundreds of composers, artists, and writers to solicit manuscripts for inclusion in a book to benefit the Foundation for Contemporary Performance Arts. Cage published selections as Notations (New York: Something Else Press, 1969). Highlights of the collection include Pierre Boulez's Second Piano Sonata, Morton Feldman's The King of Denmark, and Steve Reich's Piano Phase. The John Cage Collection is organized into six series and two sub-series. Processed series are available to Northwestern students, faculty, and visiting researchers for on-site examination by appointment. The Northwestern University Library John Cage Research Grant is a competitive award for one or more scholars whose research requires substantial on-site use of the Cage Collection. Learn more.",
  "timestamp": 1733797497.5593345
}