{
  "url": "http://www.library.northwestern.edu/visit/maps/university-library-level-2/index.html",
  "title": "University Library Level 2: Libraries - Northwestern University",
  "content": "Text version Office space for many of the library's subject specialist librarians. Repository and Digital Curation provides digitization services and support to faculty and graduate students and is responsible for the development and administration of the Library's digital repository. For more information about the work of the department, visit the Digital Collections page. For a full staff listing, visit the staff directory. Café Bergson is located on the plaza level of University Library. The café is operated by Northwestern Dining. Contains vending machines and seating that are open at all hours that the library is open. The Mitchell Multimedia Center holds a video library with over 30,000 DVDs, including everything from documentaries to popular films to television series. Facilities include 8 self-service viewing stations equipped with VHS, DVD and Blu-ray players. Multimedia group viewing can also be arranged through the Center. The Video Theater seats 30 and is available to members of the Northwestern community for computer and multimedia presentations and other special programs. See more about the Video Theater, or submit a request with the Libraries event space request form. The Forum Room  seats 52 and is available to members of the Northwestern community for computer and multimedia presentations and other special programs. See more about the Forum Room, or submit a request with the Libraries event space request form. Northwestern Career Advancement offers career-related advisement at this location on a drop-in basis with no appointment required. The Writing Place offers peer writing consultations to assist members of the Northwestern Community throughout the writing process. For more information on services, or to schedule a consultation, visit the Writing Place website.",
  "timestamp": 1733797434.342633
}