{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2023/northwestern-joins-btaa-for-open-homework-systems-project.html",
  "title": "Northwestern joins BTAA for open homework systems project: Libraries - Northwestern University",
  "content": "Northwestern Libraries is proud to announce our partnership with Penn State University Libraries and the University of Minnesota Libraries on a project for the Big Ten Academic Alliance (BTAA) to pilot a library-led service model for supporting hosted, open source, online homework delivery systems as supplemental resources for teaching with open educational resources (OER). The project, called “Open Homework Systems: Planning and Piloting Library Support,” is supported by a two-year grant from the Institute of Museum and Library Services (IMLS). Proprietary homework systems (also called courseware) are often sold by textbook publishers for common undergraduate courses in STEM and language fields. Homework systems can offer faculty key data for their courses but are expensive for students. In the 2021-2022 academic year, students at Northwestern University paid half a million dollars for courseware, averaging $60 per student in each of the courses requiring courseware. Lauren McKeen McDonald, Open Education Librarian for Northwestern Libraries, will join the core project team of librarians for the project, which is being led by Penn State. “We’ve found that many instructors are interested in using OER textbooks within their courses, but without accompanying homework system options, it is difficult to get widespread buy-in, especially for high-enrollment courses. Academic libraries have been providing support for OER creation for years, and we believe it is essential to include free and open homework system options as part of that support. Our goal is to identify open homework systems that can provide the assessment and interactivity that instructors need, while also protecting student and faculty data,” says McKeen McDonald. The project will occur in three phases: first, an environmental scan and investigation of homework systems to identify specific departments and courses where online homework systems are required to find faculty partners and stakeholders. Simultaneously, the project team will investigate various open homework systems. Secondly, nine courses across the three participating institutions will pilot open homework systems with OER, while providing training and guidance on the systems. Finally, a toolkit will be developed and disseminated with documentation of the findings, conclusions, and recommendations for other libraries and institutions looking to use open homework systems. Please contact Lauren McKeen McDonald at lauren.mckeen@northwestern.edu with any questions.",
  "timestamp": 1733796831.9592636
}