{
  "url": "https://www.library.northwestern.edu/visit/technology/index.html",
  "title": "Technology and Computing: Libraries - Northwestern University",
  "content": "Visitors to the library can use our computing equipment and connect to online resources. Computers are located throughout the University Library and other library locations. In addition to a full suite of standard software, many are equipped with specialized software for individuals with disabilities and GIS applications. Printers, scanners, large-scale plotters, collaborative screen sharing stations and smartboards are also available. Located in Mudd Library, the Self-service Video Studio is a video recording setup that is free and easy to use. Reserve the room and follow the instructions in the space. If you have any questions, contact the Mudd Library information desk at 847-491-3361. In addition to the One Button Studio, Mudd Library is also home to Lightboard, which is a glass chalkboard that uses light to allow users to face viewers while writing and recording a lecture. See a video of Lightboard in action. Reserve video production studio at Mudd Library Computers, iPads, cameras, microphones,  and other equipment are available for short-term checkout to Northwestern students, staff and faculty. Learn more about borrowing these items. A Bloomberg Terminal is located in the John B. McGowan Information Commons on Level 1 of University Library. The Bloomberg Terminal is available to Northwestern University faculty, staff, and students only. You must create a log in. A cell phone number will be necessary to authenticate a new user. The Bloomberg Terminal is a global financial services system that provides financial, economic and government information covering all market sectors. It features company financials, market data spanning more than 20 years, charts, statistics and current news reports. The Bloomberg Terminal is a dedicated computer terminal for accessing financial data electronically. It seamlessly integrates real-time and historical information on about 5 million bonds, equities, commodities, currencies and funds. It also comprises data on almost every publicly traded company and biographies of more than 1 million people. It has financial, political, and business news as well. See the user guide for more information.",
  "timestamp": 1733796399.6926847
}