{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/plan-a-visit/reading-room-policies.html",
  "title": "Reading Room Policies: Libraries - Northwestern University",
  "content": "We welcome all students, faculty, scholars and members of the general public to use our reading room to consult the holdings of the McCormick Library. The Reading Room is open to all by appointment to the hours listed on Plan a Visit. Patrons are required to show a current valid photo ID upon arrival at the University (Main) Library or Deering Library Welcome Desk. The McCormick Library Reading Room is on Level 3 of Deering Library. Research appointments are required for non-Northwestern researchers and strongly encouraged for Northwestern students, faculty, and staff. Please email specialcollections@northwestern.edu or read more to plan your visit. Patrons must request access to materials through the McCormick Library Request System; a user account is required. Delivery of materials for same-day use is not guaranteed. Some materials are held off-site and require 48-hours’ advanced notice for access. All materials should be returned to the service desk no later than 4:30 pm. McCormick Library staff will pull a maximum of 15 boxes per patron request. Patrons will be assigned a seat at a research table where there materials will be waiting for them. Patrons can retrieve Ready Reference items from the Reading Room book shelves but must return them to service desk when finished. To help preserve materials, patrons must: Materials can be placed on hold for up to 10 business days (2 weeks). Pencils, silenced electronic devices (cell phones, laptops, cameras, etc.), books, notebooks, and loose paper are permitted at the reference tables for note taking. Other personal items (such as pens, computer cases, bags, food, drinks) can be stored in available lockers. The Reading Room is under video surveillance. Some patron data (including but not limited to the information provided by patrons in research requests, registration forms, and surveillance recordings of the reading room) may be retained and accessed at the discretion of the McCormick Library staff for administrative and security purposes. Northwestern University Libraries does not sell or otherwise distribute personally identifiable patron data except where required by law. Patrons are welcome to use cameras or cell phones to take photographs of non-restricted materials for research purposes or patrons may use the self-service scanner for up to 30 minutes at a time once they have notified McCormick Library staff of their intention to scan. At no charge, the McCormick staff can scan up to 50 pages or spend up to 30 minutes' scan time (whichever comes first) of paper-based materials per research request. Anything beyond that amount is addressed on a case-by-case basis. Turnaround time will vary based on available resources. Patrons can contact the McCormick Library staff if they are interested in reproductions of audio-visual or born-digital materials. Staff reserves the right to limit the number of scans based on physical condition of material or available staff resources. Submit your request using our online request form or email specialcollections@northwestern.edu Request reproductions Permission to consult materials does not convey the right to reproduce or publish. Materials digitized, photographed, scanned, or otherwise reproduced are for use by patrons for research, teaching, and private study. Unauthorized distribution or commercial use of reproductions is not permitted. Responsibility for copyright clearance is assumed by the patron. The patron assumes sole responsibility for and agrees to defend and indemnify Northwestern University and its Board of Trustees, officers, employers, and agents for all claims, demands, costs, or expenses (including attorneys’ fees) resulting from any infringement of the literary rights, copyrights, or other rights pertaining to this materials. See Northwestern University Libraries’ full Rights, Permissions and Reproductions Policies When accessing the McCormick Library collections, patrons may encounter Social Security numbers or information protected the by the Family Educational Rights and Privacy Act (FERPA) or the Health Insurance Portability and Accountability Act (HIPAA). Patrons will not record, reproduce, or disclose any Social Security numbers or protected FERPA or HIPAA information that may be included in the materials requested. Patrons are expected to observe all policies for conduct in the libraries' buildings. Note: failure to comply with any of the above policies and procedures may result in the loss of research privileges for the McCormick Library.",
  "timestamp": 1733796755.0924952
}