{
  "url": "http://www.library.northwestern.edu/libraries-collections/oak-grove/index.html",
  "title": "Oak Grove Library Center: Libraries - Northwestern University",
  "content": "All items shelved at OGLC are available via NUsearch, or by contacting University Library circulation desk at 847-491-7633 or circulation@northwestern.edu. Some texts can be scanned and requested via Interlibrary Loan. Any Northwestern-affiliated patron or registered guest can request items, which can be available as soon as the next business day. For more on placing a request, see the FAQs below. The relocation of some general collection materials addresses the overcrowding of library shelves, provides flexibility for more study and collaboration spaces and makes room for new printed materials. Questions? Review our FAQs below or contact Christopher Karch at 847-467-4401 or christopher.karch@northwestern.edu. What kinds of materials are housed at the Oak Grove Center? Collections at Oak Grove will include low-use print materials, many with online equivalents, from Northwestern University Library, Galter Health Sciences Library and the Pritzker Legal Research Center. Oak Grove will provide a safe, secure environment for these materials. How can I request items from Oak Grove, and how long will it take to arrive? All items shelved at OGLC are available on demand via NUsearch to all Northwestern-affiliated patrons and registered guests. Requests may also be made via email or over the phone: call the University Library Circulation desk 847-491-7633 or email circulation@northwestern.edu Items requested by 11:00 am Monday through Friday are generally available at the University Library circulation desk the next business day. Please allow at least another business day for office delivery or delivery to other libraries. How do unaffiliated guests request publications housed at the OGLC? An unaffiliated user can place a request through the circulation desk. The patron will be notified when the item is available for pick up. Is there weekend delivery of materials from Oak Grove Library Center? No. Delivery, including the scanning of articles and book chapters, is available Monday – Friday. What are the loan periods for items at the Oak Grove Library Center? Loan periods vary based on the category of requester such as faculty, staff, student, alumni, or guest and are the same as for items from the other Northwestern library locations. Some categories of library materials do not circulate. Users requesting such items from the OGLC can make arrangements to use them onsite at the library to which they are delivered. Read a detailed description of our loan periods. What is the limit on the number of materials that can be requested per day? There is no limit at this time. This policy will be reevaluated periodically; a limit may be put in place at a later date as requests for materials at Oak Grove increase. How do I request an electronic copy of an article or chapter? Articles and book chapter scan requests may be placed through your Interlibrary Loan account. Please provide us with citation information for the item you are requesting and we will fill your request as soon as possible. All scanned materials will be delivered through your Interlibrary Loan account. Where can I pick up items delivered from Oak Grove? When you request an item from Oak Grove, you can choose to pick it up at the University Library circulation desk, Pritzker Legal Research Center, Galter Health Sciences Library, or the Mudd Library circulation desk. Will faculty book delivery be offered for items in Oak Grove? Yes, Evanston faculty can have circulating materials from Oak Grove delivered to their Evanston campus office by selecting that option in the “Pickup Location” section on the “Item Request form.\" Where do I return items that I get from the Oak Grove Library Center?  Oak Grove Library Center materials can be returned to any Northwestern University Library circulation desk or book drop. Is the OGLC open to the public? There is no reading room or access to the OGLC by the public. Items must be requested for pick-up at another Northwestern library. If it is not possible to identify the exact volumes to request, please consult with a librarian. What are the fines for overdue items checked out from the Oak Grove Library Center? Fine policies for items kept at Oak Grove will be the same as for items from other Northwestern libraries.",
  "timestamp": 1733796957.6545093
}