{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2023/kevin-leonard-appointed-university-historian.html",
  "title": "Kevin Leonard appointed University Historian: Libraries - Northwestern University",
  "content": "Dean of Libraries Xuemao Wang has appointed Kevin Leonard ’77, ’82 MS, the current University Archivist, to the new role of University Historian, effective January 1, 2024. For the Northwestern community here and beyond campus, Leonard is widely known as the foremost authority on the history of the University, brimming with knowledge about the people and events that have shaped this institution since its founding. Leonard, who earned undergraduate and graduate degrees from Northwestern in 1977 and 1982, joined the Libraries staff as a student. He has worked here ever since, moving to University Archives in 1980, and becoming University Archivist in 2009. In that time, he has earned his reputation as an accomplished collector of history, an oft-requested public speaker, and a friendly raconteur among patrons who stop by his office. Leonard has been particularly effective at building relationships with alumni and faculty, many of whom contribute their materials to the Archives for posterity. In the new role of University Historian, Leonard will focus on outreach and alumni engagement, while the duties of working with patrons, answering reference queries, and processing collections will continue with a yet-to-be-filled University Archivist role. That position will be posted soon. “Kevin wins people over with his enthusiasm for all things Northwestern, so it makes sense to create a new role that lets him focus on precisely that,” said Dean Wang. “Now more and more people will get to encounter him as an ambassador of the Libraries and I know it will only further our academic mission.” As University Historian, Leonard looks forward to his ability to elevate the outreach portions of the Archivist role but in the end all this work contributes to a common purpose. “Ultimately, the hope is that the materials we collect will help people better understand the world in which we live,” he said. “I am grateful I get to play a small part in that effort.”",
  "timestamp": 1733796829.7930222
}