{
  "url": "https://www.library.northwestern.edu/faculty-staff/index.html",
  "title": "Faculty & Staff: Libraries - Northwestern University",
  "content": "We are available to assist with discipline-specific research services, in-depth research assistance and classroom instruction. Subject librarians are liaisons who serve as the primary contacts between the library and an academic department, program or a group of scholars with special research needs. FIND YOUR SUBJECT'S LIAISON LIBRARIAN Subject librarians offer numerous specialized services, including discipline-specific research consultations, information about scholarly communication topics, customized instruction on library resources, and general information on library services. They also develop and manage specific subject collections, and may be contacted directly for questions or purchase suggestions. Faculty can borrow most circulating items for the entire academic term, and staff can borrow for 16 weeks; items from the Mitchell Multimedia Center and Reserve have shorter loan periods. Our circulation services for faculty include delivery to Evanston campus offices for full-time faculty and delivery via email of scanned book chapters and articles via interlibrary loan. A research assistant doing research for a faculty member may also be assigned proxy borrowing privileges on the professor's behalf. Visit the Affordable Instructional Resources (AIR) site for more information on these and other affordability initiatives on campus. Regular reserve allows your students to check out class materials from a central location for a short period of time. Similarly, eReserve provides access to digital documents, such as book chapters and articles, through Canvas. Copyright law places some restrictions on Reserve use of copyrighted material, particularly use by eReserve. For more information about the process of placing items on reserve, as well as copyright restrictions, see Reserve Information for Faculty. The Library's Reserves department will create media streams for University classes and other programs for faculty, students and staff. These streams can be viewed or heard on Canvas course sites. CDs, LPs, audio cassettes, VHS, DVD, Blu-ray, DV and laserdiscs can be converted. Learn more and submit a request. Repository services, copyright guidance, data management planning, open access publishing and more. We provide training and technical solutions for conducting, preserving, and sharing your research.",
  "timestamp": 1733796279.0475729
}