{
  "url": "https://www.library.northwestern.edu/find-borrow-request/borrowing-materials/privileges.html",
  "title": "Borrowing Privileges: Libraries - Northwestern University",
  "content": "Use the tabs below to learn about your loan periods, loan limits and how to borrow. Currently enrolled Northwestern undergraduates can borrow items with their Wildcards. Students with an incomplete or on a leave of absence can obtain a three-month Borrower's Card to check out items. Contact the Circulation Department at 847-491-7633 or circulation@northwestern.edu to learn about the required documentation and steps to obtain a card. Note that a Borrower's card does not grant access to Northwestern Libraries' online databases, but visitors can obtain a GuestNetID for database access. Enrollment in a paid tuition class or section is required for library circulation privileges. The loan period below is for items from the University Library's general collection. Items from the Marjorie I. Mitchell Multimedia Center and items on Reserve for a class have shorter loan periods. A due date could be shortened in the following circumstances: Currently enrolled graduate students and faculty members can borrow items with their Wildcards. Retired faculty can obtain Wildcards and borrow items, as well. (See Services for Retired Faculty & Staff for more information or fill out the Borrower's Card Request Form to apply.) The following groups, which do not have Wildcards, can obtain a Borrower's Card to check out items: Contact the Circulation Department at 847-491-7633 or circulation@northwestern.edu to learn about the required documentation and steps to obtain a card. Note that a Borrower's Card does not grant access to Northwestern Libraries' online databases, but visitors can obtain a GuestNetID for database access. Enrollment in a paid tuition class or section is required for library circulation privileges. The loan period below is for items from the University Library's general collection. Items from the Marjorie I. Mitchell Multimedia Center and items on Reserve for a class have shorter loan periods. A due date could be shortened in the following circumstances: Staff members can borrow items with their Wildcards. Retired staff, employees of University contractors on the Evanston campus and temporary employees can obtain library borrowing privileges with a valid Wildcard. If you are eligible to apply for a borrower's card, please fill out the Borrower's Card Request Form. The loan period below is for items from the University Library's general collection. Items from the Marjorie I. Mitchell Multimedia Center have shorter loan periods. A due date could be shortened in the following circumstances. Those outside of the Northwestern community may be able borrow items in the following circumstances: Note that a Borrower's card does not grant access to Northwestern Libraries' online databases, but visitors can obtain a GuestNetID for database access. A Borrower's card also does not grant access to Northwestern interlibrary loan. If you are eligible to apply for a borrower's card, please fill out the Borrower's Card Request Form. Contact the Circulation Department at 847-491-7633 or circulation@northwestern.edu with questions. The loan period below is for items from the University Library's general collection. Items from the Marjorie I. Mitchell Multimedia Center have shorter loan periods. Note that a due date could be shortened if an item is recalled for Course Reserve; in this circumstance, you would be notified via email of the new due date (overdue fines will apply).",
  "timestamp": 1733796301.2526681
}