{
  "url": "http://www.library.northwestern.edu/about/administration/policies/niso-odi.html",
  "title": "NISO Open Discovery Initiative : Libraries - Northwestern University",
  "content": "The Northwestern Libraries supports the NISO Open Discovery Initiative (ODI) and transparency in discovery. As part of this, we're sharing our current practices in an ODI conformance statement. This statement will be revisited and updated annually. Questions can be directed to Geoff Morse at gmorse@northwestern.edu. Conformance statement last updated in December 2021. The NISO Open Discovery Initiative (ODI) defines best practices and/or standards for library discovery systems that are based on a large centralized index of content. The content indexed in discovery systems comes from a wide array of content providers and is presented to the user in a single interface. The best practices described in the ODI recommended practice document define ways for libraries to assess discovery systems and content provider participation in these systems; streamline processes for content providers to easily work with discovery system vendors; ensure discovery systems are employing fair linking in their results; ensure that libraries have correctly configured their discovery systems. There is a standing NISO ODI Committee that updates the recommended practice and promotes ODI through the library, discovery provider, and content provider communities. NISO maintains checklists for Discovery providers, Content providers, and Libraries that help them work towards becoming compliant with the recommended practice. Northwestern Libraries are committed to ODI because the best practices have a positive impact on the library user’s searching experience. The recommended practice helps ensure that relevant content is appearing in the library user’s search results. ODI also promotes and encourages all content providers to provide their data to all discovery providers. This also is in the interest of library users who, regardless of the discovery system implemented at their local library, will locate relevant content more easily when it is provided equally across platforms. ODI also encourages transparency and cooperation between content providers, discovery providers, and libraries so the library patron can locate material as easily and seamlessly as possible.",
  "timestamp": 1733797591.1597958
}