{
  "url": "https://www.library.northwestern.edu/libraries-collections/mudd-library/technology-spaces/maker-lab.html",
  "title": "MakerLab : Libraries - Northwestern University",
  "content": "A consultation is recommended before using the MakerLab independently. Complete the consultation form to submit your project details. If you would like to submit a 3D Printing Project for library staff to print, use the 3D Printing Project Request form. Mudd Library offers mediated 3D printing and 3D scanning services to current Northwestern University students, faculty, and staff. A consultation with library staff is required before using the MakerLab. You may also submit a 3D printing project request for library staff to print. Printing and scanning are done on a first-come, first-served basis with priority for students completing course work. During the consultation, an estimate of turnaround time will be provided within the context of workload across the service. Request a consultation There is currently no charge for 3D scanning, 3D printing, or the filament used for printing. The filament is supplied by the library. Cost is subject to change. This service is in a trial period. Any output of a print job not picked up in 14 days becomes the property of University Library and will be disposed of accordingly. 2 – Bambu Lab P1P Series Build Volume: 256 x 256 x 256 mm (10 x 10 x 10 inches) Supported File Types: STL, OBJ, STEP 2 – Bambu Lab X1-Carbon Combo Build Volume: 256 x 256 x 256 mm (10 x 10 x 10 inches) Supported File Types: STL, OBJ, STEP 2 – Elegoo Neptune 3 Max Build Volume: 420 x 420 x 500 mm (16.5 x16.5 x 19.7 inches) Supported File Types: STL Simplify3D (on computers in MakerLab)SketchUp Pro (on 20 concurrent public workstations)MakerBot PrintMeshLabMeshMixerSolidworks (free with campus license) The library’s 3D printers and scanners must be used for lawful purposes. Users must abide by all applicable local, state, and federal laws as well as University and Library policies while respecting the University community.  It is not permitted to use library 3D printers to create material which is: Read full MakerLab Use Policy. We are interested in adding and changing MakerLab services to meet the needs of the Northwestern community. We welcome your feedback and suggestions. Contact us at muddmaker@northwestern.edu.",
  "timestamp": 1733796775.7758899
}