{
  "url": "http://www.library.northwestern.edu/libraries-collections/music/about/index.html",
  "title": "About the Music Library: Libraries - Northwestern University",
  "content": "The Music Library supports the instruction, research, study and performing needs of students and faculty of the Bienen School of Music and the entire Northwestern community.  Books, scores, sound recordings, electronic databases, and other materials of all historical periods, genres and traditions are collected. The Northwestern University Music Library was established in 1945 when Jean Kauffman was hired as Music Librarian and given the duty to organize a collection of reference works, printed music and sound recordings in a room of the Music Administration Building. By 1960, the Music Library had grown considerably, occupying an entire wing of the building. After Kauffman's retirement in 1968, Don L. Roberts was appointed Head of the Music Library in 1969, a position he held until his retirement in 2002. Aiming to develop a music collection of international distinction, Roberts placed emphasis on collecting music composed since 1945 and, through arrangements with publishers and dealers from around the world, developed the most extensive collection of contemporary music held by any academic library. During this period, the Music Library also began acquiring music manuscripts and archival collections, including the Fritz Reiner Library, a portion of the Moldenhauer Archives and the John Cage Collection.An exhibit on Don L. Roberts, including an oral history on his time with the Music Library, can be visited here. Due to the collection's continual expansion, the Music Library moved in 1972 from the Music Administration Building to a larger facility at 1810 Hinman Avenue. In 1976, the library moved again to the second floor of Deering Library. After thirty years of tremendous collection growth, the library expanded further in 2006 by moving its book collection to the first level of Deering. D.J. Hoek was appointed Head of the Music Library in 2004, remaining in this role until hired as Associate University Librarian for Collection Strategies at Northwestern University Libraries. Greg MacAyeal was named Curator of the Music Library in 2015. The Music Library today offers a wide range of resources and services to serve the Northwestern University School of Music's many programs as well as the needs of researchers from around the world. Maintaining particular emphasis on music composed since 1945, the Music Library continues to build its holdings of contemporary works through extensive acquisitions of printed music, sound recordings, and rare materials. Notable recent additions include the archive of the publishing firm American Music Edition, a collection of letters by Edgard Varèse, and manuscripts by Samuel Barber, Lou Harrison, Iannis Xenakis, and other prominent composers. Over the summer of 2021, the entire circulating music collection was relocated to the Main Library, 3 South. This temporary move is made to allow the collection to consolidate in advance of a major Deering Library renovation. The current Curator of the Music Library is Gregory MacAyeal. Email him at g-macayeal@northwestern.edu.",
  "timestamp": 1733797352.4401836
}