{
  "url": "https://www.library.northwestern.edu/libraries-collections/government-collection/government-information.html",
  "title": "Government Information Collection & Services: Libraries - Northwestern University",
  "content": "Northwestern University Library uses SuDoc call numbers for U.S. Federal documents. Learn more about the SuDoc system, which arranges items by the issuing department or agency rather than subject. Dewey and LC call numbers are used for state, local and many international publications. United Nations Official Publications are arranged by the UN classification scheme. Not all government materials are cataloged in NUsearch and the organization schemes may be unfamiliar. We encourage you to visit the Libraries or contact us for assistance identifying and using these materials. Northwestern University Libraries has been a federal depository library since 1876, receiving materials through the Federal Depository Library Program.  The collection features Congressional reports and hearing transcripts, laws, regulations, demographic data from the Census Bureau, economic statistics, studies and reports generated by federal agencies, and presidential papers.  Informational materials about federal service programs and topics such as careers, running a small business, health and nutrition, civil rights, women and children are also available. Publications from the State of Illinois have been regularly acquired since 1971. City of Chicago publications are selectively acquired emphasizing city budgets, annual financial reports, municipal codes, and demographic reports.  The most complete collection of publications of the City of Chicago is at the Chicago Public Library’s Municipal Reference Collection (at the Harold Washington Library Center). International intergovernmental organization (IGO) publications are actively acquired and the Libraries’ collections span WWI to the present.  The Libraries are a depository for publications and documents from the United Nations (1946-present), European Union (1970-present), Organization of the American States (1962-2008), and World Tourism Organization (2002-present).  The Libraries collects publications from 25 additional IGOs including the World Bank, International Monetary Fund, International Labour Organization, Organization for Economic Cooperation & Development, and the World Health Organization.  IGO publications address Issues that transcend borders including development, globalization, finance, health, labor, migration, refugees, trade and war. IGOs also work to promote human rights, protection of the environment, and investigate issues relating to women and children.",
  "timestamp": 1733796439.2794054
}