{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2023/james-lee-fills-new-leadership-role-in-academic-innovation.html",
  "title": "James Lee fills new leadership role in academic innovation: Libraries - Northwestern University",
  "content": "James Lee joins Northwestern on September 1 as associate University librarian for academic innovation. He also begins a joint appointment as a tenured associate professor in the Medill School of Journalism, Media, Integrated Marketing Communications. In his new position, Lee will extend the Libraries’ mission of building new academic collaborations and partnerships with Northwestern’s colleges and schools, centers, departments, and other units, specifically by applying and developing new methods of digital scholarship and data science. His work will significantly strengthen the Libraries’ role as a nexus for academic collaboration and a catalyst for innovative interdisciplinary research and learning. Lee will engage with librarians, technical experts, faculty, students, and staff across academic programs to enrich the span of Northwestern’s research services and promote new research methods, learning experiences, and modes of scholarly publishing. As a Medill faculty member, he will expand his research and teaching in the areas of digital humanities, machine learning, and data visualization and their applications in journalism and integrated marketing communications at both undergraduate and graduate levels. Previously Lee was a leader in digital scholarship at the University of Cincinnati, where he was the associate vice provost for digital scholarship, director of the Digital Scholarship Center, and director of the interdisciplinary data science AI for All Lab. His research and teaching are focused on digital humanities, social network analysis, data visualization, and applying machine learning and text mining techniques to historical archives. Lee received his BA from Cornell University and his PhD from the University of California, Berkeley.",
  "timestamp": 1733796836.2770586
}