{
  "url": "https://www.library.northwestern.edu/about/facts/library-history.html",
  "title": "Library History: Libraries - Northwestern University",
  "content": "Learn about milestones in the history of Northwestern University Libraries, starting when \"the commencement of a library\" was approved by the fledgling University's board of trustees in 1856. Just five years after Northwestern’s founding, the University’s first modest library opened on the third floor of Old College, the original campus building. It held just a few thousand books. The growth of the library surged after the death of a Prussian educational official who had amassed a carefully curated library of 20,000 books. When the Prussian government declined to acquire the collection, Daniel Bonbright, the former head of Northwestern’s library, urged the University to purchase what would be known as “the Greenleaf Library” for university trustee Luther Greenleaf, who financed the purchase. The collection increased the library’s size sevenfold and it remains one of Northwestern’s treasures. The library moved from Old College to University Hall, and it filled its allotted 70-foot by 20-foot space within three years. The library was designated a depository of U.S. Government publications, triggering a steady flow of materials that exacerbated space constraints. A University co-founder contributed much of the funding (as well as the name) for Orrington Lunt Library. (Today, it is now Lunt Hall, home to the Mathematics Department and the Mathematics Library.) At the time, a local paper called its splendor and craftsmanship “not surpassed by any library in the country,” and served as a fitting home for “one of the finest, if not the finest college library in the West.” Theodore W. Koch became University librarian. During his 22-year tenure, Koch presided over an exciting time of growth, both in collections and building space. Collections swelled from 120,000 volumes to 377,000, and circulation increased between 1931 and 1940, from 220,000 to 320,000. The Joseph Schaffner Library was dedicated at Wieboldt Hall on the Chicago campus, endowed by the family of Schaffner, a late University trustee. After years in which window ledges, stairways, desks, and even user seating in Lunt Library were all gradually being converted into storage space, Northwestern opened Charles Deering Library with a bequest by agricultural equipment magnate Charles Deering. The library, designed by prolific architect James Gamble Rogers, was built to emulate King’s College Chapel. With a capacity for capacity of 500,000 volumes and seating for 900 readers, the library solved the space solutions for many years. It remains one of the principle landmarks of campus. Koch’s successor, Effie A. Keith, created a 25,000-volume library to serve the new Technological Institute. Keith would also acquire the library of anthropologist Franz Boas, which became the cornerstone of Northwestern’s Melville J. Herskovits Library of African Studies, now the single largest separate collection in the world of materials from or relating to Africa. The Music Library was established in a room of the Music Administration Building. (It didn’t move to Deering Library until 1976.) Today the Music Library is an internationally renowned collector of 20th Century music. The Transportation Library was founded to support the curricula and research programs of the Transportation Center and Northwestern’s Center for Public Safety, including the School of Police Staff and Command. Today it is one of the largest transportation information centers in the world. With space again approaching a premium in Deering, Northwestern opened University Library, designed by architect Walter Netsch, of Skidmore, Owings and Merrill. The building debuted with a new advance in library technology: a fully online library circulation system that automated much of the library’s daily operations. The system, later christened NOTIS, would go on to include cataloging and acquisition operations and influence the development of library systems around the world. The science and engineering library moved to the new Seeley G. Mudd Library and became the principal library of north campus. Following the death of Charles Deering McCormick (grandson of Charles Deering),  his wife Nancy endowed and named the Charles Deering McCormick Library of Special Collections, now home to all rare books and artifacts in the library’s collection. The library opened the Oak Grove Library Center, an offsite shelving facility that holds low-circulation books, journals and other materials in a climate-controlled environment. It is the most recent and perhaps final salvo in the struggle to find an answer to the eternal quest for adequate space. In 2012, the front-facing doors of Deering Library were reopened to the public. References: Caldbeck, E., & Garrett, J. (2003). Northwestern University Libraries. In Encyclopedia of Library and Information Science. (pp. 2165-2178). New York, NY: Marcel Dekker, Inc.",
  "timestamp": 1733796539.9975502
}