{
  "url": "http://www.library.northwestern.edu/visit/classrooms/study-carrels.html",
  "title": "Study Carrels: Libraries - Northwestern University",
  "content": "Apply online for a study carrel. There is a comment area on the application where you can indicate your preferences, general or specific. Be sure to indicate if you are interested in a desk in the Music Library. Honors undergraduates and PhD candidates may submit letters verifying their status in person or via email. A research study carrel is a desk in the library that may be assigned to graduate students, faculty, or undergraduates working on a senior honors thesis. If you have a carrel assignment, you can check out library books to it and store them there for an extended period, unless they are recalled for Course Reserve. The library has several different types of carrels available to qualifying members of the Northwestern Community. The library has numerous open carrels throughout the University Library towers.  Current Northwestern graduate students, and undergraduates working on a senior honors thesis, qualify for an open carrel. Senior honors thesis undergraduates must supply additional documentation in the form of a letter from their advisor or proof of registration in a relevant seminar. Apply for a study carrel Assignments will be made on a first come, first served basis as applications are received. Processing time will vary during periods of high demand.  PhD Candidate carrels are shared, with two people assigned to each carrel room. The demand for PhD closed room study carrels far exceeds supply, but you can apply for our waiting list by submitting a Study Carrel application. The average wait for a closed-room study carrel is eight months, but actual time may vary. Graduate students must already be admitted to Candidacy before they can request to be placed on the waiting list. Faculty carrels are single occupancy. The demand for Faculty single closed Study Carrel rooms exceeds supply, but you can apply to our waiting list by submitting a Study Carrel application.",
  "timestamp": 1733797256.8376238
}