{
  "url": "https://www.library.northwestern.edu/about/support/university-archives.html",
  "title": "Donating to the University Archives: Libraries - Northwestern University",
  "content": "Northwestern has been building its University Archives since 1935. The Archives obtain and add to its holdings by receiving University records transferred by offices and departments; and by the donation of faculty members' personal papers; student organizations' records; and the personal papers and memorabilia of alumni and friends. Use the information below to learn about what the Archives collects and how to donate these materials. Our staff are happy to answer questions and help arrange for material pickup or transfer. Contact the McCormick Library at 847-491-3635. University Archives welcomes materials that contribute to documenting faculty careers. These include the following types of items, but this list is by no mean definitive or exhaustive. University Archives is the official repository for all University records of administrative or historical value. University records are materials created, received, or accumulated by a unit or employee of Northwestern University in the conduct of University business. These could be paper-based records or records created, transmitted or stored electronically. These records include: University departments and units can contact Archives staff at 847-491-3354 for a consultation regarding records on file. If we determine that the records have administrative or historical value, they will be transferred to the Archives, organized according to archival standards, and stored in a secure, climate-controlled environment. An inventory of their contents will be prepared, and you will be able to consult the records at any time during the University Archives' regular hours. Departments and units can also donate new publications and records. University Archives encourages departments to: For more information, review the Northwestern Policy on Records Retention and Disposition. This document and its appendix outline what goes to the Archives and what doesn't. Don't hesitate to call the Archives before making a final decision or if you have questions. The University Archives accepts materials from students, student groups and NU alumni. These materials shed light on student life and on the academic experience at NU, and they help us complete our holdings of student- and University-produced publications. Typical items welcomed by the University Archives include: Donations of these materials are considered gifts to the University Archives. Donors are asked to sign an agreement which formally signifies that the materials become the actual property of the University Archives. The Archives only accepts materials as permanent gifts and cannot take them as loans or on a temporary basis. As part of the Archives' permanent collection, your materials will be organized according to archival principles, stored in secure, climate-controlled conditions, and will be made available to researchers on a non-circulating basis.",
  "timestamp": 1733796577.2841525
}