{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2021/new-organization-development-head-to-take-on-dei-leadership.html",
  "title": "New organization development head to take on DEI leadership: Libraries - Northwestern University",
  "content": "Victoria O. Akinde joined the Libraries in June in the new role of Director of Organizational Development and Diversity. As head of ODD, Akinde serves as the leader for the human resources office, with the added responsibility of coordinating all equity, diversity and inclusion initiatives at the Libraries. She represents the Libraries in committees across campus, in the community, in consortia and with professional organizations. Akinde is the former director of access services Schaumburg Township District Library. As the co-chair of that library’s DEI committee, she fostered the ongoing work of understanding implicit bias and its implications in the workplace. In coming to Northwestern, she also leaves a teaching and adjunct librarian appointment at Harper College. She has been a member of the Village of Hanover Park's Cultural inclusion and Diversity Committee for five years. Akinde began her career in the banking industry with roles in recruiting, HR tech support, and HR information systems. She holds a EdD in Community Leadership from Ferris State University, an MLIS from University of Illinois, Urbana Champaign, and a BA in Human Resource Development from Northeastern Illinois University. She is credentialed as a SHRM Certified Professional. “I look forward to collaborating with members of the Libraries community to learn about and meet the needs of both the Libraries’ community and the Northwestern community at large,” she said. “On occasion, I can be found engaging in the following activities in order of importance. Eating, sipping tea, reading while lounging, sleeping, watching movies, traveling, fast walking/running, using power tools, and numerous attempts at learning to play the violin.”",
  "timestamp": 1733797136.4132128
}