{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2019/special-collections,-music-stacks-closure.html",
  "title": "Special Collections, Music stacks closure: Libraries - Northwestern University",
  "content": "Beginning on June 3, the Charles Deering McCormick Library of Special Collections will be entirely closed, with no access to collections. The Music Library stacks will be closed to patrons during this period as well. All collections are expected to reopen in mid-October. UPDATE: Starting on July 29 there will be no access to the music books and scores housed in the Music Library stacks. This closure will last approximately eight weeks, until mid-September. During this time, we encourage you to utilize our great network of partner institution collections via Interlibrary loan. To place a request, sign in to your account in NUsearch and click \"request\" on the item record. Also during this period, the elevator in Deering Library will not be operational for public use, but all floors may still be reached by the central stairs and will remain fully accessible by alternate entrances from University Library.  These closures are required to undertake an extensive project to address air quality concerns in certain areas of Deering Library. Testing indicated the presence of microbial growth on certain physical volumes that are sensitive to abnormal temperature and humidity conditions. Although indoor air quality results did not indicate the presence of airborne mold spores beyond what would normally exist in an indoor environment, Deering Library will undergo a thorough cleaning so that we can provide the best environment possible for the Northwestern community and our collections.  The cleaning project and associated closures are expected to begin on June 3, 2019; the estimated date for completion is October 10, 2019, at which time we hope to return to usual services and means of access to facilities and collections. These dates are subject to change, and if the project requires closures to be extended, Northwestern University Libraries will notify the campus community. Throughout these months, the University Libraries will strive to minimize inconveniences and continue to offer its usual high level of service. This includes providing any materials needed for study and research, whether from our own collections or through interlibrary loan from partner institutions. Our librarians and staff are ready to assist with any requests. Questions about the status of this project, access to collections, assistance with interlibrary loan, or any other matters may be directed to library@northwestern.edu.",
  "timestamp": 1733797164.5598803
}