{
  "url": "http://www.library.northwestern.edu/libraries-collections/mudd-library/technology-spaces/index.html",
  "title": "Technology & Spaces: Libraries - Northwestern University",
  "content": "In addition to standard computers, printers, and software, the Libraries offer spaces, tools, and labs to enhance your learning and expand your research capabilities. Collaborative areas have day-use lockers, white boards, moveable chairs and tables, and screen sharing options. Quiet study spaces have study tables and individual comfy seats. Study rooms are small, enclosed rooms for groups of 2-8 people, ideal for studying, tutoring, working on a small group project, or interviewing. Visit the reservation page to get specific information on room capacity and equipment. For recurring reservation requests, email mudd@northwestern.edu. Equipped with multiple projections screens and flexible furniture, the active learning classroom 2124 is designed for interactive, student-centered library instruction. These rooms can be used for faculty-librarian partnerships to enhance a course. No recurring reservations are accepted at this time. Visit the Libraries' main classroom page or contact mudd@northwestern.edu for more information. The GIS lab has four high performance PC workstations, each equipped with dual monitors. These  workstations are designed for use by students, faculty, and staff who are interested in doing geospatial or data projects.  Contact gis@northwestern.edu to set up a consultation, or visit the GIS page. The MakerLab gives students, faculty, and staff the opportunity to bring their designs to life. The space is equipped with a 3D scanner and printers, as well as the software needed to create designs. A consultation is required to use the MakerLab. For more information, visit the MakerLab page. The Video Production Studio allows students, faculty, and staff to produce and record professional-quality videos at no cost. Equipped with Self-Service and Lightboard technology, the Video Production Studio can be reserved online. For more information, visit the Video Production Studio page.",
  "timestamp": 1733797339.1925662
}