{
  "url": "http://www.library.northwestern.edu/research/scholarly/open-access.html",
  "title": "Open Access : Libraries - Northwestern University",
  "content": "Open Access (OA) is a publishing model that makes scholarly publishing available online to readers for free, allowing for the full text to be read, downloaded or shared online without financial, legal, or technical barriers. Journal articles can be published open access by publishing in an open access journal, by publishing an article open access in a subscription journal, or by archiving your publications in an open access repository. Open access publishing can increase the reach and impact of research by making it available immediately, for free, to a wide audience. Open access leads to a broader circulation of the work, and opportunities for broader collaboration and innovation through sharing research. Northwestern Libraries supports an Open Access publishing model that is equitable and sustainable. The Libraries do this by using resources and memberships in academic alliances like the Big Ten Academic Alliance to support OA initiatives and projects like Knowledge Unlatched and SCOAP3. To this end, the Libraries entered into several collective agreements with publishers to encourage and promote Northwestern-affiliated researchers who want to publish their work Open Access. These agreements will waive Article Processing Charges (APCs) to create a path to open access. To learn more, reach out to library@northwestern.edu. See below for a list of journals with waived APCs. Northwestern Libraries has specific agreements with the following journals allowing Northwestern authors to publish open access research without having to pay Article Processing Charges. Association for Computing Machinery (ACM) Cambridge University Press journals Chinese physics C Cogitatio Press Company of Biologists European physical journal IOP ScienceXtra Microbiology Society Nuclear physics Physical Review C Physical Review D Physical Review Letters Royal Society of Chemistry (all hybrid and gold open access portfolio) Wiley (full journal portfolio, including Hindawi’s gold open access portfolio)",
  "timestamp": 1733797235.6730573
}