{
  "url": "http://www.library.northwestern.edu/about/news/library-news/2024/deering-library-to-be-renovated-beginning-june-2024.html",
  "title": "Deering Library to be renovated beginning June 2024: Libraries - Northwestern University",
  "content": "This investment is about creating a space where campus and community can come together to share ideas and work together across disciplines.” Xuemao WangDean of Libraries Deering Library, which has enchanted students, scholars, and visitors for more than 90 years, is slated for a major renovation that will markedly improve the facility while preserving its history. After years of planning, the renovation will begin in June, following commencement. The work will include the renovation of select prominent public spaces and upgrades to attendant infrastructure. There will be no public access to Deering Library during construction, which is expected to conclude in September 2025. “This renovation underscores Northwestern Libraries’ commitment to research and collaboration,” said Xuemao Wang, Dean of Libraries and Charles Deering McCormick University Librarian. “This investment is about creating a space where campus and community can come together to share ideas and work together across disciplines.” The Deering Library renovation is being funded entirely by philanthropic gifts. The project will focus on the renovation and restoration of the Eloise W. Martin Reading Room, the third-floor lobby, and room 208. These spaces will see restored woodwork, furnishings, and flooring, as well as retrofitted historic lighting, technology upgrades, and furniture. The work in the Martin Reading Room will include the removal of all non-original, free-standing bookshelves, creating space for more seating. Room 208 will be re-worked to serve as both a reading room and an event space, providing the Libraries and campus with another much-needed gathering space. The project will also improve accessibility in the building by adding a new elevator and renovating restrooms. During construction, the Libraries will take all available measures to make library collections and services readily available. Although there will be no public access to Deering Library for the duration of the work, library staff will be able to retrieve requested books and research materials. Circulating materials from the Art and Asian Languages collections will be available by request via the NUsearch library for pick-up at the University Library circulation desk or delivery to faculty offices. Access to the holdings of the Charles Deering McCormick Library of Special Collections and University Archives will be made available in a temporary reading room in University Library. Additionally, the Libraries will provide more quiet study spaces in University Library to compensate for the closure of the Martin Reading Room, one of the most popular quiet study spaces on campus. Responses to frequently asked questions and updates about the project will be posted on an ongoing basis at libraries.nu/deering.",
  "timestamp": 1733797962.6095486
}