{
  "url": "http://www.library.northwestern.edu/libraries-collections/music/find-use/access-rare-materials.html",
  "title": "Access to Rare Materials: Libraries - Northwestern University",
  "content": "Music manuscripts, correspondence, archival collections and rare editions of books and printed music are available to Northwestern students, faculty, and visiting researchers for on-site examination. All patrons should make an appointment to examine special-collections materials; patrons without an appointment will receive service based on the availability of the staff. Appointment requests should be submitted well in advance of the proposed appointment date. Out-of-town visitors should confirm appointments before making travel plans. Contact us at 847-491-3434 or via email at musiclibrary@northwestern.edu to schedule an appointment. While access is generally provided to processed materials, such as those cataloged in NUsearch or in finding aids, unprocessed manuscripts and collections are accessible only under special circumstances. Prior to examining materials, patrons must submit a personal identification card (e.g., Northwestern University WildCard, drivers license), which will be held at the Music Library desk until after research materials have been returned complete and undamaged. Materials are accessible one item, folder, or box at a time. Patrons who handle materials carelessly or fail to comply with any of the above guidelines may be denied further access. Permission to consult materials does not convey the right to reproduce or publish. Patrons are permitted to quote, cite, or refer to materials in accordance with United States copyright law, but extensive quotation, reproduction or publishing of materials is governed by copyright law, donor agreements and the Northwestern University Library's policy on Rights, Permissions, and Reproductions. If reproductions of rare materials is needed, contact a Music Library staff member, or complete the request form on the Reproductions for our Collections page. The following fees apply: All inquiries regarding access to or reproduction of rare materials should be directed to the Head of the Music Library.",
  "timestamp": 1733797942.3639576
}