{
  "url": "https://www.library.northwestern.edu/find-borrow-request/borrowing-materials/index.html",
  "title": "Borrowing Materials: Libraries - Northwestern University",
  "content": "The Circulation desk can answer questions about borrowing. Call 847-491-7658 or email circulation@northwestern.edu Visit our FAQ page for additional information. Most members of the Northwestern community can borrow materials using their Wildcard. Other patrons can obtain a Borrower's Card to check out books. Borrowing privileges, such as loan periods and items limits, vary slightly by patron type. Learn about borrowing policies & procedures. If an item isn't returned or renewed when it is due, it will be overdue and may incur a fine. You could also be charged for lost and damaged items. See how we handle overdue, lost or damaged items. Materials can be requested through NUsearch and either picked up from University (Main) Library or delivered to your address. If you need scans or reproductions of materials, please see Reproduce Materials. Northwestern University Libraries offers book pickup for faculty, staff and students. You’ll receive an email when your item is ready. Pickup will be at the Main Circulation Desk in University (Main) Library, 1970 Campus Drive. Northwestern Libraries provides faculty, graduate, and distance education students off-campus delivery of Northwestern-owned materials and Interlibrary Loan books. The libraries will ship items out weekly via UPS. Multiple item requests may be packed and shipped separately based on when they are processed. We will ship all circulating collections, including interlibrary loans, CDs, and DVDs. Provide a full street address and zip code in the Notes field. Requests with incomplete addresses will be held. You will receive a confirmation email. You can renew items through your Your Account online, using either your NetID (for Northwestern faculty, staff and students) or assigned user name and password (for borrowers using a Borrower's Card). After logging in, scroll down to the section titled Items Checked Out, where you will see a list of the items currently checked out to you, along with their due dates. Simply click the checkboxes next to the items you would like to renew, then click Renew Items. Northwestern students, faculty and staff can check out a variety of equipment from the University Library, including laptops, chargers and iPads. Checkout time varies by item and can be found on Equipment for Checkout. For a complete list of equipment visit the Circulating Equipment Guide.",
  "timestamp": 1733796299.059988
}