{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2024/the-block-museum-and-nu-libraries-partner-to-improve-research-access-to-northwesterns-art-collection.html",
  "title": "The Block Museum and NU Libraries partner to improve research access to Northwesternâs art collection: Libraries - Northwestern University",
  "content": "This collaboration between The Block and the Libraries to improve the research experience highlights Northwestern's strengths as a research institution, allowing for the incredible breadth of holdings across our Evanston campus to be available for scholarly discovery.” Kathleen HagertyProvost Northwestern students and faculty now have one more research tool available at their fingertips. The Block Museum of Art and Northwestern University Libraries are pleased to announce the completion of a strategic project to integrate the museum’s collection records into the Libraries’ search database. The Block Museum of Art’s collection of over 6,000 artworks is now searchable through Northwestern Libraries’ online catalog via NUSearch. “We are deeply grateful to the Northwestern Libraries for their partnership on this project, which is just the start of the way that are thinking together about access and integration across Northwestern’s collections. We have long thought of The Block collection as a valuable resource for scholarly insight, research, and knowledge creation across disciplines. Inclusion of our records within NUSearch underscores the role that art can play side by side with other forms of research to enhance the University’s excellence in teaching and learning,” says Lisa Graziose Corrin, The Block’s Ellen Philips Katz Executive Director. The Block and the Libraries database alignment launched in early January 2024. Now, when users search for an artist’s name or relevant keyword, records of works of art at The Block will appear alongside library resources such as books, articles, and other digital holdings. NUSearch results will link users to The Block’s database, where artwork images can be viewed, and appointments can be made for in-person research visits. Library users can also limit their results to The Block’s holdings by selecting “Artworks” as the information format. The groundwork for this initiative began with the migration of The Block’s records to a collections management system and public-facing website, launched in fall 2020. The website, hosted by Gallery Systems, allows the museum to make data about its collection publicly accessible. Thanks to the work of developers at the Libraries, the library’s search and discovery platform imports information from The Block’s digital records via the Open Archives Initiative Protocol for Metadata Harvesting (OAI-PMH). \"Integrating The Block's collection into the Libraries database expands access for researchers on campus and around the world. NU Libraries is proud and grateful to be a part of this campus collaboration and hope to expand our offerings in the future to streamline interdisciplinary research and create opportunities for encountering a variety of sources during research,” says Xuemao Wang, Dean of Libraries. Improving access to records for artworks at The Block Museum underscores the museum's collection as an asset for teaching and research. The new search integration is currently most useful for students, faculty, and researchers seeking holdings related to a specific artist or artwork title. As the partnership continues, The Block and the Libraries will seek to grow their understanding of how collection records are incorporated into results and to consider new ways to enrich metadata for The Block’s records. “This collaboration between The Block and the Libraries to improve the research experience highlights Northwestern's strengths as a research institution, allowing for the incredible breadth of holdings across our Evanston campus to be available for scholarly discovery,” says Provost Kathleen Hagerty.",
  "timestamp": 1733796825.4979851
}