{
  "url": "https://www.library.northwestern.edu/find-borrow-request/course-reserves/index.html",
  "title": "Course Materials: Libraries - Northwestern University",
  "content": "The Libraries provide a variety of ways to connect faculty and students with course materials, including course reserves, ebooks, streaming media, interlibrary loan, and open educational resources (OER). Ebooks that allow for multiple simultaneous users may be available for the library to purchase for full class access. Use NUsearch to search for titles that are already available via the catalog. If you’d like to place a request for an ebook we do not currently have in the catalog complete the Purchase Suggestion Form. Please note that while we will do our best to purchase all requested ebooks, many commercial textbook publishers do not allow libraries to purchase multi-user license access to their titles. These publishers include: Pearson, Cengage, McGraw-Hill, Houghton, and Oxford University Press (textbook division). Instructors have the option to place required and/or recommended materials on reserve for class use. Physical items, such as books and DVDs, can be checked out from the circulation desks at University Library and Mudd Library on a shortened loan period. Loan periods can be set at 2 hours, 4 hours, or 1 day. Digitized items, such as scanned book chapters, journal articles and streamed audio and video, can be accessed through Canvas. To see if your class has materials on reserve, use the dropdown menu in NUsearch to choose Course Reserves and then search by course name, instructor name, or department. If you are an instructor interested in placing items on reserve, visit Reserve Information for Faculty to see instructions and further information. If we don’t have a book in our collection, interlibrary loan (ILL) is a good option for finding and borrowing assigned course materials. Typical loan periods are 12 weeks. Please note that ILL cannot obtain the most recent edition of most textbooks. Students should always check with their instructor before relying on an earlier edition of an assigned textbook. Search libraries worldwide Request item directly using ILL form Open educational resources (OER) are educational materials that have been released under an open license that allows for no-cost use, adaptation, and sharing. The Libraries provide OER support to faculty and instructors who are interested in finding or creating OER for their courses. Faculty and instructors can contact library@northwestern.edu to set up a consultation or visit the main OER website to learn more. The ‘Cats 4 ‘Cats Lending Library is a “take-a-book leave-a-book” collection where students donate their textbooks and other course materials for other students to use in future quarters for free. Any student can take materials they need for class, use it for the term and return it at the end of the quarter. The collection can be found in Core, on Level 2 of University Library. Donation boxes are located year round in Mudd Library and the circulation desk in University Library. The collection is updated regularly, but may not be fully current. View the collection For more information, visit the ASG website. Questions? Contact asg-academic@u.northwestern.edu",
  "timestamp": 1733796296.788336
}