{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2024/matthew-richardson-appointed-university-archivist.html",
  "title": "Matthew Richardson appointed University Archivist : Libraries - Northwestern University",
  "content": "Matthew Richardson '06, '12 has been appointed the University Archivist for the Charles Deering McCormick Library of Special Collections and University Archives beginning August 19, 2024. Richardson’s appointment is a homecoming, as he graduated from the Weinberg College of Arts and Sciences with majors in History and English, completed his M.A. in Liberal Studies through the School of Continuing (Professional) Studies, and began his early library career in the Preservation Department at Northwestern Libraries. Along with earning a B.A. and M.A. from Northwestern, Richardson received an MS-LS with a concentration in Archival Management from the University of North Texas. Richardson’s most recent position was with the Texas Medical Center Library’s McGovern Historical Center, where he served as Archivist and Special Collections Librarian for three years. As University Archivist, Richardson will act as a steward and curator of the University Archives in the McCormick Library, a robust collection of materials pertaining to Northwestern and Evanston history, including everything from faculty papers and University bulletins to alumni memorabilia and student group flyers. Richardson will serve as a bridge between the greater Northwestern community and the rich archival record of Northwestern history, as well as work with scholars and researchers from across the world. “It’s an honor to return to Northwestern in this unique and exciting role,” says Richardson. “In addition to getting to know and further developing our historical collections, I’m particularly looking forward to engaging with and learning from the amazing students, faculty, researchers, alumni, and others that make up the Northwestern community.”",
  "timestamp": 1733796818.989301
}