{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2022/2022-spring-library-services.html",
  "title": "2022 Spring Library Services: Libraries - Northwestern University",
  "content": "The beginning of spring quarter is here! After two years of changes and adjustments, we'd like to clarify and summarize some of our current services, both in-person and remote. Beginning Tuesday, March 29, masking is now optional in all library spaces. Masking is still recommended when distancing is not possible. Free masks are available at the entrance to all libraries. You are no longer required to show proof of vaccination or symptom trackers at the entrance desks. For the latest updates on Northwestern University's COVID-19 safety measures, see COVID-19 and Campus Updates. Reservable study spaces are available for individual and group study in both University Library and Mudd Library. To see available spaces and make an appointment, see Reservable Spaces. Reserve study space A research study carrel is a desk in the library that may be assigned to graduate students, faculty, or undergraduates working on a senior honors thesis. If you have a carrel assignment, you can store library books there for an extended period, unless they are recalled for Course Reserve. New applications are temporarily on hiatus during the first two weeks of the academic quarter and are not currently being taken. Applications will be accepted starting 26 September 2022. For access to materials from Charles Deering McCormick Library of Special Collections and University Archives, please see Plan A Visit to set up an appointment. For those who cannot safely travel to the library to view materials, you may email specialcollections@northwestern.edu to request a remote reference session via Zoom. You will be able to view materials virtually through our document camera, assisted by a staff member. Mudd Library offers mediated 3D printing and 3D scanning services to current Northwestern University students, faculty, and staff. A consultation with library staff is required before using the Maker Lab. You may also submit a 3D printing project request for library staff to print.  Visit the Maker Lab Consultation Request to request an appointment. Request a Maker Lab consultation The Video Production Studio features a Lightboard and Self-Service Video Studio. It is available for individual faculty and student appointments by reservation Monday through Friday. Visit the VPS Reservation Calendar to make a reservation. reserve the video production studio You can request library spaces for special events or meetings with the Library Event Space Request Form. A staff member will review the request and respond to confirm. REQUEST LIBRARY EVENT SPACE Books and other circulating materials can still be either picked up from the Libraries in-person or delivered to an office or home. To see how to request delivery, visit Borrowing Materials. Workshops have both online and in-person options for the foreseeable future. View available workshops and sign up with the Event Calendar. Upcoming workshop topics include literature review, nonlinear research, EndNote and Zotero. Receive specialized, one-on-one research help from a subject specialist by completing our online Research Consultation Appointment Request form or emailing library@northwestern.edu. REQUEST RESEARCH CONSULTATION Visit Teach with the Libraries to learn about course-related instructional services and contact your subject librarian to discuss your specific instructional needs. Subject librarians are available to help faculty with course modifications to accommodate remote and hybrid instruction. Librarians are also available for specialized instruction on subjects including citation management, subject-specific tools and collections, digital publishing tools and digital collections. Request instruction by reaching out to a Subject Librarian directly or by filling out the Faculty Request for Course-Related Instruction form. Faculty Request for Course-Related Instruction. The Libraries continue to offer an array of services that connect scholars with the right resources. For further help identifying your research solutions, please contact us through any of the following channels: Email us at library@northwestern.edu Call us at 847-491-7658 during our hours of operation. Text us at 847-868-9059 during our hours of operation. Live chat with a librarian Monday – Friday from 8:00 am to 6:00 pm: Ask Us Drop in to the University Library's information desk located in the Information Commons.",
  "timestamp": 1733797132.0769722
}