{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2024/transformative-agreement-with-association-for-computing-machinery-increases-support-for-open-access-publishing.html",
  "title": "Transformative agreement with Association for Computing Machinery increases support for open access publishing: Libraries - Northwestern University",
  "content": "Northwestern Libraries are pleased to announce that Northwestern has entered another major transformative open access agreement with Association for Computing Machinery (ACM), effective January 1, 2024. The agreement covers a three-year term, until 2027. ACM has stated its intention to publish all ACM journals, magazines, and conference proceedings open access by 2026. Under the terms of the agreement, Northwestern readers can access all ACM publications including journals, magazines, books, conference proceedings, and special interest group newsletters, and Northwestern corresponding authors will have their works published with open access licenses at no cost to the author. In addition, Northwestern authors retain rights to their work when they publish open access, and articles will be available immediately to the public, increasing reach and impact. This agreement, in addition to the landmark open publishing agreement with Wiley announced last year, enhances the ongoing effort to support a sustainable ecosystem of open access publishing, giving Northwestern researchers more opportunities to share their work widely. “This new agreement provides great benefits not only to Northwestern faculty and researchers, but also to the greater computing and information technology communities,” says Anna Ren, Engineering Research & Collection Analysis Librarian. In the past two years, Northwestern authors published 183 research articles and 9 short papers in various ACM publications. For questions about the ACM agreement, please contact John Blosser, department head for Acquisitions at the Libraries at jblosser@northwestern.edu.",
  "timestamp": 1733796827.654822
}