{
  "url": "https://www.library.northwestern.edu/visit/classrooms/special-event-policies-and-procedures.html",
  "title": "Special Event Policies and Procedures: Libraries - Northwestern University",
  "content": "The Northwestern University Libraries special event space policies are designed to ensure library users have a variety of safe and welcoming spaces for research, learning, creativity, discovery and collaboration. All University buildings are private property. The following policies apply to all reservable event spaces in the Libraries. All library staff are authorized to enforce this policy, with the assistance of Northwestern University Police if necessary. Priority for library spaces is given to events and programs that further the Libraries mission of supporting teaching, learning, and research. Academic and student events and programs will be given preference, based on available space and staff. Spaces in the Libraries are generally not made available to groups without a University affiliation except for events co-sponsored by the Libraries, or with special permission by the University Librarian or Deputy University Librarian. Other available special event spaces on campus can be found at Norris University Center, the Guild Lounge and the Great Room. Spaces must be reserved in advance at least five business days and no more than 12 weeks using the Libraries event space request form. Staff will attempt to accommodate your request but may also reach out to offer alternatives. Available spaces: Certain spaces may have different scheduling guidelines. It is recommended that sponsors include in the reservation form a 30-minute time period before a scheduled event begins, to prepare and check for layout and technology set-up, and an additional 30 minutes after the event concludes, to allow for clean up of space and catering. Sponsors are responsible for providing a chart string in case of damage to the space (broken furniture, stains, etc.) and are responsible for repairs, replacement, and/or cleaning as a result of their event. Sponsors are responsible for set up and clean up of space. All service items, equipment, and food must be removed, waste collected, and areas cleaned by the sponsor of the event. Sponsors must remove any event-related signage immediately after their event. Sponsors of events are responsible for keeping Library spaces in good condition. Any additional furniture (i.e. catering tables and chairs) requires prior approval by library staff before being brought into space. Technology in some spaces is limited. Please visit the space in advance to have a full understanding of what is available. The Libraries are not able to serve as tech support for an event. The Library does not provide storage for equipment, furniture, etc. Beyond the default room set up, the Library staff is not able to provide any service for events, i.e., moving furniture, equipment set up and use instruction, delivery or preparation of refreshments, or cleaning up after an event. Library is not responsible for lost or stolen items. All catering and equipment deliveries for University Library must be made through the Main Library loading dock between the hours of 8:30am-4:30pm Monday-Friday. Deliveries outside of these hours or for other libraries require special approval and arrangement in advance with Libraries staff. Parking at the loading dock is not available. Note: Access to Campus Drive is currently limited due to construction. Please access the loading dock by entering campus from the south near the Segal Visitors Center. View this route on a map. Sponsors must meet all deliveries, especially catering deliveries, at the Main Library loading dock, and escort them to their reserved room or space. Care must be taken when bringing food through the Library. All liquids must have secured covers. No food using open‐flame heating of any kind is allowed (i.e. sterno-heated chafing dishes). Sponsors are responsible for providing all food and beverages, table service, and utensils needed for event. The Library does not provide storage for catering, etc. Library is not responsible for lost or stolen items. At the conclusion of their event, sponsors are responsible for arranging for all food and drink waste to be removed from the event space and discarded at the Main Library loading dock. Garbage and refuse cannot be left in any library spaces overnight. Sponsors serving alcoholic beverages are responsible for complying with all state, local, and University regulations. Sponsors are responsible for using space in accordance with Library and University policies and practices. Individual spaces may have additional policies. Adhere to individual room policies where applicable, including room's maximum capacity requirements. Northwestern University Libraries reserves the right to decline or cancel any event at any time. Use of the room indicates acceptance of these policies.",
  "timestamp": 1733796397.4593248
}