{
  "url": "http://www.library.northwestern.edu/about/administration/policies/rights-permissions.html",
  "title": "Rights, Permissions and Reproductions Policies: Libraries - Northwestern University",
  "content": "These webpages provide helpful information about fair use and copyright law. Northwestern University Libraries provide access to its holdings for educational, personal and non-commercial use, provided that ownership of the materials is properly cited. Written permission of the copyright holders and/or other rights holders is required for publication, distribution, reproduction or other use of protected items beyond that allowed by fair use . Publication includes, but is not limited to, print, film, slide presentation, video, television and electronic transmission. Transmitting an image or file on the Internet is equivalent to reproducing and distributing that image in print. Materials held by Northwestern University Libraries may be protected by U.S. Copyright Law and/or by the copyright laws of other countries. Copyright law protects unpublished as well as published materials. For web sites and digital files originated in the libraries we retain all rights, including copyright, in all data, images and text. If you wish to use either published or unpublished materials from our collections in a publication, you must determine whether the work has passed into the public domain and is no longer under copyright protection, or find the copyright holder and get permission to reproduce the material. Users of materials held by the Northwestern University Libraries are responsible for securing permission from copyright owners and payment of such additional fees as the owners may require if the Libraries do not hold copyright or if the material is not in the public domain. Users assume all responsibility for questions of copyright or other rights that may arise in copying and in the use made of the copy. Other than use for personal, educational or non-commercial purposes, each collection or type of material in the Northwestern University Libraries may have different copyright or other reproduction restrictions placed on it. If you would like to use or reproduce materials from our collections, please contact us, specifying what materials you are interested in, and we will tell you of any restrictions on a case-by-case basis. The requester must contact appropriate departments (see contact list below). Permission is granted to the requesting party for one-time use only, for the purposes stipulated in the request. Requests to publish must indicate the specific use intended. The requester is responsible for obtaining any required permission from the creator of the work or from the creator's heirs or executors. Reproductions may not be reused for any other purpose, or published in any other format (including but not limited to: print, film, slide presentation, video, television and electronic transmission); nor may it be transferred to another party without permission from Northwestern University Libraries. The user assumes all responsibility for infringement of copyright or other rights and agrees that Northwestern University Libraries are free from liability for any infringement of use by the requester. Northwestern University Libraries reserve the right to refuse permission and reproductions to anyone who does not agree to these conditions. Please see the relevant department's web pages for contact information, holdings, fees, request forms, conditions for use and citation and credit formats. The standard credit line for materials from the Northwestern University Libraries is as follows: \"Courtesy Northwestern University Libraries \". For preferred citation, see the \"Policies\" section on Rare Materials Reproduction page. Information regarding the cost of reproductions in various formats can be found on the website of the individual departments. Contact appropriate departments and inquire them for any other specific information about reproduction formats, terms, or fees. For general information, contact Copyright Librarian Liz Hamilton at emhamilton@northwestern.edu.  Last Review: October 2023",
  "timestamp": 1733797599.9594853
}