{
  "url": "http://www.library.northwestern.edu/about/news/library-news/2024/10-years-after-james-foleys-death-art-exhibition-honors-his-commitment-to-conflict-journalism.html",
  "title": "10 years after James Foleyâs death, art exhibition honors his commitment to conflict journalism : Libraries - Northwestern University",
  "content": "The title Inescapable Truths is a reference to the undeniability of human suffering and the essential role of journalism to reliably communicate these stories.” Bradley McCallumArtist and exhibit curator An exhibition of original art dedicated to the memory of American journalist James Foley opens April 3 at Northwestern University. In Inescapable Truths: James Foley’s Indelible Legacy, conceptual artist Bradley McCallum draws from Foley’s video, photos, and writings he filed while reporting on the Libyan and Syrian civil wars of 2011. The exhibition is presented in two parts: at University Library and Dittmar Gallery in Norris University Center. It runs in conjunction with an upcoming symposium about conflict journalism hosted by the Medill School of Journalism, Media, Integrated Marketing Communications, marking the tenth year since Foley’s videotaped execution in Syria shocked the world. For 21 of the artworks on view, visitors can use their own digital devices to activate augmented reality video of Foley’s raw footage, experiencing these conflicts through his eyes. Glimpses of armed rebellion viewed through the paintings are interspersed with two video portraits of Foley’s mother, Diane, in dialogue with Northwestern students, about her cause for hope, her faith, and her advocacy for freelance journalists and the safe return of American hostages held abroad. Inescapable Truths is the culmination of McCallum’s eight-year collaboration with the James W. Foley Legacy Foundation, founded by Diane Foley. This work was followed by McCallum’s 2023 fellowship with the Northwestern Universty Knight Lab, a Medill studio that encourages the use of emerging technology to push the capabilities of journalism. In fall quarter, McCallum and graduate student Craig Stevens led a Knight Lab course for six Medill undergraduate and graduate students that prototyped the AR concepts and envisioned the exhibition installation. “This exhibition is especially timely, as the wars in Ukraine and Gaza continue to unfold and we are reminded of the essential role that journalists serve in reporting on conflicts,” McCallum said. “The title Inescapable Truths is a reference to the undeniability of human suffering and the essential role of journalism to reliably communicate these stories.” Inescapable Truths is presented by the Medill School of Journalism, Media, Integrated Marketing Communications, the Northwestern University Knight Lab, and Northwestern University Libraries, in partnership with the James W. Foley Legacy Foundation and Conjunction Arts. Augmented reality design and production provided by Tactic Studios, powered by 8th Wall. Special funding provided by Lisa and Steve Knight. For more information about events, locations, and other visitor resources, click here. University Library, fourth floor On view through June 14 9 a.m. – 6 p.m., Monday – Saturday Dittmar Gallery, Norris University Center On view through May 7 10 a.m. – 10 p.m., every day Opening reception at 4:30 p.m. University Library, fourth floor, followed by a viewing in Dittmar. The event will feature a talk by McCallum and a reading of poetry by Foley’s friend Daniel Brock Johnson, author of Shadow Act: An Elegy for Journalist James Foley. The opening remarks will be followed by a conversation at Dittmar between McCallum and Johnson. These receptions are open to the public. A reception and book signing with Diane Foley at Dittmar Gallery at 6 p.m. She and McCallum will discuss the development of Inescapable Truths and her recently published book, American Mother, about the confronting of her son’s killer and “the elemental heart of violence and forgiveness.” A book signing will follow. Presentation for the 2023 James Foley-Medill Award for Courage in Journalism, an annual award re-named for Foley in 2014. This year's honorees, New York Times reporter Julie Turkewitz and photojournalist Federico Ríos, will discuss their reporting on the exploitation of migrants crossing from Columbia to Panama through the hazardous Darién Gap. The ceremony will take place at 5:30 p.m. at Scott Hall, 601 University Place, Evanston, and is open to the public. Daylong seminar, “Reporting in a Dangerous World,” hosted by Medill at the McCormick Foundation Center, 1870 Campus Drive, Evanston. Discussions with professional journalists about managing safety will include a dialogue between McCallum and Medill Dean Charles Whitaker. Register here.",
  "timestamp": 1733797964.859492
}