{
  "url": "http://www.library.northwestern.edu/visit/visitor-privileges/reciprocal-university/northwestern-borrowers.html",
  "title": "Northwestern Borrowers: Libraries - Northwestern University",
  "content": "Northwestern University faculty, staff and current students are eligible to receive borrowing privileges at all libraries on the University of Chicago, Loyola University and University of Illinois at Chicago (UIC) campuses, as well as through the Big Ten Academic Alliance. Use the tabs below to learn about privilege details and how to obtain a borrower's card at each institution. Eligibility: The Loyola Libraries' contact information, operating hours and catalog can be found online. Visit the Loyola University Libraries website. For borrowing privileges, bring your WildCARD to the circulation desk at Loyola's Cudahy Library during weekday operating hours. You will be asked to fill out paperwork and staff will call the NU Library Privileges Office to verify your status. A card will be issued on the spot. Borrowing is valid for a maximum of one year, with an expiration date of May 31st. Cards may be renewed annually upon verification of current Northwestern status. Contact Loyola University Circulation Desk at 773-508-2632. The University of Chicago Library's contact information, operating hours and catalog can be found online. Visit the University of Chicago Library website. Bring your WildCARD to the ID and Privileges office at the University of Chicago's Regenstein Library. You will be asked to fill out paperwork and staff will call Northwestern Libraries to verify your status. Borrowing is valid for a maximum of one year, with an expiration date of October 31st. Cards may be renewed annually upon verification of current Northwestern status and as long as your library accounts at both institutions are in good standing. Contact the University of Chicago ID and Privileges Office at 773-702-8782 or 773-702-3344. The UIC's Richard J. Daley Library's contact information, operating hours and catalog can be found online. Visit the UIC Library website. For borrowing privileges, bring your WildCARD to the circulation desk at the Daley Library at UIC. You will be asked to fill out paperwork and staff will call the NU Library Privileges Office to verify your status. The NU WildCARD itself will act as the UIC library borrowing card. Borrowing is valid for a maximum of one year, with an expiration date of May 31st. Cards may be renewed annually upon verification of current Northwestern status. Contact the UIC circulation desk at 312-996-2724. The Big Ten Academic Alliance (BTAA) allows for reciprocal on-site borrowing to current faculty, emeritus faculty, students and staff at participating BTAA institutions . View the list of member institutions. Loan periods and fines, fees, and penalties vary by institution. For additional details, see the BTAA Reciprocal Borrowing Agreement, or contact the participating BTAA institution from which you would like to borrow directly. The OCLC Reciprocal Faculty Borrowing Program allows faculty to access and borrow materials from participating institutions directly. If you plan to visit a participating institution and would like additional information about obtaining a borrower's card, email the circulation desk for more information, or call us: 847-491-7617.",
  "timestamp": 1733797881.8640037
}