{
  "url": "https://www.library.northwestern.edu/find-borrow-request/reproduce-materials/collections-reproductions.html",
  "title": "Rare Materials Reproduction: Libraries - Northwestern University",
  "content": "Northwestern University Libraries maintain and provide access to extensive research collections, including rare and unique materials that may be reproduced upon request according to the following procedures. On this page, you'll find procedures for reproducing non-circulating items from the following collections: Many materials can be reproduced on request. At no charge, library staff can scan up to 50 pages or spend up to 30 minutes' scan time (whichever comes first) of paper-based materials per research request. Anything beyond that amount or audio-visual format is addressed on a case-by-case basis. Turnaround time will vary based on available resources. Patrons can contact library staff from the collections listed above if they are interested in reproductions of audio-visual or born-digital materials.Staff reserves the right to limit the number of scans based on physical condition of material or available staff resources. See the policies tab for information on copyright restrictions.To browse materials that have already been digitized, visit Digital Collections. For materials held in the held in the McCormick Library of Special Collections and University Archives, including Music Rare materials, please submit your request using the online request form. If you don’t already have an account with us, you will be asked to create one first. Once you do so and log in, you can click the link to access the form. For materials from Melville J. Herskovits Library of African Studies, the Art Library, the Music circulating collection, and the Transportation Library, please fill out the Rare Materials Reproduction Request Form here.  General policies are listed below. Additional information regarding the cost of reproductions, turnaround times, and specific procedures is available from each specific Collection. See more on copyright and fair use on Rights, Permissions and Reproductions Policies. Collection curators must approve requests from researchers who wish to bring digital cameras or other photographic equipment into the library. Researchers performing their own digitization will be required to sign a Researchers Copyright Agreement form. The Northwestern University Library provides access to its holdings for educational, personal, and non-commercial use. Materials held by Northwestern University Library may be protected by United States Copyright Law and/or by the copyright laws of other countries. Copyright law protects unpublished as well as published materials. At its discretion, the Library may make limited copies of materials that are still within their term of copyright, provided the copies become the property of the user and no further use or distribution is made without permission from the copyright holder. Written permission from the copyright holders and/or other rights holders is required for publication, distribution, reproduction or other use of protected items beyond that allowed by fair use. Publication includes, but is not limited to, print, film, slide presentation, video, television, and electronic transmission, including transmission via posting on a web site. To use either published or unpublished materials from our collections in a publication, requesters must determine whether the work has passed into the public domain and is no longer under copyright protection, or find the copyright holder and obtain permission to reproduce the material. The Library will neither facilitate nor execute these requests, nor will it provide publication permission for materials whose term of copyright has expired. Users of materials held by the Northwestern University Library are responsible for securing permission from copyright owners and payment of such additional fees as the owners may require. Users assume all responsibility for questions of copyright or other rights that may arise in copying and in the use made of the copy. The user assumes all responsibility for infringement of copyright or other rights and agrees that Northwestern University Library is free from liability for any infringement of use by the requester. Northwestern University Library reserves the right to refuse permission and reproductions to anyone who does not agree to these conditions. Cite the appropriate individual library department as follows:",
  "timestamp": 1733796325.309224
}