{
  "url": "http://www.library.northwestern.edu/visit/classrooms/book-nook.html",
  "title": "Book Nook: Libraries - Northwestern University",
  "content": "Located on the Level 1 of University Library, the Book Nook can be reserved for workshops, presentations, talks and other formal social programs by Northwestern University departments, programs, and student organizations. See below for special regulations on the use of the space.  The Nook is open to the library entrance hallway and ideal for open invitation events. The entry provides a mild sound barrier between the room and the hallway. It can be set up for ~30 people in an auditorium set up or ~ 20 in a circle. Tables can be provided as needed. The room is also equipped for displays and exhibits. For more information on reserving the space for a display, please contact Chris Davidson. Accessible automatic doors are located at the north and south sides of the University Library entrance. Both entrances feature an elevator. The Book Nook is on the same floor as the entrance. The space can be fitted with a screen and a podium with microphone upon request. The Libraries do not provide additional AV support for equipment set-up and operation. Please arrive early to give yourself enough time to troubleshoot, should issues arise. The space is not equipped for hybrid programs. Under University Policy, The Book Nook cannot be used for political events involving fund-raising or planning or participating in a political campaign. The space may not be used for events requiring a charge or entry fee. Program sponsors are responsible for the appropriate use of the space and for the good condition of the room following the event. The Book Nook has a capacity of 40 people. The library does not have any limitations or requirements on catering providers. Deliveries of refreshments and equipment may be made to the Loading Dock of University Library between 8:30 am and 4 pm, Monday through Friday only. Items must be moved from the Receiving Room/Loading Dock to the Book Nook during these same hours. The latest that caterers can exit the dock is 4:30pm, when the dock closes. Libraries staff are not able to provide any service for events, AV support, delivery or preparation of refreshments, or cleaning up after an event. Basic room setups can be requested by choosing from options available on the room request form.",
  "timestamp": 1733797894.1707358
}