{
  "url": "https://www.library.northwestern.edu/about/administration/departments/preservation-conservation/education-outreach.html",
  "title": "Education & Outreach: Libraries - Northwestern University",
  "content": "The Preservation Department is involved in preservation education and outreach for library staff as well as faculty, students and other members of the University community. Staff members are actively involved in education initiatives, workshops, conferences, grants, and research. Northwestern University Libraries offers an advanced post-graduate conservation fellowship for a two-year appointment. The fellowship provides practical experience in a busy academic library conservation lab balancing treatment responsibilities with professional research activities. The fellow has the opportunity to gain bench experience, develop skills in treatment decision making, and participate in the management of a complex workflow. In addition, Northwestern's unique holdings allow the possibility to gain experience in assessing and evaluating a variety of library and museum objects, including paintings, ethnographic objects, textiles, and realia. Research topics will be developed in consultation with the fellow's supervisor at the beginning of the fellowship, and could include treatment techniques, materials identification, or historical studies. The fellowship also offers the unique opportunity to visit and interact with conservators at other Chicago-area conservation labs that work with a broad range of materials. Throughout the academic year, tours and lectures are offered to support classroom teaching in a variety of disciplines. In addition, workshops are aimed at providing practical information and hands-on training  for library staff and typically include training in disaster response, mold identification, and care and handling of fragile materials. Since 2010, an annual George and Marie Quinlan Endowed Lecture for Preservation and Conservation has brought nationally recognized conservators and scholars to Northwestern to share information about their current research.",
  "timestamp": 1733797180.8218417
}