{
  "url": "https://www.library.northwestern.edu/footnotes/issues/fall-2024",
  "title": "In this issue: Footnotes - Northwestern University",
  "content": "Detail of a Venetian gradual, circa 1500 Among many contributions to his alma mater, Will Evans’ most legacy-making impact may be the campaign to endow the role of curator of the Black experience, held by Charla Wilson, who joined the library in 2017. That foundational effort helped Evans earn the Deering Family Award, University Libraries’ highest recognition. In his remarks at last May’s annual ceremony, Evans called the recognition a true honor. “I have received several awards through the years, but this is a defining moment for me,” he said. “It means I have lived up to Northwestern’s values. I have a deep passion and appreciation for Northwestern, and it is very humbling to be honored here today.” Evans has been a longtime supporter of the University, but his philanthropic endeavors picked up speed in recent years, most recently underwriting the curator position to ensure its longevity for generations to come. His gifts to the Libraries have been constant, in the form of both outright and deferred gifts. Evans spent 40 years in the natural gas industry, starting as an engineering intern at Peoples Gas in 1974. “I would not have guessed that I would retire as president of the company,” he said. “I served under two different presidents who were also Northwestern alumni. They watched over my career just because I was a Wildcat—they helped transform my career.” Evans was president of the Northwestern University Black Alumni Association from 2018 to 2020, and he cochaired his 15th, 30th, 35th, 40th, and 45th reunion committees. His community service mindset has extended to several other board positions outside Northwestern, including chair of the Skokie Board of Fire and Police Commissioners and of Chicago Commons, a nonprofit that provides quality early childhood education, family-centered adult education, and senior services for underserved communities. “It’s truly amazing how one thing, no matter how big or small, can transform your life and make things better for you. For me that one thing may be Northwestern University,” Evans said. “I’d like to think that I have made a difference, that I have been a good leader and a positive role model for others, that I have lived up to those Northwestern values.” Photo by Yun Oldshue Despite being central to campus, Burgess Plaza at University Library has never been renowned as a congregating spot. That is, not until Libraries facilities manager James Abbott worked with Northwestern’s facilities department to develop the space with some friendlier furnishings that could bring community to the plaza. The furniture arrived in spring, and immediately students and staff could be found gathering at an array of Adirondack chairs and shaded tables, some sized to accommodate wheelchairs. “If you go to other universities, this type of outdoor furniture is almost automatic,” Abbott said. “This could be a start of something for the plaza.” See some historical photos of the plaza in this issue.",
  "timestamp": 1733796843.7092955
}