{
  "url": "https://www.library.northwestern.edu/research/scholarly/index.html",
  "title": "Scholarly Research Services: Libraries - Northwestern University",
  "content": "The Libraries provide guidance and support to faculty and students who are conducting and disseminating research. We have experts in the areas of copyright, digital humanities, data management, citation management, and digital publishing who are available to assist you with your project in any stage of the research process. Bibliographic information can be managed electronically through EndNote, Zotero or Mendeley. Northwestern licenses EndNote citation management software for all students, faculty and staff. Zotero and Mendeley are free bibliographic managers, and Zotero is open source. The Libraries provides workshops and online guides to using these tools. Find a workshop or guide We offer support to the Northwestern community on copyright and fair use in scholarly research, publishing, teaching and other areas. Liz Hamilton, Copyright Librarian, is available to answer questions regarding clearing permissions for publications, making public domain determinations, copyright registration, publication agreements, and more. She is also available to come to your class or group to present on copyright issues relating to a specific subject area or project. Contact us to get startedLearn more We offer consultation and collaboration services for humanities faculty and graduate students interested in digital forms of research, teaching and publication. Basia Kapolka, Digital Humanities Librarian, is available to answer your humanities research questions and to provide advice and guidance on pedagogy projects that involve digital methods and tools. Customized presentations to classes and groups are also available. In addition to our regular services, Northwestern faculty can apply to participate in an annual two-week digital pedagogy and research workshop. Visit the summer workshop website. Contact us to get startedLearn more We help researchers publish scholarship through open access platforms, such as Arch, Northwestern’s institutional repository for research, data, and non-traditional works of scholarship. In addition, we work with researchers to build independent sites created for editing and publishing journals, conference proceedings, and student projects. A librarian is available to meet with individuals, departments, and groups to answer questions and provide guidance on self-archiving research materials, publishing scholarly work, journal and data publishing, and other activities related to scholarly communication and publishing. Contact us to get started Learn more We offer support for both individuals and teams conducting evidence synthesis projects, such as literature reviews, systematic reviews, scoping reviews, and meta-analyses. Support levels range from consultation to in-depth collaboration, and include search strategy development, methods for collecting and organizing articles, software tools for searching and screening, protocol development, and full-text retrieval. CONTACT US TO GET STARTED LEARN MORE We assist researchers and students find, analyze, visualize and learn about data. We also help with data management and data management planning, including help with funding agency requirements, training on the DMPtool, drafting data management plans, and more. We offer free workshops and training opportunities throughout the year to help develop data skills, focused mainly on GIS and qualitative data analysis. We also can guide you through using specialized GIS and data software. Contact us to get started Learn more Open Access (OA) is a publishing model that makes scholarly publishing available online to readers for free, allowing for the full text to be read, downloaded or shared online without financial, legal, or technical barriers. Open access publishing can increase the reach and impact of research by making it available immediately, for free, to a wide audience. Open access leads to a broader circulation of the work, and opportunities for broader collaboration and innovation through sharing research. We support Open Access initiatives like collective agreements with publishers to encourage and promote Northwestern-affiliated researchers who want to publish their work Open Access. We are available to answer specific questions and to meet for consultations for scholars who would like their work or research data to be published open access. Contact us to get startedLearn More We are available to assist faculty and instructors to find quality OER in their subject areas, and can help you incorporate openly-licensed materials into your teaching with open pedagogy. We also provide full support to those interested in developing their own OER, including consultations, editorial workflow assistance, hosting, sharing, and maintaining persistent access and storage. Contact the library at library@northwestern.edu with your project ideas and questions. Customized presentations on open educational practices are also available to departments and groups. Contact us to get started Learn more Research data management encompasses all the practices researchers perform to care for their research data, including organizing, describing, preserving, and sharing. A collaborative partnership among Northwestern IT’s Research Computing and Data Services, Galter Health Sciences Library, University Libraries and Office for Research ensures support resources are available—from planning to publication and beyond. According to Northwestern University’s research data policy, the University as an institution and Northwestern researchers share the responsibility for managing research data. Receive support to write a data management plan, collect and store data securely, share and archive data, and more. Learn more",
  "timestamp": 1733796336.4095144
}