{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/about/index.html",
  "title": "About: Libraries - Northwestern University",
  "content": "The Charles Deering McCormick Library of Special Collections and University Archives houses the University's rare and archival materials. Collections are open to patrons at Northwestern, the public, and scholars from around the world. For general questions about our collections and services, contact us at specialcollections@northwestern.edu. Special collections include rare printed books from incunabula to contemporary artists books, medieval manuscripts, archival collections, broadsides, prints, photographs, artifacts, and ephemera. Special collections also hold important archival collections of literary and historical figures such as African American tragedian Ira Aldridge, Fluxus artists Dick Higgins and Charlotte Moorman, and Chicago Tribune publisher Robert R. McCormick. The Northwestern University Archives, established in 1935, houses records, publications, photographs, and other materials pertaining to every aspect of Northwestern’s history, including the papers of faculty, biographic information on Northwestern alumni, a complete run of Daily Northwestern issues, a complete set of catalogs and bulletins from each of the schools and more than 250,000 photographs. For a broader list of materials, browse the Archival and Manuscript collection portal. The McCormick Library builds its University Archives through donations. We seek materials from offices and departments, faculty papers, student groups and memorabilia of alumni and friends. To learn more about donating your materials to the McCormick Library of Special Collections and University Archives, visit our donation page or contact us by emailing specialcollections@northwestern.edu or calling 847-491-3354. For all other gifts, please see our page on supporting the Libraries. Music Library collections include rare books and published scores, including libretti and printed music as well as facsimiles of manuscripts of other primary sources. The original archival and manuscript collections represent multiple styles and eras, including the archives of experimental musician John Cage, collections of music collectors such as Hans Moldenhauer, musical autographs, and general music manuscripts and correspondence from the 14th century to the present. Northwestern performance recordings from 1995 are available to browse in NUsearch. Performances from 2006-2016 are available digitally in Digital Collections.",
  "timestamp": 1733796478.6760325
}