{
  "url": "http://www.library.northwestern.edu/about/library-jobs/faqs.html",
  "title": "Frequently Asked Questions: Libraries - Northwestern University",
  "content": "Questions about our hiring process? Review frequently asked questions from prospective librarians, staffers, student workers and temporary employees. To broaden the personnel decision-making process, NUL has adopted a consultative model of selection for librarian recruitments. The key element in the selection process is the search committee. It provides for a broad range of opinion and objective consideration of applicants' qualifications, as well as participation by interested constituencies within the Library and the Northwestern University community. Finalists recommended by the search committee are usually invited for an in-person interview, which provides candidates with the opportunity to meet and interact with a variety of library staff and gives the candidate a clearer view of the institution. Librarian appointments are made by the University Librarian, based on the recommendations of the search committee, the supervisor of the position and others. These appointments are subject to approval by the Provost. Upon receipt, an acknowledgement letter and electronic equal employment opportunity form are emailed to you. After selections have been made by the search committee, interviews are scheduled once a selection. Applicants not chosen for the position will be notified. Exempt Staff are employees whose responsibilities are primarily executive, managerial, or administrative, or whose positions require an advanced educational degree or knowledge and experience in a field considered professional. These positions are paid monthly and are exempt from the overtime requirements of the Fair Labor Standards Act (FLSA) that mandate overtime pay for time worked in excess of 40 hours per week. Non-Exempt Staff are employees holding positions in support activities. Employees in these jobs are not exempt from the Federal labor Standards Act (FLSA) overtime provisions and they are paid by the hours and are paid 1½ times their regular pay rate for hours worked in excess of 40 in a week. (Source: NUHR Staff Handbook) Upon receipt, the HR department will send an email acknowledgement. When the hiring department selects a candidate for an interview, the Library's HR office will send an email. Selections are done by the hiring department. Once the selection has been made, the hiring supervisor or the Library HR Office will send you an email. The NU Library only accepts applications (resumes if requested) that are submitted through the electronic application system.  For those without Internet access, the Library has computers available that can be used to access the electronic application system. Please do not contact the hiring department directly.  All applications must be submitted through the electronic application system. All temporary employees are paid biweekly. Temporary employees are paid on the Friday 13 days after the end of their work period. If you sign up for direct deposit in myHR, it will take effect immediately. If you use the paper form, it will take up to a week for processing. We process the payroll about 4 or 5 days before the pay date to ensure timely deposit through the banking system, as well as timely printing and delivery of checks and direct deposit statements. Please use  myHR if you are an active employee. If you are no longer active and have left the university, please use a Personal Data Form. Please keep in mind that we do not have access to address updates in Caesar (student system). Call the Payroll Office at 847-491-7362 (Evanston campus) or 312-503-9700 (Chicago campus) or email payroll@northwestern.edu. You need to complete a personal data form and attach to it a copy of your new Social Security Card. Your name in payroll must match your Social Security Card. You will still be paid. All hours that are entered on a time sheet will be paid even if not approved. We will follow up with the supervisor later for manual approval if the supervisor's backup doesn't approve.",
  "timestamp": 1733797376.8394377
}