{
  "url": "http://www.library.northwestern.edu/visit/events-exhibits/exhibits.html",
  "title": "Exhibits: Libraries - Northwestern University",
  "content": "Garry Marshall, Northwestern class of ’56, created some of America’s favorite sitcoms and romantic comedies, from Happy Days to The Princess Diaries. After his passing in 2016, his wife Barbara gifted the bulk of her husband’s voluminous career archive to Northwestern. This exhibit of the Garry Marshall Papers explores the ephemera, scripts, photographs, and reams of stand-up jokes that reveal a look inside the life of a Hollywood royal. This exhibit is comprised of several uncatalogued or little-known medieval music manuscripts taken from the Charles Deering McCormick Library of Special Collections and University Archives and Northwestern’s Music Library. This exhibit gives insight into early music notation and showcases differing ways of reading, writing, and performing music, religiosity, sociability, power, and identity. Many of the manuscripts, spanning from around the 10th Century to the Renaissance, depict chants, hymns, and text utilized for rituals. Curated by Paul Feller-Simmons (’25 PhD) with Lauren Cole (’27 PhD), Phoenix Gonzalez (’26 PhD), and Ben Weil (’26 PhD) Domenico Carlo Maria Dragonetti (1763 -1846) is well-known to bassists in the world of classical music. Perhaps the fist “rock star” of the double bass, his career had a profound influence on the development of the instrument in terms of technique, repertoire, and status. Inventing his own bow and right-hand method, his approach opened the ears of audiences and composers alike. Digital Dragonetti explores the life and career of this important musician by highlighting primary source materials contained in the Hans Moldenhauer Collection. Included are collections of letters, manuscripts and other documents addressed to or referring to Domenico Dragonetti, as well as other personal correspondence, papers, and written music. From costumed May Day pageants in Deering Meadow to free-form Armadillo Day festivals with student-designed entertainment, celebrations by Northwestern students to mark the end of the school year have taken many forms. Since the 19th century these events have reflected the social realities and campus concerns of their times. Looking back at the history of May celebrations, change and renewal may be its own form of tradition. From May Day and Women's Week to the current Dillo Day and Mayfest, recount the history of May Celebrations at Northwestern with art, photography and newspaper articles. The modern American environmental movement got underway rapidly in the late 1960s. Before the first Earth Day in April 1970 and amid new coordination on college campuses nationwide, Northwestern held the first environmental “teach-out” on January 23: “Project Survival.” Organized by Northwestern Students for a Better Environment (NSBE), the all-night event was addressed to the campus, local community members, students from all over the midwest, and a national audience. As many as 10,000 people passed through the doors of the Technological Institute that night, including members of the press who started a flood of national media coverage. Drawing from archival collections, this exhibit explores Project Survival as a complex event, its background and aftermath, how its message was presented and received. The focus of the teach-out itself may represent a snapshot of the environmental movement in 1970. Curated by Ben Taylor as a practicum project while working toward a degree in library and information science with the University of Illinois Urbana-Champaign. Juneteenth marks a momentous celebration — the end of American slavery — but it was not the end of the story about Black Americans’ struggle for freedom and equality. As Northwestern marks its first observance of the new federal holiday, we examine how deeply slavery was ingrained in 19th century America, how abolitionists forced a nation to face its inhumanity — and how that work must continue today. Juneteenth shows us that justice can prevail. But it must be fought for, even after it has been granted. Curated by Marquis Taylor, history PhD student. Materials are drawn from the Charles Deering McCormick Library of Special Collections and University Archives; and the Melville J. Herskovits Library of African Studies. The Berkeley Folk Music Festival & the Folk Revival on the US West Coast is a digital exhibit curated by Dr. Michael J. Kramer that presents the story of the Berkeley Folk Music Festival, which took place on the campus of the University of California between 1958 and 1970. The Exhibit was curated from the Berkeley Folk Music Festival Archive, a repository of roughly 33,500 artifacts housed at Northwestern University Libraries and now fully digitized through a National Endowment for the Humanities Preservation and Access Grant. Within the Exhibit, a narrative history points to the understudied significance of California and the West Coast in the larger story of the American folk music revival. It also shows how materials in the Berkeley Folk Music Festival Archive raise important questions about race, class, gender, region, higher education, public space, cultural heritage, and the practice of American democracy during the decades after World War II. A half century ago, with the U.S. intercity passenger rail market in rapid decline, the Rail Passenger Service Act of 1970 consolidated and restructured passenger rail service under a quasi-public corporation. On May 1, 1971, Amtrak went into service. Fifty years later, there is increased interest in railroads from a generation of enthusiasts for whom the appeal of railroads is as much about sustainability, urbanism, and land use as it is the aura of railroading itself. In honor of Amtrak’s 50 anniversary, this exhibit looks back at highlights from the railroad’s history through passenger ephemera, reports, and other documents in the collections of Northwestern University’s Transportation Library. Emboldened by the 1968 Bursar’s Office Takeover, Black students began asserting more of a place in the social and cultural life of Northwestern. One of the lasting additions to the student community came on May 8, 1971, with the founding of the Northwestern Community Ensemble (NCE), a student choral group grounded in the Black Christian music tradition to provide students a spiritual outlet, to sing Black sacred music, and to foster community. This online exhibit examines first 10 years of the organization, using archival records and oral history interview clips with the founders, early leaders, and student organization members. Longer than the Wright brothers first flight, wider than a boulevard, and with a tail height as tall as a six-story building, the 747 was a revolution in aviation technology and the passenger experience when it entered service on January 22, 1970. The online exhibit The 747 Takes Off explores this plane's early days of flight. John Cage, one of the most influential composers of the 20th century, shaped the avant garde music scene by introducing chance elements, performer preferences, and non-traditional instrumentation. His works are just as essential in the history of dance, where his collaborations with choreographers (including his life partner Merce Cunningham) became the accompaniment that strongly informed an era of experimentation. This exhibition draws on John Cage’s collection housed in Deering Library to explore his creative collaborations with choreographers, and his impact on the history of dance. As nations throughout Africa attained their independence in the 1960s and surrounding decades, the establishment of national airlines soon followed. These airlines served important functions in connecting regions underserved by rail and road infrastructure. Equally as important, they served as symbols of national identity, economic expansion, modernity, and technological advancement. This exhibit looks at the history of African airlines through materials from the collections of the Transportation Library and the Herskovits Library of African Studies. Domenico Carlo Maria Dragonetti (1763 -1846) is well-known to bassists in the world of classical music. Perhaps the fist “rock star” of the double bass, his career had a profound influence on the development of the instrument in terms of technique, repertoire, and status. Inventing his own bow and right-hand method, his approach opened the ears of audiences and composers alike. Digital Dragonetti explores the life and career of this important musician by highlighting primary source materials contained in the Hans Moldenhauer Collection. Included are collections of letters, manuscripts and other documents addressed to or referring to Domenico Dragonetti, as well as other personal correspondence, papers, and written music. Technologies inspire the creation of new subjectivities - changing our points of perspective and augmenting the ways in which we perceive. Through our ever-expanding applications of innovation, humans recontextualize realities. We use the tools of the present to formulate our visions of the future and our understandings of the past. Along these explorations of meaning, we apply interfaces of magic upon the seemingly mundane to educate and entertain. Augmented Curiosities engages our technological entanglements through the emerging, immersive and experiential visualization techniques of Augmented Reality (AR) and Virtual Reality (VR). Critiquing the colonial dynamics of the “cabinets of curiosity” which significantly influenced Western museum practices, Augmented Curiosities provides opportunities for intimate and playful interactions with African material culture from the Herskovits Library Collection. Through this digitally tactile experience, we exhibit synergies of the technical and the tangible as a community-oriented framework for future museum curation. Curated by Craig Stevens, archaeology PhD student and Innovator in Residence with Media & Technology Innovation. From costumed May Day pageants in Deering Meadow to free-form Armadillo Day festivals with student-designed entertainment, celebrations by Northwestern students to mark the end of the school year have taken many forms. Since the 19th century these events have reflected the social realities and campus concerns of their times. Looking back at the history of May celebrations, change and renewal may be its own form of tradition. From May Day and Women's Week to the current Dillo Day and Mayfest, recount the history of May Celebrations at Northwestern with art, photography and newspaper articles. The modern American environmental movement got underway rapidly in the late 1960s. Before the first Earth Day in April 1970 and amid new coordination on college campuses nationwide, Northwestern held the first environmental “teach-out” on January 23: “Project Survival.” Organized by Northwestern Students for a Better Environment (NSBE), the all-night event was addressed to the campus, local community members, students from all over the midwest, and a national audience. As many as 10,000 people passed through the doors of the Technological Institute that night, including members of the press who started a flood of national media coverage. Drawing from archival collections, this exhibit explores Project Survival as a complex event, its background and aftermath, how its message was presented and received. The focus of the teach-out itself may represent a snapshot of the environmental movement in 1970. Curated by Ben Taylor as a practicum project while working toward a degree in library and information science with the University of Illinois Urbana-Champaign. Juneteenth marks a momentous celebration — the end of American slavery — but it was not the end of the story about Black Americans’ struggle for freedom and equality. As Northwestern marks its first observance of the new federal holiday, we examine how deeply slavery was ingrained in 19th century America, how abolitionists forced a nation to face its inhumanity — and how that work must continue today. Juneteenth shows us that justice can prevail. But it must be fought for, even after it has been granted. Curated by Marquis Taylor, history PhD student. Donald L. Roberts (1938-2022) served as the longtime Head of the Music Library at Northwestern University. These pages serve as a tribute to his work here at the Libraries, as well as his contributions to the fields of music, ethnomusicology, and music librarianship. As a librarian, Roberts was instrumental in developing the Music Library into a destination for contemporary music scholarship. He acquired notable distinctive collections for Northwestern Libraries, including the John Cage Collection and the Fritz Reiner Collection. The Berkeley Folk Music Festival & the Folk Revival on the US West Coast is a digital exhibit curated by Dr. Michael J. Kramer that presents the story of the Berkeley Folk Music Festival, which took place on the campus of the University of California between 1958 and 1970. The Exhibit was curated from the Berkeley Folk Music Festival Archive, a repository of roughly 33,500 artifacts housed at Northwestern University Libraries and now fully digitized through a National Endowment for the Humanities Preservation and Access Grant. Within the Exhibit, a narrative history points to the understudied significance of California and the West Coast in the larger story of the American folk music revival. It also shows how materials in the Berkeley Folk Music Festival Archive raise important questions about race, class, gender, region, higher education, public space, cultural heritage, and the practice of American democracy during the decades after World War II. If you’ve read this year’s One Book One Northwestern selection, Just Mercy: A Story of Redemption, you’ve been introduced to powerful criticism of the American justice system, and the enduring power of two opposing forces: the cruelty of racism and the grace of compassion. Northwestern University Libraries has many resources that build on author Bryan Stevenson’s themes to explore the carceral system and its impact on the human lives made to endure it. Each of these resources —from books to documentaries to research guides —are available through your Libraries. We hope they inspire you to reflect, take action, and contribute to positive change that makes a more just and merciful world. A half century ago, with the U.S. intercity passenger rail market in rapid decline, the Rail Passenger Service Act of 1970 consolidated and restructured passenger rail service under a quasi-public corporation. On May 1, 1971, Amtrak went into service. Fifty years later, there is increased interest in railroads from a generation of enthusiasts for whom the appeal of railroads is as much about sustainability, urbanism, and land use as it is the aura of railroading itself. In honor of Amtrak’s 50 anniversary, this exhibit looks back at highlights from the railroad’s history through passenger ephemera, reports, and other documents in the collections of Northwestern University’s Transportation Library. Emboldened by the 1968 Bursar’s Office Takeover, Black students began asserting more of a place in the social and cultural life of Northwestern. One of the lasting additions to the student community came on May 8, 1971, with the founding of the Northwestern Community Ensemble (NCE), a student choral group grounded in the Black Christian music tradition to provide students a spiritual outlet, to sing Black sacred music, and to foster community. This online exhibit examines first 10 years of the organization, using archival records and oral history interview clips with the founders, early leaders, and student organization members. Longer than the Wright brothers first flight, wider than a boulevard, and with a tail height as tall as a six-story building, the 747 was a revolution in aviation technology and the passenger experience when it entered service on January 22, 1970. The online exhibit The 747 Takes Off explores this plane's early days of flight. John Cage, one of the most influential composers of the 20th century, shaped the avant garde music scene by introducing chance elements, performer preferences, and non-traditional instrumentation. His works are just as essential in the history of dance, where his collaborations with choreographers (including his life partner Merce Cunningham) became the accompaniment that strongly informed an era of experimentation. This exhibition draws on John Cage’s collection housed in Deering Library to explore his creative collaborations with choreographers, and his impact on the history of dance. As nations throughout Africa attained their independence in the 1960s and surrounding decades, the establishment of national airlines soon followed. These airlines served important functions in connecting regions underserved by rail and road infrastructure. Equally as important, they served as symbols of national identity, economic expansion, modernity, and technological advancement. This exhibit looks at the history of African airlines through materials from the collections of the Transportation Library and the Herskovits Library of African Studies. The story of passenger transportation in the mid-20th century is one of shifting modes, new technologies, and intense innovation. New corporate identities, created by some of the leading designers of the day,  provided a visible representation of the continually-evolving modernity of passenger transportation in the jet age. This exhibit highlights items from the Transportation Library's special and circulating collections, and highlights contributions of donors, whose collections are featured in the exhibit. One hundred years after the U.S. entry into World War I, the Northwestern University Libraries look back at how the war shook this campus — and remember the faculty and students who sacrificed all for their country. In addition to artifacts commemorating fallen students and a series of wartime posters by the U.S. government, this exhibit includes a special focus on Northwestern’s own Base Hospital 12, a deployment of doctors and nurses drawn from the University and the Chicagoland area. As it is today, the bicycle at the turn of the 20th century was a form of transportation, recreation, amusement, and a creator of community. This exhibition looks at bicycles in all of these forms through printed matter in the collection of Northwestern University’s Transportation Library. In the spring of 1915, a group departed Iowa in a Model T for a journey to the Panama Pacific International Exhibition in San Francisco, with a turn off to the Colorado Loop along the way. Follow their cross-country journey through an online exhibit featuring photos from an album housed at Northwestern University's Transportation Library. A chronological overview of Willard’s life, from her student days at the North Western Female College to her leadership role in the WCTU. This exhibit focuses on the complex ties between Willard and the “Classic Town” — Evanston— that helped shape her vision of the world and her role in it. On March 23, 1963, President John F. Kennedy offcially dedicated O'Hare International Airport. Fifty years later, our beloved O'Hare is still going strong and has become a city and national transporation icon. James “Jim” Foley was a conflict journalist and Medill graduate who covered violent civil wars in Libya and Syria. In 2012, he was captured in Syria; nearly two years later he was beheaded by his captors in a public YouTube video that shocked the world. This year marks 10 years since Foley’s death. Conflict journalists expose us to violent strife around the world and share the plight of those caught in the crossfire. Foley’s life was dedicated to documenting and sharing the stories of the individuals at the heart of wars to promote civil and political action. Artist Bradley McCallum uses Foley’s video footage from the civil wars in Libya and Syria to create oil paintings that he further activates with augmented reality, allowing viewers to experience Foley’s presence, and the footage that inspired the paintings. Inescapable Truths is exhibited on Level 4 in University Library (April 3 – June 14) and in Dittmar Gallery in the Norris University Center (April 3 – May7). Technologies inspire the creation of new subjectivities - changing our points of perspective and augmenting the ways in which we perceive. Through our ever-expanding applications of innovation, humans recontextualize realities. We use the tools of the present to formulate our visions of the future and our understandings of the past. Along these explorations of meaning, we apply interfaces of magic upon the seemingly mundane to educate and entertain. Augmented Curiosities engages our technological entanglements through the emerging, immersive and experiential visualization techniques of Augmented Reality (AR) and Virtual Reality (VR). Critiquing the colonial dynamics of the “cabinets of curiosity” which significantly influenced Western museum practices, Augmented Curiosities provides opportunities for intimate and playful interactions with African material culture from the Herskovits Library Collection. Through this digitally tactile experience, we exhibit synergies of the technical and the tangible as a community-oriented framework for future museum curation. Curated by Craig Stevens, archaeology PhD student and Innovator in Residence with Media & Technology Innovation. Juneteenth marks a momentous celebration — the end of American slavery — but it was not the end of the story about Black Americans’ struggle for freedom and equality. As Northwestern marks its first observance of the new federal holiday, we examine how deeply slavery was ingrained in 19th century America, how abolitionists forced a nation to face its inhumanity — and how that work must continue today. Juneteenth shows us that justice can prevail. But it must be fought for, even after it has been granted. Curated by Marquis Taylor, history PhD student. Materials are drawn from the Charles Deering McCormick Library of Special Collections and University Archives; and the Melville J. Herskovits Library of African Studies. On display in Deering Library as well as in an online exhibit. Throughout Northwestern’s history, its students have excelled at theatrical productions, from impromptu class revues in the 1870s to Emmy- and Oscar-winning achievements today. In celebration of this star-studded heritage, this blockbuster exhibit uses photographs, posters, programs, and artifacts to showcase the University’s stellar faculty and alumni from every aspect of theatrical performance: acting, writing, directing, and teaching. One hundred years after the U.S. entry into World War I, the Northwestern University Libraries look back at how the war shook this campus — and remember the faculty and students who sacrificed all for their country. In addition to artifacts commemorating fallen students and a series of wartime posters by the U.S. government, this exhibit includes a special focus on Northwestern’s own Base Hospital 12, a deployment of doctors and nurses drawn from the University and the Chicagoland area. A collaboration with The Block Museum, this exhibit was curated by Brian Leahy, graduate student in Art History.  Any installation of a González-Torres work tests institutional assumptions about authorship, viewership, and display practices. While his work today is most often seen in museum environments, this specific manifestation occurs in—and asks questions of—the library. \"Untitled\" (The End) is accompanied by a collection of books on the artist, on display in the Eloise Martin Reading Room in Deering Library. University Libraries house millions of items, from well-used books and databases to rare manuscripts and archives. Three times a year, our Footnotes magazine highlights the hidden treasures most people never encounter. We invite you to discover something new in our display cases and, should curiosity move you, explore it more closely amid our rich collections. An exhibit curated by Northwestern students. How is sound—ephemeral by nature—registered in material objects? Traces of performance are recoverable across a variety of artifacts found in the distinctive collections of the Northwestern University Libraries. Here at the 50th anniversary of NOW, join Northwestern University Libraries as we celebrate DeCrow's accomplishments with an exhibit drawn from her personal papers (which were donated to University Archives upon her death in 2014) and materials from our vast Femina Collections documenting the First and Second Wave liberation movements. Ambassador, U.S. comptroller, brigadier general, Nobel laureate: Evanston resident Charles Gates Dawes played many roles in his life, but perhaps he is best known as vice president under Calvin Coolidge from 1925 to 1929. As part of the 150th anniversary of Dawes’ birth, Northwestern Libraries present an exhibit that explores his life as a political force and fierce campaigner for Republican candidates and power player in the administrations of William McKinley, Warren Harding and Coolidge. Four centuries after the passing of the world’s most famous author, it’s tempting to put the man on a pedestal —sometimes quite literally. But William Shakespeare didn’t write from a lofty tower; his relatable themes, colorful characters, sharp satire and bawdy jokes have always marked him a man of the people. Which is why connecting with Shakespeare today shouldn’t be difficult or uncommon. Join Northwestern Libraries as we revel in our many holdings that give students and faculty such different ways to discover, read and re-tell Shakespeare’s tales. Charlotte Moorman electrified the avant-garde scene in 1960s New York with experimental approaches to music, performance and pure spectacle. Drawn from archives held in the Music Library and Charles Deering McCormick Library of Special Collections, scores, publications, photos and promotional fliers illuminate a time when artists rebelled against the rigidity of postwar culture by challenging – perhaps even rewriting – the definitions of art. Amid the books, journals, records and reports in the Transportation Library are 14,000 items donated by scholars and transportation enthusiasts. Including queenly coronation timetables, Concorde passenger kits and even airline menus that double as sun reflectors, this exhibit offers a peek inside these donated collections and opens the door for connections yet to be discovered at the intersection of benefactors and researchers.​ A new exhibit in Northwestern University Library examines the intersection of the government and our nation’s ability to feed itself. On display in the entry corridor of University Library, the exhibit explores the myriad ways that information produced by the U.S. government has influenced everything from how food is grown to how it's served. Not everything in a library fits neatly between book covers. “Beyond the Book: The Changing Nature of Library Collections” explores many of the unusual and rare items that occupy Northwestern University Library shelves  – from chalkboards to lollipops – and how the Preservation department ensures they endure. In 1994, South Africa held its first fully democratic election and witnessed the inauguration of its first black president. To mark 20 years of democracy, this exhibit explores the struggles and progress of the South African democratic movement through materials from the Melville J. Herskovits Library of African Studies. It reveals the country’s first electoral process, Northwestern University’s role in the global antiapartheid movement, and the state of democracy in South Africa over the last 20 years. From the time of the French Revolution to the beginning of the 20th century, architecture students of the Ecole des Beaux-Arts in Paris who studied at the French Academy in Rome were obliged to produce a reconstruction of an ancient monument.  In the 1870s, the best and most interesting of these were engraved and published by the French government. This display, drawn from volumes in our McCormick Library of Special Collections, illustrates how the techniques of conceiving such an archeological reconstruction changed and matured over time. Local photographer Alexander Hesler (1823–1895) published a volume photographs of Evanston buildings and streetscapes, Photographic Views of Picturesque Evanston, in 1887. The exhibit celebrates Evanston's 150th anniversary with 40 images from Picturesque Evanston, which highlight Evanston's past—gracious homes, tree-lined streets and the young Northwestern campus. Thanks to Hesler's photography and the magic of technology, a slice of Evanston's history is vividly brought back to life. Northwestern University has approached climate change through science, innovative engineering, student initiatives and strategic imperatives to reduce greenhouse gases and develop clean energy. This exhibit highlights these efforts and the vast book, map, digital and archival resources of Northwestern University Library. From 1930 to 1946, radio listeners were fascinated by show Clara, Lu ‘n’ Em. These gossiping  gals with prosaic lives and sloppy grammar were invented and portrayed by the University’s School of Speech alumnae. Clara, Lu ‘n’  Em was the first radio show created and performed by women, who wrote every script and negotiated the complex world of sponsorships and contracts. “Tune in Again” features scripts, news clippings, audio and artifacts from the show, received as a generous donation to the University Archives from “Em’s” family. In an era of Facebook and Instagram, it’s important to recall that once we collected our own histories by pasting them into scrapbooks. Past, Paper, Scissors explores history at Northwestern and beyond as depicted by the photos, clippings, ticket stubs, faded flowers, and dance cards packed onto the scrapbook pages of a bygone era—and looks forward to the ways we can preserve our increasingly digital memories to create tomorrow’s history. Printmaker and art-book creator Mikhail Karasik brings us \"Homage to Khidekel.\" The suite of prints interpret the work of the artist and architect Lazar Khidekel (1904-1986). Khidekel, a pupil of the Suprematist artist and theorist Kasimir Malevich. While he tried to incorporate Suprematist and Futurist aspects into his architectural work, the cultural climate of Stalinist Russia turned against the avant garde, and much of his commissioned work conformed to state sponsored aesthetics. Viola Spolin was a pioneer in American Theatre. She has been called “the high-priestess of improv” and is best known as the creator of theater games, originally created as a series of exercises to aid students in the study of drama. Her games and approach to theatre inspired the creation of The Second City, other famous theatre projects, and was the fundamental impetus for Chicago’s improv theatre movement. A star of the stage and screen, Northwestern alumna Patricia Neal was best known for her film roles in Breakfast at Tiffany’s and Hud, for which she won the Academy Award for Best Actress. But her other starring roles included a mother to her five children, the survivor of a disabling stroke from which she painstakingly recovered, and a passionate advocate for other stroke patients. The exhibit explores all these legacies, based on the extraordinary collection of personal papers, Hollywood souvenirs, photos, and other memorabilia held by University Archives.",
  "timestamp": 1733797237.9080877
}