{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2021/summer-library-service-updates.html",
  "title": "Summer Library Service Updates: Libraries - Northwestern University",
  "content": "We at the Libraries hope you’re healthy and looking forward to joining us as we incrementally reopen our buildings over the summer. Our services will remain uninterrupted, as always. Some things you should know as we greet the end of this quarter: On June 14, the Libraries will increase on-site, in-building access in University and Deering libraries, with a return to open stacks and appointment-free building access for faculty, students, and staff. The North Study Lounge and Classroom 2210 on the second floor of Mudd Library are open for walk-in, individual study with an active Wildcard at any hour, 24/7. Not all service desks throughout the buildings will be staffed at the start of the summer quarter. Appointments will continue to be required for services such as the McCormick Library of Special Collections and University Archives. Please check our hours page for building hours. Reopening the stacks requires the end of our HathiTrust Emergency Temporary Access Service. While opening our stacks is a positive change for our in-person community, according to our agreement, HathiTrust materials that are available in our physical stacks will no longer be available digitally. We’re grateful for the emergency access HathiTrust provided for the last year, and many in our community have grown to rely on it. Access to public domain books and periodicals in HathiTrust will continue without restriction. Students and faculty unable to come to campus over the summer can request physical materials be mailed to them. For any questions about access, email library@northwestern.edu. Now that our partner libraries are loosening their loan restrictions, we are able to increase our borrowing for Northwestern faculty and students. Our Interlibrary Loan services, which were a lifeblood for many of you during the pandemic, remain available as always. Please contact us at library@northwestern.edu with any questions, and keep an eye on our website over the summer as services evolve.",
  "timestamp": 1733797138.5869172
}