{
  "url": "https://www.library.northwestern.edu/libraries-collections/herskovits-library/about-melville-herskovits.html",
  "title": "About Melville J. Herskovits: Libraries - Northwestern University",
  "content": "The library derives its name from Melville J. Herskovits, founder of Northwestern University's Anthropology Department in 1938 and founder of the University's Program of African Studies in 1948. Professor Herskovits was largely responsible for the development of a distinguished Africana collection at Northwestern. The Melville J. Herskovits papers are located in the University Archives. See collection details. Melville Jean Herskovits was born in Bellefontaine, Ohio, on September 10, 1895. He grew up in Ohio, Texas and Pennsylvania. Following service in France in the U.S. Army Medical Corps during World War I, he completed an undergraduate degree in history at the University of Chicago in 1920. Herskovits turned to the study of anthropology in 1920 when he began graduate work at Columbia University under Franz Boas. In 1921, he received a master's degree and began his teaching career at Columbia. He continued to work with Boas and received his Ph.D. in 1923, with a dissertation entitled The Cattle Complex in East Africa. New York City, in particular Columbia, was an important center of anthropological activity in the 1920s and Herskovits not only encountered ideas and disciplines that shaped his career, but also made life long friends and colleagues all of whom shaped the development of anthropology as a discipline. In addition to his work with Boas, Herskovits studied at the New School for Social Research under Thorstein Veblen. Among his colleagues and fellow students were Ruth Benedict, Margaret Mead, Elsie Clews Parsons and Frances Shapiro, whom he married in Paris on July 12, 1924. Between 1924 and 1927, Herskovits lectured at Columbia and in 1925 was named Assistant Professor of Anthropology at Howard University. At Howard, as at Columbia, Herskovits became acquainted with a number of individuals who became friends and professional associates, including Ralph Bunche and E. Franklin Frazier. Herskovits moved to Northwestern in 1927 as assistant professor of sociology, the only anthropologist in the department. He became an associate professor in 1931, a full professor in 1935, and presided over the creation of the Department of Anthropology becoming its first chairman in 1938. In 1948, he established the Program of African Studies and became its first director. In 1961, Northwestern appointed Herskovits to the Chair of African Studies, the first such position in the United States. Herskovits died in Evanston on February 25, 1963. Herskovits's long career as a scholar and teacher was centered on the study of African peoples in the western hemisphere and Africa. In 1928 he conducted field work in Suriname which resulted in the publication of two books jointly authored with Frances Herskovits, Rebel Destiny (1934) and Suriname Folk Lore (1936). Subsequently, field work was carried out in Benin, Brazil, Haiti, Ghana, Nigeria and Trinidad. The monographs resulting from this field research, many of which were jointly authored with Frances Herskovits, are considered classic works today. Herskovits also was the author of influential general works. These include: The Myth of the Negro Past (1941), in which he exploded pervasive racial myths; The Economic Life of Primitive People (1940), still considered a basic text in economic anthropology; and Man and His Works (1948), a classic text in cultural anthropology. Three of Herskovits's last books, Continuity and Change in African Culture (1959), Economic Transition in Africa (1964), and The Human Factor in Changing Africa (1962), reflect both the rapid development of Africa's place in the world and the increased academic interest in African studies. Throughout his career, Herskovits was very active in professional organizations, and the list of his honors and awards is very long. He was a founding member and the first president of the African Studies Association in 1957-58. He also held offices in other organizations including the American Anthropological Association, the American Association for the Advancement of Science, the American Folklore Society, and the International Anthropology Congress. He was a central figure in the organization of the First International Congress of Africanists held in Ghana in 1962. He also served in numerous advisory capacities to government including the Mayor's Committee on Race Relations in Chicago (1945) and the U.S. Senate Foreign Relations Committee (1959-60).",
  "timestamp": 1733796456.7801085
}