{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/collection-highlights/northwestern-history/multimedia/naval-reserve-films.html",
  "title": "US Naval Reserve Midshipmen's School Films: Libraries - Northwestern University",
  "content": "The University Archives, with the help of Northwestern's Digital Collections department, presents digitized versions of three short, color films on the US Naval Reserve Midshipmen's School that was located at NU from 1940-1945. Northwestern's stated objective was to use its entire resources to aid in winning the war. To this end an accelerated program of study incorporating the quarter system was adopted which allowed students to graduate in three years by attending summer sessions. Students who had completed three years of high school with high standing were allowed to enter the university so that they could complete their college degree before reaching the minimum draft age of twenty. Northwestern also offered its facilities for use by the War Department. The Army, Navy, and the Civil Aeronautics Administration operated eleven training programs at Northwestern in addition to the Naval Reserve Officers Training Corps (N.R.O.T.C.) established in 1926, which was a popular program on campus and increased in enrollment with the outbreak of war. The Navy V-7, Naval Reserve Midshipmen's School, was established at Northwestern in September 1940 and operated for the duration of the war. Its intent was to expand the Navy's officer corps through an intense, accelerated training program. The program's midshipmen (also known as the \"90-day wonders,\" because of their abbreviated course of study) pursued courses in gunnery, navigation, engineering, and seamanship, after which they entered active duty as ensigns in the United States Naval Reserve. Instruction was given in navigation, seamanship, ordnance and gunnery, and engineering. In 1941, the admission requirements were changed, requiring applicants to have a college degree, one course in plane trigonometry, and one additional year of mathematics. Though not part of the V-7 program, President John F. Kennedy attended a separate accelerated training program at Abbot Hall, a two month course for already commissioned officers. President Kennedy was commissioned as Ensign in October 1941 and following his training at Northwestern went on to PT Boat training at Melville, RI, in October 1942 where he was promoted to Lieutenant.",
  "timestamp": 1733797833.812286
}