{
  "url": "https://www.library.northwestern.edu/visit/visitor-privileges/out-of-town.html",
  "title": "Out-of-Town Visitor Resources: Libraries - Northwestern University",
  "content": "Our libraries and collections welcome individual scholars and groups from around the country and the world. To make the most efficient use of your time, please consult with library staff regarding your research needs, and make an appointment prior to visiting campus. Some materials are stored offsite and require extra time for retrieval. You can begin exploring our collections online, using the Archives and Manuscripts Collections Portal or in NUsearch, the Libraries' catalog. In addition, some collections often have additional finding aids or resource lists not available electronically. See our Libraries and Collections to learn about specific collections and find contact information. General procedures include: If you are flying to the area, both O’Hare (northwest of Chicago) and Midway (on the south side of Chicago) International Airports service international and domestic flights. Information regarding travel and directions to campus can be found on the University's Visiting Campus webpage, which includes maps, driving directions and public transit options on the CTA and Metra. Local taxi companies (neither contracted nor officially endorsed by Northwestern University Libraries) include 303 Taxi, American Taxi and Northshore Cab. You can park on campus or in the city of Evanston. Some local accommodation options include: On campus, dormitory-style accommodations are available through: If you are in search of necessities or dining options in the Evanston area, don't hesitate to ask our staff. Below, vendors are listed for your convenience (and are not officially endorsed by Northwestern University or Northwestern University Libraries). Grocery stores and pharmacies: More dining information can be found through the Evanston Chamber of Commerce.",
  "timestamp": 1733796375.6417003
}