{
  "url": "https://www.library.northwestern.edu/faculty-staff/reserve/copyright.html",
  "title": "Copyright and Reserve: Libraries - Northwestern University",
  "content": "The copyright law of the United States (Title 17, United States Code) governs the making of photocopies or other productions of copyrighted material. Under certain conditions specified in the law, libraries and archives are authorized to furnish a photocopy or reproduction. One specified condition is that the photocopy or reproduction is not to be used for any purpose other than private study, scholarship, or research. If electronic transmission of reserve material is used for purposes in excess of what constitutes \"fair use,\" that user may be liable for copyright infringement. Copyright as a legal concept in the United States has its roots in the United States Constitution in Article 1 Section 8, Clause 8: \" To promote the progress of science and useful arts, by securing for limited times to authors and inventors the exclusive right to their respective writings and discoveries.\" Title 17 of the United States Code provides the laws that further define copyright. Title 17 grants the owners of copyright exclusive rights to reproduce, perform, distribute and license their works for a limited time. Current law requires no official copyright registration, defining as copyrighted from 1989 on \"any original works of authorship fixed in any tangible medium of expression, now known or later developed, from which they can be perceived, reproduced, or otherwise communicated, either directly or with the aid of a machine or device.\" Some documents are not copyrighted at all. A work may have passed into the public domain. Or it may be a government document, a collection of facts or freeware. These may all be used without copyright permission. The majority of acceptable free use of copyrighted materials for educational purposes exists in limitations to the law, found in Title 17, Chapter 1, Sections 107 and 108. Generally, the most useful limitation of copyright for disseminating materials for pedagogical use falls under the Fair Use Doctrine. It is important to note that the Fair Use Doctrine provides no hard-and-fast rules to gauge fair use. Case law has done little to clarify fair use. And the Internet has added chaotic elements to an already ambiguous set of standards. All four factors in the Fair Use Doctrine must be taken into consideration on a case-by-case basis to decide if a work falls within fair use. Section 107 sets out four factors that must be used to ascertain fair use. Licensing has serious implications for the concept of fair use. The model of licensing electronic information has become the industry standard. The majority of electronic information available through libraries is leased rather than owned. In this environment license agreements take on profound implications as contracts are legally binding, regardless of where they fall in our interpretations of fair use.",
  "timestamp": 1733796891.844476
}