{
  "url": "https://www.library.northwestern.edu/find-borrow-request/reproduce-materials/index.html",
  "title": "Reproduce Materials: Libraries - Northwestern University",
  "content": "The Libraries offer a variety of reproduction services that include scans of items in our general collection and special collections. Patrons with NetIDs can requests scans of periodical articles and book chapters that are held in libraries across Northwestern University. Our Interlibrary Loan (ILL) staff offers this free service, and requests can be made through your ILL account. Read more on article and book chapter scanning. Our individual collections grant permission and reproduce a wide variety of print and multimedia materials for patrons upon request. Each unit's reproduction formats, terms and fees vary. Each library unit grants reproduction permission to the requestor for one-time use only, for the purposes stipulated in the request. Requests to publish must indicate the specific use intended. The requester is responsible for obtaining any required permission from the creator of the work or from the creator's heirs or executors. Reproductions may not be reused for any other purpose, or published in any other format (including but not limited to: print, film, slide presentation, video, television, and electronic transmission); nor may it be transferred to another party without permission from Northwestern University Libraries. The user assumes all responsibility for infringement of copyright or other rights and agrees that Northwestern University Libraries is free from liability for any infringement of use by the requester. Northwestern University Library reserves the right to refuse permission and reproductions to anyone who does not agree to these conditions. The standard credit line for materials from the Northwestern University Libraries is as follows: \"Courtesy Northwestern University Libraries.\" The individual Distinctive Collections request a more specific citation, as noted on the Rare Materials Reproduction page.",
  "timestamp": 1733796320.9608653
}