{
  "url": "https://www.library.northwestern.edu/libraries-collections/music/collection/beatles.html",
  "title": "Beatles Manuscripts: Libraries - Northwestern University",
  "content": "From the John Cage Notations Collection  In the mid 1960s, composer John Cage undertook a project to collect manuscripts by musicians of that era. Along with works of Cage, Aaron Copland, Igor Stravinsky, Pierre Boulez, and over 250 other composers, Cage obtained a handful of original lyric sheets for songs by the Beatles. At the time Cage did not know the Beatles personally, but he was in touch with artist Yoko Ono, who had just entered the Beatles’ circle and arranged for the manuscripts to be sent to Cage. Cage received lyric sheets for seven songs: “The Word,” “Eleanor Rigby,” “I’m Only Sleeping,” “Yellow Submarine” (on two sheets), “Good Day Sunshine,” “And Your Bird Can Sing” (showing the working title “You Don’t Get Me”), and “For No One” (with the working title “Why Did It Die?” and some lyrics not heard in the recorded version). All songs are from the Revolver album (1966), except for “The Word,” from Rubber Soul (1965). In the early 1970s, Northwestern University Libraries acquired the manuscripts Cage amassed, known collectively as the John Cage Notations Project Collection. Of the many unique materials in the collection, the Beatles manuscripts are exceptionally valuable and unusual. Northwestern, along with the British Library, is one of just two libraries worldwide that hold handwritten Beatles lyrics. Due to their value, the original manuscripts are only exhibited occasionally. High-resolution facsimiles are on permanent exhibit in Deering Library and can be viewed in Deering 208 any time the Library is open. Copyright restrictions prevent Northwestern from making full images of the manuscripts available online. For more information, see Hunter Davies’ book, The Beatles Lyrics: The Stories Behind the Music (2014), which includes images of and commentary on Northwestern’s Beatles manuscripts, plus many others. See Cage's Notations Collection for more",
  "timestamp": 1733796766.0925322
}