{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/collection-highlights/northwestern-history/university-songs-symbols.html",
  "title": "University Songs & Symbols: Libraries - Northwestern University",
  "content": "Jump to Northwestern's songs and symbols: Hail to Alma Mater We will sing thy praise forever All thy sons and daughters Pledge thee victory and honor Alma Mater Praise be thine May thy name forever shine Hail to purple Hail to white Hail to thee Northwestern See the sheet music Go U Northwestern! Break right through that line. With our colors flying, We will cheer you all the time, U Rah! Rah! Go!  U Northwestern! Fight for victory, Spread far the fame of our fair name, Go!  Northwestern win that game. (Whistle) (Yell)  Go!  Northwestern Go! (Whistle) (Yell)  Go!  Northwestern Go! Hit 'em hard! Hit 'em low! Go!  Northwestern Go! (Repeat chorus) See the sheet music Hail to Black? Hail to Gold? Not at Northwestern, you say. Not now, of course. Everyone knows that Northwestern’s colors are purple and white even if they don’t know the lyrics of the University’s Alma Mater. But it wasn’t always so. In fact it’s not so now. Northwestern only has one official color, royal purple. This has been the case since 1892, despite the fact that with the passage of time, tradition has firmly established white as a de facto if not de jure official color. Had it not been for the fact that black and gold had been adopted by other universities, the Norris Center Bookstore might well today be stocking beer mugs and other paraphernalia in those two auspicious colors. The decision to scrap black and gold as NU’s colors was made more than 100 years ago, in 1879. Why was it made? The original impetus for colleges and universities to adopt official colors evolved as a consequence of the flourishing of intercollegiate athletics during the decade immediately following the Civil War. Indeed it was only with the development of football as a major sport in the 1870s that students at Northwestern felt compelled to select a University color to distinguish themselves and their teams on the fields of play. It seems that in the fall of 1879, following the lead of many Eastern universities, a committee chose black and gold as NU’s official colors since its membership was unable to agree upon a single color. Shortly thereafter it was discovered that other schools had preempted those colors, and the Northwestern committee met again and selected purple and gold in their place. For the next 13 years Northwestern teams went forward under purple and gold banners until 1892, when another University committee reduced the official color to just royal purple, apparently in emulation of the custom adopted at various of the prestigious Eastern universities. Gold continued to be used in concert with purple on academic regalia, but sometime shortly after 1892 white became the University’s second (and unofficial) color, and it has been ever since. Those who have seen the fearsome Black Knights of the Hudson storm onto the field attired in their black and gold uniforms during the Annual Army-Navy football game have had a glimpse of what the scene might have looked like at Dyche Stadium on any Saturday afternoon this autumn had it not been for a momentous decision made by a committee of students over 100 years ago. Without their foresight we would not be singing those glorious words, “Hail to Purple! Hail to White! Hail to thee, Northwestern!” Adorning a myriad of University related or generated items ranging from beer mugs and window decals to letterheads and diplomas is the official University seal. This logo, considered by students and faculty at many other American colleges and universities to be one of the most aesthetically pleasing of its kind, is quite familiar to most members of the Northwestern University community, yet few are aware of either its genesis or its meaning. Even those who can readily visualize it concede that its origins have been obscured in the haze of antiquity. On June 26, 1856, only six years after Northwestern was founded and as its first year of holding classes had just come to a close, the University’s Board of Trustees adopted a design for a corporate seal that would be affixed to official University documents. This first seal closely resembled an incomplete version of the present one; it consisted of “an open book with rays of light surrounding,” enclosed by the words “Northwestern University, Evanston, Illinois.” This motif, similar to the University of Wisconsin’s well-known logo Numen Lumen (new light), quite obviously suggested the illuminating influence of the impartation of knowledge. In this form the seal remained in use for the next 34 years until 1890. On June 17 of that year, the Board of Trustees adopted as the official University motto the Latin phrase, “Quaecumque Sunt Vera” or in English “Whatsoever Things Are True,” which was derived from the New Testament Epistle of St. Paul to the Philippians, Chapter 4, Verse 8, in which Paul admonished his Christian followers in the Greek (Macedonian) city of Philippi: “Finally, brethren, whatsoever things are true, whatsoever things are honest, whatsoever things are just, whatsoever things are pure, whatsoever things are lovely, whatsoever things are of good report; if there be any virtue, and if there be any praise, think on these things.” Following the board’s adoption of the key words of Paul’s summary of the exemplary ethical and moral values as the University’s guiding motto, Daniel Bonbright, professor of Latin since 1856 who had also served as acting president, was assigned by the board to infuse the official seal with a more meaningful content by incorporating the motto in its design. Bonbright also decided to inscribe in Greek upon the pages of the seal’s open book the words “Ð lÒgoj pl»rhj c£ritoj kaˆ ¢lhqe…aj” “ho logos pleres charitos kai aletheias” (“The Word . . .full of grace and truth”) from the Gospel of St. John, Chapter 1, Verse 14: “And the Word was made flesh, and dwelt among us, and we beheld his glory, and the glory was of the only begotten of the Father, full of grace and truth.” In addition, Bonbright removed the words “Evanston, Illinois” from the seal and added the date 1851, which denoted the year that Northwestern received its charter from the Illinois legislature. Bonbright’s revised design was approved by the board on December 5, 1890, and became effective on New Year’s Day of 1891. Since then, it has served faithfully as the graphic symbol of Northwestern’s commitment to the educational, ethical and moral values embodied in its design.",
  "timestamp": 1733797113.885099
}