{
  "url": "https://www.library.northwestern.edu/faculty-staff/reserve/reserve-information-for-faculty.html",
  "title": "Reserve Information for Faculty: Libraries - Northwestern University",
  "content": "Course Reserve allows instructors to set aside books and articles for class use in the library, or to make articles, streaming media or book excerpts available through Canvas. Reserve items can be physical or electronic. Physical reserve materials are held at and checked out from the University Library Circulation Desk or Mudd Library Circulation Desk. Electronic reserve items are accessed through your course site in Canvas. Books from circulating collections from Northwestern Libraries can be placed on physical Course Reserve. Books and multimedia materials not owned by Northwestern Libraries can be ordered for purchase by Reserve staff. Book excerpts, newspaper articles, and streaming video and audio can be placed on electronic Reserve. E-journal and database articles that are already available within our collection should be linked directly from NUSearch using the Permalink option and not submitted via course reserves. See guidelines for providing access to copyright-protected materials. Items obtained through Interlibrary loan, non-circulating items from the McCormick Library, coursepacks and personal copies cannot be placed on physical reserve. Certain publishers and databases limit access over electronic Reserve. We cannot place the following on electronic Reserve: Scanned excerpts are limited to a chapter or two of any single book, but no more than 15% of an entire book. For instructors who would like to use an item that does not meet the above guidelines, library staff will evaluate the request's feasibility and reply to the request. See more on copyright and licensing limitations on Rights, Permissions and Reproductions. Help is also available via email at e-reserve@northwestern.edu or by calling 847-491-7681. For streaming media questions, call 847-467-1985. Request materials for your course through your Canvas course site: Our standard turnaround time for materials that the library already owns and is available in the library is 5 days. Please note that requests may take longer to complete during periods of high volume and is predicated on the availability of the item. Do submit requests as early as possible. If the library does not already have your item in our collection, Reserve staff will purchase a copy. Electronic Course Reserve materials include PDFs of book chapters and articles, links to articles, streaming audio and streaming video. See a video tutorial for requesting materials. To request materials for your course through your Canvas course site: If the libraries already have access to an article you’d like your class to read, you can link to it in Canvas using a database or NUsearch permalink. Use NUsearch to search the article title. If it’s available, find the permalink to copy and add it as a module within your Canvas course. To find the permalink for materials for your course:",
  "timestamp": 1733796894.0206282
}