{
  "url": "https://www.library.northwestern.edu/libraries-collections/herskovits-library/exhibits.html",
  "title": "Exhibits: Libraries - Northwestern University",
  "content": "Throughout 2018, Herskovits Library exhibits focus on different aspects of the 70 years of the Program of African Studies here at Northwestern. Since 1948, PAS has brought together scholars, activists, and artists from all over the world, making Northwestern University the international hub for research on Africa and the Diaspora. In this exhibition, we highlight PAS graduates from Africa who have returned to Africa at some point in their life, as well as their publications. Coinciding with the American Library Association Conference in Chicago in June, we highlight libraries throughout the continent of Africa in all of their variety. From the fabled Library of Alexandria (past and present) to the donkey-drawn mobile libraries of Zimbabwe, from Muslim research institutions in Algeria to conference proceedings from Lesotho, the Herskovits offers resources on a broad range of library-related topics. This exhibit showcases some of the textual culture displayed within the Islamic manuscripts held at the Herskovits Library. Our collection unites an impressive concentration of works by West African authors, mainly from the 19th and 20th centuries, making it an unique and valuable resource for scholars interested in the production of Islamic knowledge in West Africa. It is especially strong in works from northern Nigeria (Kano in particular) but also includes items from Ghana, Senegal and Mali. This exhibit illustrates aspects of the history, culture and religion of African descendants in the Americas and the Caribbean. Here the viewer can see a few of the diverse materials archived by the Herskovits collection related to the subject, such as monographs, academic journals, photography books, sound recordings, historical documents, biographies and many others. This exhibit highlights comics and cartoon art from and about Africa. The continent has long held a fascination for foreign cartoonists, including illustrations in century-old French humor magazines; the Belgian cartoonist Hergé’s controversial Tintin in the Congo (1931); and even the Marvel Comics character The Black Panther (1966, and soon to star in a motion picture). Yet cartoon art also plays an increasing role in how African artists view and define their own culture, from Senegalese cartoonist T. T. Fons’ wildly popular character Goorgoorlou, to a Nigerian multi-volume comic-book biography of Barack Obama, to the testimony-bearing comics narratives produced by Diaspora artists. Africa is a mosaic of different environments – windswept deserts to snowy mountains, flooded swamps to vast savannahs, and everything in between. The four environments highlighted here were chosen to represent a wide array of critical environments in Africa that are unique and continue to face significant problems. Take a journey through the rainforests of eastern Democratic Republic of Congo, the Namib desert region in Namibia, the Okavango Delta in northern Botswana, and the brilliant coral reefs in the Seychelles, and experience some of nature’s hidden gems. Black literary writers with African roots (though some grew up elsewhere), mostly young cosmopolitans who write in English, are making a splash in the book world, especially in the United States. They are on best-seller lists, garner high profile reviews and win major awards, in America and in Britain. This exhibit, which features materials drawn from the  Melville J. Herskovits Library of African Studies, pays homage to these writers and other important voices in contemporary African literature. In the wake of the Ebola outbreak in West Africa, this exhibit provides information about Ebola in a larger context by examining the cultural impact of various types of viruses and the ways in which people have, over time, responded to them. We have two cases of items to examine, books to check out, a slideshow and a guide with further information and songs created in response to the Ebola outbreak. Nigeria is the most populous country in Africa and has the largest economy. Why has its governmental system become identified with corruption and dysfunctionality? Why has the military been unable to defeat the jihadist insurgency, Boko Haram? Why has militant Islam overwhelmed Nigeria’s moderate Muslim traditions? Why has the great hope for a peaceful, prosperous, and democratic federation not been realized? Finally, what are the prospects for a diminution of the Nigerian predicament and the restoration of inter-religious concord? In 1994, South Africa held its first democratic elections, choosing Nelson Mandela, a former prisoner under the oppressive Apartheid regime, as its new president. This landmark achievement was not won without struggle. We should not forget that protest and civil engagement can make a difference in the world. Twenty years on, as this young democracy returns to the polls, we reflect on how far this nation has come while imagining future possibilities. The exhibit showcases diverse media currently being used in Nigeria to raise consciousness about HIV/AIDS, with examples that were collected by Patricia Ogedengbe during her recent stint there as a Fulbright Scholar.  Ogedengbe, who is a librarian at the Melville J. Herskovits Library of African Studies, says, \"There are more than 250 different languages and dialects spoken in Nigeria, and not everyone can read and write in English.  So communications are often non-traditional there, through visual means like posters or tee-shirts, or the plots of dramatic television shows.\" This exhibit showcases rare materials commemorating the bicentennial of the end of England's trade of slaves from Africa. The display pays homage to the historical event, complements the \"Fifty Years of African Independence\" exhibit and recognizes the success of the Art History Dept.'s recent conference, \"Out of Sight: New World Slavery and the Visual Imagination.\" A collection of images and bibliographic materials concerning fashion in Africa, both contemporary and historical. The poster collection of the Melville J. Herskovits Library of African Studies, Northwestern University, documents the efforts of African governments and private organizations to promote public awareness regarding HIV & AIDS. Posters drawn from the collection were published in Botswana, Côte d’Ivoire, Lesotho, Malawi, Mozambique, Nigeria, Senegal, South Africa, Swaziland, Tanzania, Uganda, Zambia, and Zimbabwe. This virtual exhibit highlights the numerous materials used to inform some African communities about HIV/AIDS with the hope of slowing infection rates, shattering myths and misconceptions about the disease, while teaching people to live with and support HIV positive individuals. Most of the materials included were originally displayed between November 2002 and January 2003 at the Northwestern University Library. The exhibit entitled \"Celebrating World AIDS Day: HIV/AIDS in Africa\" included books, journals, pamphlets, videos, posters, music, dolls, quilts, embroideries and other crafts presenting educational messages about HIV/AIDS to some communities in Africa. The Winterton Collection includes about 7,610 photographs organized in 76 separate albums, scrapbooks or loose collections. The photographs depict life, primarily in East Africa, between about 1860 and 1960. Assembled by the British collector Humphrey Winterton over about 30 years, the collection depicts the breadth of African experience; documents African life; European life in Africa in all its manifestations; and the African landscape, in particular as it changed over time. Included are photographs showing the building of East Africa’s railways, the growth of its urban centers and the development of European colonial administration. In 1948, Melville J. Herskovits, Professor of Anthropology, established the Program of African Studies at Northwestern. Integral to his vision for African studies at Northwestern was the most comprehensive library for the study of Africa anywhere in existence. The Africana collection at Northwestern University Library, formally established 50 years ago, and named after Melville Herskovits in 1970, celebrates not only the 50th anniversary of its opening but also the 50th anniversary of the first meeting of African studies librarians in the United States in the Deering Library, March 11 & 12, 1955.",
  "timestamp": 1733796452.4617038
}