{
  "url": "http://www.library.northwestern.edu/about/administration/policies/file-format-recommendations.html",
  "title": "File Format Recommendations: Libraries - Northwestern University",
  "content": "The Northwestern University Libraries recommends certain formats be used when planning for long-term preservation of digital content and for possible submission to the digital repository. Generally, the applications used to open files and their specifications become harder to find over time, and some formats will be difficult or impossible to read in the future. The file formats with the best chance of survival have open specifications, are high quality, and are in relatively wide use. Ensuring these formats can be accessed or read in the future is key to their long-term preservation. When considering the long term viability of your digital files, please use the recommended file formats and make sure the format is an uncompressed version, highest quality compressed version, or the final production version. Unfortunately, it's not possible to provide a single list of file formats that are appropriate for all use cases, but this list is a good starting point. Also, please exercise caution when using proprietary formats and digital rights management (DRM) software that may make viewing content difficult or impossible to access in the future. If you have any questions, please contact the Library at library@northwestern.edu. Your question will get routed to the appropriate staff who manage the digital repository. Simplified Guidelines/File format recommendations: - AIFF (PCM) (.aif, .aiff) - WAV (PCM) (.wav) - Broadcast WAV (PCM) (.wav, .bwav) For music: 24 bit, 96 kHz or better For speech: 16 bit, 44.1 kHz or better For music: - AIFF (PCM) (.aif, .aiff) - WAV (PCM) (.wav) - Free Lossless Audio Codec (.flac) - Apple Lossless (.m4a) For speech: - Advance Audio Coding (.mp4, .m4a, *.aac) - MP3 (MPEG-1/2, Layer 3) (.mp3) - MP2 (MPEG-1 Audio Layer II) (.mp2) 128 kbps (mono), 256 kbps (stereo) or better, 44.1 kHz, variable bit rate settings off if possible. AIFF or WAV preferable. - AVI (uncompressed, motion JPEG) (.avi) - QuickTime Movie (uncompressed, motion JPEG) (.mov) Recommendation: Maintain original resolution of video and audio Standard Definition recommendations: 720x486 pixels, 2.5Mbits/second for MPEG-4; 5Mbit/second for MPEG-2. Audio 448kbit/sec, 16 bit, 44.1kHz. High Definition recommendations: 1920x1080 pixels, 8 to 15 Mbit/s. Audio 16 bit, 44.1kHz - 3GP (.3gp, .mp4) - Flash Video (.flv, .f4v) - MPEG-4 ASP (Divx, Xvid) (.avi) - MPEG-4 H.264 (DRM protected) (.m4v, .mp4) - RealNetworks 'Real Video' (.rv) - Windows Media Video (.wmv) Formats to be determined: ebook, database, email, address book, compression formats (.zip, .rar), applications (.exe, .app), and many others. Last reviewed: August 2023",
  "timestamp": 1733797586.7760618
}