{
  "url": "http://www.library.northwestern.edu/libraries-collections/deering-library/artwork/index.html",
  "title": "Reading Room Artwork: Libraries - Northwestern University",
  "content": "Deering Library's reading rooms are feature artwork, including portraits, secular stained glass window and various busts and statues. The Martin Reading Room holds six portraits of the family of Charles Deering, for whom the Deering Library is named, as well as one of French composer Erik Satie. They are described below, listed in the order that they are hung (from north to south). Roger Deering (1884-1936) was the son of Charles Deering. A noted philanthropist, Roger Deering left over $7 million in an unrestricted gift to Northwestern University upon his death in 1936. The artist Kenyon Cox (1856-1919) was a painter, illustrator and writer from Warren, Ohio. He studied in Paris at l'Ecole des Beaux-Arts from 1877 until 1882 and exhibited at the Salon between 1879 and 1882. He illustrated books and magazines, wrote occasional art criticism and taught at the Art Students League in New York from 1884 until 1909. A skilled academic draughtsman and a strong colorist, Cox was skeptical of Impressionism and an outspoken opponent of modernism. William Deering (1826-1913), the father of Charles Deering, founded the Deering Harvester and pioneered the development of a harvesting machine with an automatic binder. He was a generous benefactor to several institutions, notably Northwestern University and the Garrett-Evangelical Theological Seminary. The Swedish artist Anders Zorn (1860-1920) was a close friend of Charles Deering, and gave Deering the use of his studio in Paris in 1893. Zorn was an internationally recognized painter, etcher, and sculptor who maintained studios in Paris and London. His skill with portraiture in particular secured a wide range of patrons throughout the world. The Wayman Adams portrait of Roger Deering was a gift of his mother, Marion Whipple Deering to the library, and has been on permanent display since 1938. Wayman Adams (1883-1959) was born in Muncie, Indiana and studied portraiture in Italy and Spain. He is known chiefly for his portraits, which show considerable influences of John Singer Sargent, another Charles Deering associate. Marion Whipple Deering (1857-1943) was the wife of Charles Deering. The couple married in 1883 and had three children: Roger, Marion and Barbara. This portrait of Mrs. Deering was donated to the University by her family in 1939. Charles Deering (1852-1927) was the Northwestern University trustee and benefactor. This portrait is a copy by Paul Trebilcock of an earlier portrait by Anders Zorn. Paul Trebilcock (1902-1981) studied at the Art Institute of Chicago as well as in Europe. James Deering (1859-1925), the brother of Charles Deering, joined Charles in the family business and assisted in directing the International Harvester Company. A discerning art collector, James is best known as the builder of Vizcaya, his winter estate near Miami, Florida, which is acclaimed for its evocation of Italian architectural styles from the fifteenth to the nineteenth centuries. This 1932 painting by Trebilcock is a copy of an earlier portrait by Anders Zorn, and was bequeathed to Northwestern University in 1933 by Mrs. Chauncey McCormick [Marion Deering], daughter of Charles Deering and niece of James. Catalan painter Ramón Casas (1866-1932) inhabited the late nineteenth- and early twentieth century modern art scenes in Barcelona and Paris along with contemporaries such as John Singer Sargent, Henri de Toulouse-Lautrec, and Pablo Picasso. He specialized in portraits of intellectuals and artists, charcoal drawings, and commercial posters. In his 1891 painting El Bohemio, Poet of Montmartre, the French avant-garde composer Erik Satie stands before the famous Moulin de la Galette, a popular restaurant and dance hall in Montmartre. This portrait was acquired by Charles Deering when Deering studied painting in Paris in the early 1890s. Deering befriended Casas, and Casas visited the United States twice as his guest, in 1908 and in 1924. After Deering's death, the Satie portrait was inherited by his daughter, Mrs. Chauncey McCormick, and she bequeathed the painting to Northwestern University Library in 1956. The painting has lately traveled around the world, displayed several in major museum exhibitions. The Deering Library's 68 painted window medallions were created by G. Owen Bonawit (1891-1971), a master of secular stained glass from New York City. The medallions represent scenes and figures from literature, mythology, religion and history. Library staff helped to select subjects and sent illustrations to Bonawit for translation into the designs. Nineteen of these are located in the Art Library's Eloise W. Martin Reading Room; there are also four are in the Architecture Reading Room and others in the other libraries and rooms in Deering Library. Among the busts and statues around the perimeter of the Martin Reading Room, looking from left to right (south to north) as you enter the room are:",
  "timestamp": 1733797283.806194
}