{
  "url": "http://www.library.northwestern.edu/about/news/library-news/2024/northwestern-students-faculty-and-staff-can-now-directly-access-the-new-york-times-online1.html",
  "title": "Northwestern students, faculty and staff can now directly access the New York Times online : Libraries - Northwestern University",
  "content": "Northwestern Libraries now provide current faculty, students and staff direct access to The New York Times (NYT), including News, Audio, Games, Cooking, Wirecutter, and The Athletic. The subscription includes access to features directly through nytimes.com and through the NYT mobile apps. Activation of the subscription requires initial registration with a Northwestern email address. Registration can be completed with an internet-connected device from any location. Existing paid NYT subscribers must cancel their paid subscription before authenticating via the Libraries’ subscription if a Northwestern email address was used for the personal subscription. To begin: Once registered, Northwestern users will have access to the same benefits as a paid subscriber, including access to mobile apps, the option to follow newsletters and topics, and the archive dating back to 1851. “It is a fantastic addition to our growing collection of news sources, which includes current newspapers, databases, and historical newspapers,” said Elsa Alvaro, Associate University Librarian for Collections and Access. Similar subscriptions provided by the Northwestern Libraries include The Wall Street Journal and access to thousands of online newspapers and magazines in their original format via PressReader. Along with access to current publications, “the library’s access to online historical newspaper content is the best in the Chicago area,” explained Geoff Morse, Head of Distinctive Collections and Research Services for the Libraries. Readex’s database America’s Historical Newspapers includes titles from all 50 states and dates back to the 17th century in coverage. ProQuest Historical Newspapers includes historical content of major U.S. dailies dating back to 1851. ProQuest also provides us with some of the most important and significant Black newspapers throughout the 20th century including the Chicago Defender and the Pittsburgh Courier. The newspaper coverage from Readex, ProQuest, and other providers is not limited to North America. A curated list of major newspapers can be found on the News Sources research guide.",
  "timestamp": 1733797423.0591633
}