{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2023/libraries-refocus-open-access-support-for-greater-impact.html",
  "title": "Libraries refocus Open Access support for greater impact: Libraries - Northwestern University",
  "content": "Beginning in September 2023, Northwestern Libraries will shift support for Open Access publishing to institutional-level initiatives. The Libraries have been supporting Open Access (OA) publishing since 2014 to cover article processing charges (APCs) for individual authors. The scholarly publishing landscape has evolved over the past decade resulting in several initiatives that advance OA at the collective level. The Libraries currently support several of these initiatives for Northwestern and participate in additional initiatives as a partner in the Big Ten Academic Alliance. In the current scholarly publishing context, these initiatives offer the greatest impact for advancing Open Access publishing. As a result of this shift in focus, the Libraries will be sunsetting the Open Access Fund, which covers article processing charges (APCs) for individual articles, this summer. We will instead be directing Open Access investment to the collective initiatives that can have a broader and systematic impact. The final day to apply for individual APCs through the Open Access Fund is July 31, 2023. “Building an open scholarly ecosystem that is more equitable and accelerates access to research requires thinking bigger and pursuing opportunities at an institutional level. We are engaging with our partners to develop an Open Agenda that can scale,” says Xuemao Wang, Dean of Libraries. An important step in this shift can already be seen in the BTAA’s Open Access publishing agreement with Wiley. The landmark open publishing agreement with Wiley allows scholars from all Big Ten schools to publish articles as open access in any journal under the Wiley umbrella at no charge. In addition to Wiley, the BTAA participates in IOP ScienceXtra, Microbiology Society journals, MIT Press Direct to Open. Northwestern directly supports additional initiatives including arXiv.org, Knowledge Unlatched, and SCOAP3, among others. For questions about Open Access initiatives, please contact John Blosser, Head of Acquisitions, at jblosser@northwestern.edu.",
  "timestamp": 1733797125.542804
}