{
  "url": "https://www.library.northwestern.edu/footnotes/issues/fall-2024/merry-garry-marshall.html",
  "title": "Merry Garry: Footnotes - Northwestern University",
  "content": "Fall exhibition showcases archive of prolific director and irrepressible joke-teller Director Garry Marshall ’56 had been depositing tantalizing parcels of his personal papers with University Archives for years. One notable highlight: a pencil-drawn storyboard for his biggest film, Pretty Woman. Marshall died in 2016; his widow, Barbara, has since made the donation complete, giving the bulk of her husband’s voluminous career archive to Northwestern. Now fully processed and ready for research, the Garry Marshall Papers are the subject of a fall exhibition showcasing precisely how prolific the creator was. Garry Marshall: The Happy Days of Northwestern’s Favorite Director illustrates Marshall’s creative process and the far-reaching influence of his creations. Many of the 88 archival boxes in the collection contain page after page of typed jokes and drafts of routines that Marshall wrote with partners for performers like JFK impersonator Vaughn Meader and frequent award show and late-night guest host Joey Bishop. “It’s nice to take over for Johnny [Carson] again,” runs one script for Bishop. “The Tonight Show is becoming like a second home for me. Now if I could just find a first home, I’d be a hit.” The documents illustrate jokes being workshopped, scribbled over, edited—and occasionally marked with a check, apparently indicating the client’s approval. The papers also include the scripts Marshall wrote, directed, and produced, from a Brady Bunch special to the 2001 hit movie The Princess Diaries. A series of drafts show the evolution of Pretty Woman; elsewhere, researchers can find scripts he wrote for plays like The Roast (1980) and Wrong Turn at Lungfish (1990). Marshall’s influence on American entertainment is evident in the number of pop culture artifacts from shows he created, such as a lunch box from the 1970s sitcom Happy Days and a Mork & Mindy card game from the 1978 spin-off starring Robin Williams. At the entrance of University Library, the exhibition runs through December 2024. An adaptation of some of the exhibit materials can be found below. Garry Marshall, prolific creator, funny man, and sports fan, had a hand in some of the most memorable media across 50 years of American culture. Depending on your generation, a Marshall character probably provided a signature cultural memory: Younger fans grew up watching Mia Thermopolis blossom in The Princess Diaries (2001), while older viewers remember Fonzie thumping jukeboxes in Happy Days (1974-1984). In between, Pretty Woman (1990) launched Julia Roberts’ career as a leading actor.  By the time he graduated from Northwestern in 1956, Marshall was already a budding creator — he covered sports for The Daily Northwestern, played drums for various pickup bands, and performed in the Waa-Mu show. Then over the course of his wildly successful career, he proved to be a loyal son of Northwestern (and a parent and grandparent of next-generation Wildcats). His gifts enabled the naming of the Marjorie Ward Marshall Dance Center after his mother, a dance instructor, and the Barbara and Garry Marshall Studio Wing in John J. Louis Hall. He served as a life trustee, and shortly before his death in 2016, he began the process of depositing his career papers in University Archives. This exhibition is drawn from his archive, giving future generations the chance to gaze into the creation process as imagined by one of Hollywood’s most beloved comic creators. Born in the Bronx on Nov. 13, 1924, Marshall was the oldest of three children — his sister Penny Marshall would go on to be an accomplished actress and filmmaker in her own right. (Once, Garry, Penny and their sister Ronny, class of ’58, all appeared as siblings in The Odd Couple.) After graduating from Northwestern in 1956 with a bachelor’s degree from the Medill School of Journalism, he served two years in the U.S. Army, stationed in Korea. His never-ending drive to create spurred him to write for Stars and Stripes, the U.S. military newspaper of record, and serving as production chief for the Armed Forces Korean Network. Marshall married Barbara Sue Wells in 1963 and together they had three children, all of whom attended Northwestern: Lori ’86 ’88 MS, Kathleen ’90, and Scott ’91. Two of their grandchildren have continued the legacy of Marshall family Wildcats.   Following his military service, Marshall worked as a stand-up comic and was soon writing jokes for comedians such as Joey Bishop and John F. Kennedy impersonator Vaughn Meader. In 1960, he was hired by Jack Paar to write jokes for The Tonight Show. Eventually Marshall partnered with writer Jerry Belson, and the pair wrote scripts for several notable TV comedy favorites, including The Dick Van Dyke Show. In 1970, the pair struck gold by adapting Neil Simon’s play, The Odd Couple, into a successful, multi-season television show starring Northwestern alumnus Tony Randall and Jack Klugman.  The 70s were a period of remarkable success for Marshall, beginning with the launch of his most well-known situation comedy series, Happy Days (1974-1984). Roughly based on Marshall’s boyhood experiences growing up in the Bronx, Happy Days was an immediate success and generated several successful spinoff productions, including Laverne & Shirley (1976-1983), and Mork & Mindy (1978-1982), which introduced the world to Robin Williams as the space-traveling Mork.  Arnold’s Drive-In on Happy Days was a hangout for its cast of characters, all Milwaukee high school kids  of the 1950s. Among the college pennants bedecking the set was this custom banner — though the prop crew didn’t quite nail Northwestern purple. This silly game prompts players to make nonsense sounds as they play cards. When someone plays a  card with Mork’s signature greeting, “Na-no na-no,” all players must seize one of the Styrofoam eggs.  The player that comes up empty-handed is penalized. As a show in the 1970s about American life in the 1950s, Happy Days has always spawned feelings of nostalgia — such as this collectible lunchbox from the 1990s. In the 1980s, Marshall focused on directing, producing, and writing feature films. His directorial debut was Young Doctors in Love (1982), a comedy that parodied hospital soap operas. He went on to direct a number of well received comedy films in the 1980s such as The Flamingo Kid (1984), starring Matthew Dillon in a lighthearted coming-of-age comedy and Overboard (1987), starring Goldie Hawn and Kurt Russell. In a departure from his usual comedic focus, Marshall directed Beaches (1988), a terminal illness drama starring Bette Midler and Barbara Hershey.  In 1990, Marshall directed the blockbuster film Pretty Woman, commonly credited with making Julia Roberts a major Hollywood star. Pretty Woman storyboard, undated: One of the crown jewels of the archive is a small set of storyboards — drawings created during the filming process to envision camera angles for each shot.  Marshall continued to direct throughout the 1990s, with films such as Frankie & Johnny (1991) and Runaway Bride (1999), which reunited his Pretty Woman stars. In 2001, Marshall directed the family comedy, The Princess Diaries, which also launched Anne Hathaway to her own blockbuster career. His final film, Mother’s Day, starring Jennifer Aniston, Roberts again, and Jason Sudeikis, opened in April in 2016. Marshall died the following July.  Perhaps Marshallâs most widely known and successful work is 1990âs Pretty Woman, which he directed. Starring Julia Roberts and Richard Gere, the movie is one of the highest-grossing romantic comedies of all time. All scripts go through an editing process during development, and Marshallâs archive includes several examples for study. The early draft of Pretty Woman, written by J.F. Lawton, included a wordier version of one its most famous scenes: Robertsâ character, Vivian, returns to a boutique that refused to serve her, brandishing multiple purchases she made elsewhere. Marshall directed 2001’s The Princess Diaries, another colossal hit. Like Pretty Woman, it imagines a woman transforming herself to move from obscurity to high society. In another parallel to Pretty Woman, it heralded the breakout role of its young female star, in this case Anne Hathaway.  Marshallâs notes, written in the back of shooting script pages, noting things about specific shots during filming. The Garry Marshall Papers span 88 boxes and contain more scripts, notes, memorabilia, promotional items and Hollywood ephemera. The collection is available to browse at University Archives.",
  "timestamp": 1733797855.2415924
}