{
  "url": "http://www.library.northwestern.edu/visit/technology/internet-access.html",
  "title": "Internet Access & Connectivity: Libraries - Northwestern University",
  "content": "Find information on connecting to the Internet from the libraries as well as connecting to library electronic resources from on and off campus. Northwestern's wireless network provides secure, mobile Internet access from hundreds of access points on both campuses including the University Library buildings. See below for instructions on connecting through a wireless connection. For users with an active netID: Choose eduroam and use your NetID@northwestern.edu and password to connect a computer, smartphone, or tablet. This secure network does not need VPN and requires a valid NetID to access. The eduroam network will also allow Northwestern students, staff, and faculty to use their NetID credentials to access wireless network services while visiting eduroam-participating institutions. To learn more visit the Northwestern IT Knowledge Base. For guests and visitors with a temporary netID: If you are a visiting guest, choose the Guest-Northwestern network when visiting the University for short- term access to the wireless network to perform general Internet activities. This network does not have the same level of security as the Northwestern Wireless Network and should not be used to transmit sensitive information. To learn more visit the Northwestern IT Knowledge Base. The license agreements for most of the Library's electronic resources, such as electronic journals and databases,  allow off-campus access and campus wireless access only to Northwestern University students, faculty and staff with valid NetIDs. When off-campus, you should connect to GlobalProtect VPN to access electronic resources. See the Northwestern IT KnowledgeBase instructions for more information on setting up VPN. If you have problems accessing electronic resources, please contact the Library by e-mailing library@northwestern.edu or by calling the University Library reference desk at 847-491-7658.",
  "timestamp": 1733797267.9651802
}