{
  "url": "http://www.library.northwestern.edu/libraries-collections/deering-library/index.html",
  "title": "Charles Deering Memorial Library: Libraries - Northwestern University",
  "content": "The Charles Deering Memorial Library is a campus architectural landmark designed by James Gamble Rogers and modeled after King's College Chapel in Cambridge, England. Opened in 1933, Deering Library served as the library's main library until 1970 and now houses several distinctive collections. The library was named for Charles H. Deering, a Northwestern benefactor and a patron to the arts.   If you have any further questions or concerns, please reach out to library@northwestern.edu . When will Deering Library re-open? Deering Library is expected to re-open in September, 2025. What part of the library is closed? All of Deering Library is closed, including the west-facing Deering Library entrance and the doors to Deering Level 1 and Deering Level 3 which connect to University Library. University Library will remain open during regular business hours. The materials from the book drop in front of Deering Library will be retrieved. How do I request items from the circulating collections in Deering Library? Items can be requested for pickup at the main Circulation Desk with a valid NetID and password from the library catalog NUsearch. Follow these steps: How long will requests take to arrive? Standard turnaround time is 1 day for requests received Sunday through Thursday. You will receive an email when your item is available for pickup. How do unaffiliated guests request items from the circulating collections? Guests can email circulation@northwestern.edu or call 847-491-7658 to arrange for an item to be held on a courtesy hold at the Circulation Desk. You may use the item within the library. Are there weekend retrievals of collections from Deering Library? No, retrievals of books from Deering collections are limited to weekdays. How do I access special collections or archival materials? The McCormick Library of Special Collections and University Archives is operating from the lower level of University Library during the renovation. You may make an appointment to use McCormick collections in Room B183. Request collections for use with the McCormick Library Request System. You will receive an email to arrange an appointment when the item is available. For more detailed step-by-step instructions, see Plan A Visit. Can I have a walk-in appointment with McCormick? No. In order to ensure the items you need are on-site and available for use, please arrange an appointment before arriving. Request items with the McCormick Library Request System. You will receive an email to arrange an appointment when the item is available. How do I arrange a class visit for research or instruction with the McCormick Library? Instructors should schedule class visits at least three weeks in advance by completing the Instruction Request form. To learn more about class visits and using special collections and archival material in your class contact us directly at specialcollections@northwestern.edu. What are the hours of the temporary McCormick Reading Room? The standard hours remain the same: Monday through Friday, 9am to 4:30pm. Complete hours, including holiday hours, are available at libraries.nu/hours. Are there alternative event/meeting spaces like Deering 208? Please use the library event space request form at libraries.nu/libraryspace at least five days in advance of your event. Library staff will be in touch with options. Where are the computers and printers for guest use located? Guests with a temporary NetID may use any computer and printer in the Information Commons on Level 1 of University Library. Where are overhead scanners located? Overhead BookEye scanners are available in Periodicals on Level 1 of University Library and in the music collection on Level 3 of University Library. Where are the music Macs previously in Deering 101? The music Macs are in Periodicals on Level 1 of University Library. Where are alternative study spaces during the Deering closure? Quiet study spaces are available in University Library in Periodicals on Level 1, and in the Level 3 and 4 towers. Collaborative study spaces are available in University Library in 1South and the Information Commons on Level 1, and in 2North on Level 2. Mudd Library is open at all hours, 24/7, to those with an active WildCard. Reservable study spaces are available in Mudd and University Libraries through the reservation calendar. Will there be noise from construction? There may be intermittent noise from construction in rooms close to Deering Library. Disposable ear plugs are available at the Information Commons desk. What is the scope of this renovation? The first phase of the renovation addresses critical public-facing infrastructure, including the installation of a new elevator and renovated restrooms. The second phase will renovate select prominent public spaces: Deering 208, Level 3 lobby, and Eloise W. Martin Reading Room. How will this affect Deering Library collections moving forward? We are restoring the Eloise W. Martin Reading room to its original furnishings and intent. Some portion of the Art collection previously available in the reading room has moved to the Oak Grove Library Center. Collections in Oak Grove can be requested the same way as any other circulating collection. The Asian Languages collection will remain in Deering 213. Where can I see updates on the project? We will be periodically providing updates on our blog and will link to those entries on this page as they are published.",
  "timestamp": 1733796936.9370103
}