{
  "url": "http://www.library.northwestern.edu/about/news/library-news/2024/enhance-learning-with-sage-campus-40-self-paced-courses-for-research-and-data-skills.html",
  "title": "Enhance learning with Sage Campus: 40 self-paced courses for research and data skills: Libraries - Northwestern University",
  "content": "Northwestern Libraries now provides access to Sage Campus,* a suite of online courses focused on research and data literacy skills. Sage Campus provides an accessible and flexible option to grow critical academic and research skills with 40 self-paced online mini-courses designed to supplement your existing coursework. Sage Campus offers a unique blend of self-paced and instructor-led online courses packed with engaging content, interactive activities, and formative assessments. Unlike traditional training products that heavily rely on videos, Sage Campus courses are designed with a combination of reading, activities, videos, and short comprehension checks to make learning more interactive and dynamic. The platform offers more than 280 hours of structured learning across 5 categories: Sample courses include:  These courses cater to all levels of learners, from beginners to advanced researchers. Most courses are under five hours, making them easily accessible even for those with busy schedules. Unlike other platforms that primarily use video, Sage Campus incorporates a range of learning materials, including activities and short quizzes, making it easier to absorb and apply the information you learn. This blended approach caters to different learning styles and helps students retain critical skills. Faculty members can easily assign courses to students, either in whole or in part, directly through the Sage Campus platform. Instructors can track student progress throughout the course, though it doesn’t integrate with the grade book — courses are marked with pass or no-pass only within Sage Campus. Alternatively, students can enroll independently to access these courses at their own pace. To get started, simply register using your Northwestern email, and once registered, you can access the platform from anywhere. When you first register, you’ll be signed up as a learner, and from there, faculty members can request to assign courses to students, while students can freely explore at their own pace. Reach out to your subject librarian if you need guidance on incorporating Sage Campus into your courses. For any questions about registration or access, contact the Northwestern Library at library@northwestern.edu. *Note: Initial access requires registration with your Northwestern email address. Registered users can access from anywhere at: https://classroom.sagepub.com",
  "timestamp": 1733797420.8762865
}