{
  "url": "https://www.library.northwestern.edu/about/administration/advisory-boards/index.html",
  "title": "Advisory Committees and Boards: Libraries - Northwestern University",
  "content": "The Libraries rely on boards and committees to advise on decisions regarding library policies, and to advocate for the Libraries within the Northwestern community. The Faculty Advisory Committee provides advice and guidance to the Dean of Libraries on policy matters, initiatives, collections, and services pertaining to Northwestern Libraries. The Committee provides a formal line of communication between faculty and the Libraries. The Committee meet with the Dean of Libraries at least twice per academic year. Meetings are planned and led by the Chair, with input on agenda from the Dean of Libraries, other committee members, and any member of the faculty and Northwestern community. The Chair of the Faculty Advisory Committee is appointed to a three-year term by the Provost, in consultation with the Dean of Libraries and other faculty as appropriate. Committee members are appointed to two-year terms by the Dean of Libraries in consultation with the Chair. Nominations for either Chair or committee membership are welcome from any member of the Northwestern community. All terms may be renewed. Faculty are not appointed to represent designated schools or disciplines, but the committee aims to include breadth and balance across areas of research and teaching. Membership will include one representative appointed by the Faculty Senate plus 6-8 other members. The Dean of Libraries and Deputy University Librarian serve as ex-officio members. Other librarians, staff, and administration of the Libraries may be invited to participate as needed. Luis Amaral, Erastus Otis Haven Professor, McCormick School of Engineering, chemical and biological engineering Ryan Dohoney, Associate Professor, Bienen School of Music Carola Frydman, Harold L. Stuart Professor of Finance, Kellogg School of Management, finance Laura Hein, chair, Harold H. and Virginia Anderson Professor of History, Weinberg College of Arts and Sciences, history Elizabeth Lenaghan, Associate Professor, Weinberg College of Arts and Sciences, Cook Family Writing Program Director Mimi White, Professor, School of Communication, radio/television/film The Student Advisory Committee provides a formal line of communication between students and the Libraries. The Committee gives students an active voice in shaping library matters, including services, spaces, programs, and collections. The Committee meets at least twice per academic year. The Committee is charged with advising the Dean of Libraries on all aspects of the Libraries and maintaining effective communication between the student community and the library administration and staff. Specific functions may include: The committee consists of approximately 10 students, with a combination of undergraduate and graduate students representing a diversity of voices, experiences, and areas of study. Membership will be for one year, renewable up to a maximum of two years. Nominations for student advisors are accepted on a rolling basis through the Student Advisory Committee Nominations Form. To contact the Student Advisory Committee with questions about library services, membership, or meetings, email Steve Adams smadams@northwestern.edu or Jason Kruse at jkruse@northwestern.edu. The Northwestern University Libraries’ Board of Governors mission is to serve as an advocate for the Libraries within the University and in the community at large, to assist in identifying and securing philanthropic resources for the Libraries, and to advise the Dean of Libraries on relevant issues that are of concern to the Libraries and the Northwestern community. The Board of Governors addresses the general well-being of the Libraries, its scholarly services, support, and stature within the University. The Board of Governors of Northwestern University Libraries is composed of regular members in good standing, and emeritus members. Individuals serving as regular members, and those recommended for emeritus status, are nominated and approved by the Executive Committee. Regular terms are three years, and are renewable based on the recommendation of the Executive Committee and the Dean of Libraries. From time to time the Board may also propose that the special honorary designation “Life Member” be granted to recognize a person’s meritorious contributions. To contact the Board of Governors or to learn more about getting involved, please contact Jennifer Mullman, Director of Development for Libraries, Press and University Archives, by email at jmullman@northwestern.edu or by phone at 847-467-7278.",
  "timestamp": 1733796564.0747643
}