{
  "url": "https://www.library.northwestern.edu/about/administration/mission-and-values.html",
  "title": "Mission and Values: Libraries - Northwestern University",
  "content": "Guided by principles of diversity, inclusivity, collaboration, and a dedication to academic excellence, Northwestern University Libraries and Northwestern University Press are poised to be catalysts for innovation, supporting interdisciplinary research and teaching while providing a welcoming environment for all. Our community is inclusive of the staff of both the Libraries and the University Press, Northwestern-affiliated persons, the international communities of Libraries' users and Press authors and readers, scholarly and professional colleagues, and alumni across the globe. The mission of Northwestern University Libraries is to provide information resources and services of the highest quality to sustain and enhance the University’s teaching, research, professional, and performance programs. The Libraries provide a setting conducive to independent learning and a resource for users both within the Libraries and throughout the University and broader scholarly communities. We are committed to meeting the needs of users by taking a leadership role in linking the University to information in a rapidly changing environment. The Libraries develop innovative strategies to educate users and to select, organize, provide access to, and preserve information resources. We forge effective partnerships outside the Libraries to connect users with the resources they need. Northwestern University Libraries are a learning organization committed to creative solutions which meet rapidly changing user needs. Our spaces, services, and operations encourage learning and growth. We build assessment into our plans and embrace failure to advance innovation. We learn from and engage the Northwestern community extending beyond our library walls. Our values are: We place our user communities at the center of decision-making processes and strive to achieve a balance between pragmatism and idealism. We value access to information to empower collaborative decision making and participation in meaningful work. We value curiosity and support its expression through learning, experimentation, flexibility, and growth by all members of our communities. We value clear intentions and shared understanding. We aspire to perform all our work in an open and honest environment with deep empathy for colleagues and users. We value taking ownership of one’s work, and understand that we are responsible to ourselves, to others and to the organization. We know that the perspectives and expertise of individuals at all levels of the organization are critical to problem solving and decision making. We respect all community members, which drives our commitment to diversity, equity, inclusivity, accessibility and anti-racist spaces, collections, policies, and services. Northwestern University Libraries and Northwestern University Press commit to furthering diversity, equity, inclusion and access in all our work, including collections, services and spaces. ",
  "timestamp": 1733796559.6943655
}