{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2022/xuemao-wang-named-charles-deering-mccormick-university-librarian-and-dean-of-libraries.html",
  "title": "Xuemao Wang named Charles Deering McCormick University Librarian and Dean of Libraries: Libraries - Northwestern University",
  "content": "EVANSTON, Ill. --- Xuemao Wang, University of Cincinnati dean of libraries, university librarian and vice provost of digital scholarship, has been appointed Northwestern University’s Charles Deering McCormick University Librarian and Dean of Libraries, effective Sept. 1, 2022. Wang will succeed Sarah Pritchard, who announced her pending retirement in October after 15 years in the role. With a career that spans international, public, consortium and academic library spheres, Wang brings broad expertise particularly well-suited to Northwestern Libraries in an era of great challenges and opportunities for academic and research libraries. Wang, who joined the University of Cincinnati (UC) in 2012, is responsible for the UC library system, including Walter C. Langsam Library, Donald C. Harrison Health Science Library and seven other college and departmental libraries. He also coordinates all UC jurisdiction libraries including law and regional campus libraries. At Northwestern, he will lead 186 faculty and staff, and will administer the University Library, Deering Library, Seeley G. Mudd Library, and the Oak Grove Library Center in Waukegan. He also will have oversight of the Northwestern University Press and manage shared services with the law, medical and NU-Qatar libraries. The Northwestern University Libraries' collection of 6.8 million titles and 187,000 unique digital works includes a portfolio of distinguished special collections, including the Transportation Library, McCormick Library of Special Collections and University Archives, and the Herskovits Library of African Studies, among others. Read the full announcement on Northwestern News.",
  "timestamp": 1733797129.9042807
}