{
  "url": "http://www.library.northwestern.edu/visit/visitor-privileges/reciprocal-university/index.html",
  "title": "Reciprocal Borrowing Agreements with Other Universities: Libraries - Northwestern University",
  "content": "Northwestern University Libraries has reciprocal borrowing agreements with University of Chicago, Loyola University of Chicago, and University of Illinois at Chicago (UIC) libraries. We also participate in reciprocal borrowing through the Big Ten Academic Alliance (BTAA) and the OCLC Reciprocal Faculty Borrowing Program. Members of the Northwestern community can access and borrow from these institutions, and vice versa. For entrance to library buildings, show your valid home institution ID at the entrance. Exceptions are the Galter Health Sciences Library and Pritzker Legal Research Center, which reciprocal borrowers cannot access. Reciprocal borrowing allows non-affiliated users to borrow from Northwestern Libraries. Members of the Northwestern community may also take advantage of reciprocal borrowing programs to access materials and resources from other institutions. Current students, faculty, and staff who have a library account in good standing at the University of Chicago, Loyola,UIC, or one of the BTAA schools may apply for a borrower's card at Northwestern. To begin the application process, please complete the application form. A reciprocal borrower’s card is valid for the academic year through June 15, and can be renewed annually upon verification of current status and as long as your library accounts at both institutions are in good standing. Apply here Faculty from participating OCLC institutions are eligible to access and borrow materials from Northwestern Libraries. See the list of participating institutions  to find out if you're eligible to participate. Once you have obtained an OCLC Reciprocal Faculty Borrowing Card from your home institution, contact circulation@northwestern.edu to set up your privileges. Northwestern University students, faculty or staff can borrow from the University of Chicago, Loyola University, and The University of Illinois at Chicago. The Big Ten Academic Alliance borrowing program allows users to borrow at participating institutions, and OCLC's Onsite Borrowing program gives the Northwestern community access to collections at participating institutions throughout the country. Northwestern faculty have additional privileges through the OCLC Reciprocal Borrowing Program. Find out how to obtain borrowing privileges.",
  "timestamp": 1733797242.361213
}