{
  "url": "http://www.library.northwestern.edu/about/administration/departments/index.html",
  "title": "Departments: Libraries - Northwestern University",
  "content": "Contact Academic Engagement Acquisitions and Metadata Services handles the establishment of library collections and creates, maintains, and shares metadata for library resources. This includes: Contact Acquisitions and Metadata Services Key services for Access Services: Contact Access Services Mission and Primary Activities: To develop and facilitate collaborative library assessment initiatives, planning, and project management processes that demonstrate the library’s success in meeting strategic goals and supporting the University strategic plan. Contact Assessment & Planning The Business Operations Support (BOS) team is comprised of business, facilities, receiving and security functions. We are committed to delivering exceptional customer service and providing a safe, welcoming and well-maintained environment to the University Libraries students, faculty, staff, patrons, vendors and other University constituents. Key department functions: Contact Business Operations Support: Digital Products and Data Curation provides digitization services and support to Northwestern faculty and graduate students. It partners with Library and University departments to provide these services and to undertake special digitization projects that bring Northwestern's unique and rare collections to researchers around the world. The department is also responsible for the development and administration of the Library's digital repository. Contact Digital Products and Data Curation Mission: To collaborate with faculty and students to enhance the impact and reach of their academic work through data science, web development, and digital humanities. The group’s intent is the advancement of knowledge by using a range of digital tools and methods to conduct research, teaching, and learning. Department’s responsibility: Digital Scholarship has the expertise to integrate scholarly methodologies with technological skills. We work with faculty and students interested in utilizing mixed methods for their research; for example, AI/ML, geospatial, text analysis, data mining and other data science techniques to collaborate on research. Our intent is on faculty and student collaboration that leads to digital-first scholarly resources, publications and grant funding. We collaborate with all Northwestern affiliated schools, labs, or departments on either campus. Contact Digital Scholarship & Research Data Management The Distinctive Collections and Research Services Department organizes and provides a suite of services to the Northwestern community, including: Contact Distinctive Collections & Research Services Instruction & Curriculum Support (ICS) provides strategic direction and continuing education support for the teaching and learning activities of the Northwestern University Libraries. Contact Instruction & Curriculum Support: The IT Infrastructure Department provides and supports the technological needs of library staff and our patrons. In addition to installing and implementing new services and systems, it supports and maintains servers, systems, workstations and applications through their technology life cycle. Key services include: Contact IT Infrastructure Marketing & Communication handles outreach for the library to Northwestern and off-campus audiences, including Footnotes magazine, the library website, social media accounts and various print publications. Contact Organizational Development implements the Library's human resources policies and programs, including recruitment, training, staff development, compensation, employee relations and records management. The Organizational Development staff serve as the primary source for the Library Administration in planning personnel policies and procedures and as the liaison to the University's Department of Human Resources. Contact Organizational Development The Preservation Department preserves library collections in all formats, including books, archival materials, audio, film and digital collections. The department's In-house and vendor-based preservation services include shelf preparation, commercial binding, mass deacidification, microfilming and digitization. The department includes a conservation lab with conservators and technicians who perform a broad range of conservation treatments. In-house conservation services are aimed at preserving both general and special collections as well as providing support for a dynamic program of exhibits and outreach. Contact Preservation",
  "timestamp": 1733797385.692526
}