{
  "url": "https://www.library.northwestern.edu/about/news/library-news/2022/message-from-new-dean-of-libraries-xuemao-wang.html",
  "title": "Message from new Dean of Libraries Xuemao Wang: Libraries - Northwestern University",
  "content": "As you have heard, my name is Xuemao Wang (pronounce it Shee-mo Wong), and I prefer everyone simply call me by my first name. I come to Northwestern with more than 20 years in academic research libraries, and I look forward to bringing my experience to this campus. Since my first day on September 1, I have immersed myself in all things Northwestern. Currently, I am conducting a thorough listening tour of the Libraries, which will inform my vision for the future and an immediate strategy that makes the most of this moment of transition. My meetings from September to November with faculty, deans, senior university leaders, and President Mike Schill and other campus leaders have shaped my awareness of how the Libraries fit into the greater goals of this University. I am continuing to learn what matters to our faculty. I have had several opportunities to meet and engage faculty members across the University both in meetings and socially, including attending the Faculty Award dinner and meetings of the Graduate School Administrative Board and the Research Deans Group. Each of these conversations informs my outlook as I plan the Libraries’ next steps. From these conversations has emerged a priority: within the next six months, we will begin an inclusive re-envisioning process for the Libraries with a goal of creating a new shared and bold vision for the future. And to clarify, by “shared,” I include Northwestern faculty, staff, students, and leadership, as well as community key stakeholders. The goal of all this planning is to make Northwestern University Libraries a recognized intellectual hub and engaging partner within the University and beyond. Expect to see more specifics in the new year as we turn all this learning into action. Sincerely,  Xuemao Wang",
  "timestamp": 1733797127.7317314
}