{
  "url": "http://www.library.northwestern.edu/visit/classrooms/ver-steeg-lounge.html",
  "title": "Ver Steeg Faculty Lounge: Libraries - Northwestern University",
  "content": "To make a reservation, complete a Libraries event space request. For any other questions, please contact library-admin@northwestern.edu. Library staff can schedule Ver Steeg Lounge through Outlook. Northwestern University faculty, administration and Library staff can reserve the Ver Steeg Faculty Lounge for special receptions and other formal social events during Library hours. See below for special regulations on the use of the space. Please note: renovation construction in Deering Library beginning in June 2024 may create noise in Ver Steeg. As construction commences, we will appraise the level of disruption.  The Ver Steeg Faculty Lounge has seated lecture capacity for 41 people or standing room for 70 people. It has movable sectional couches and chairs, as well as 16 folding tables.  It is equipped with a small prep area with a sink and a mini fridge. The lounge is accessible to people with disabilities. Restrooms are also available within the lounge. The lounge is equipped with a lectern and microphone, 90\" monitor and connected computer. Aside from ethernet connection & wireless internet access, the Library does not provide AV support for equipment set-up and operation, though instructions are provided in the room. Please arrive early to give yourself enough time to troubleshoot, should issues arise. The Ver Steeg Lounge may not be scheduled by students or used for events attended primarily by students (either graduate or undergraduate). Under University Policy, the Ver Steeg Lounge also cannot be used for political events involving fund-raising or planning or participating in a political campaign. Sponsors of events are responsible for the appropriate use of the Lounge and for the good condition of the room following the event. All service items and food must be removed, waste collected and areas cleaned by the sponsor of the event. Care should be taken to protect wooden tabletops from beverages and foods. Sponsors are responsible for moving furniture for their needs. Any signage must be taken down after event. No additional furniture may be brought into the Lounge. Attendance at special events must be by personal invitation only and is limited to a maximum of 100 people. Open invitations may not be issued in the public news media, including The Daily Northwestern. Sponsors are held responsible for providing all food and beverages, table service, and utensils and for set-up and clean-up as well as any electrical cords, microphones etc they may need for their event. Sponsors serving alcoholic beverages are responsible for complying with all state and local regulations. Deliveries of refreshments and equipment may be made to the Receiving Room Dock of the Library between 8:30 am and 4 pm, Monday through Friday only. Items must be moved from the Receiving Room/Loading Dock to the Ver Steeg Faculty Lounge during these same hours. The latest that caterers can exit the dock is 4:30pm, when the dock closes. Deliveries are not allowed Saturdays or Sundays. The sponsor of the event must meet the caterer at the receiving room. Care must be taken to be as quiet as possible when bringing food through the library to the lounge. All liquids must have secured covers. No food requiring open-flame heating (i.e. sterno-heated chafing dishes) may be used. The Library staff is not able to provide any service for events, AV support, delivery or preparation of refreshments, or cleaning up after an event. Basic room setups can be requested by choosing from options available on the room request form.",
  "timestamp": 1733797891.7179532
}