{
  "url": "http://www.library.northwestern.edu/find-borrow-request/requests-interlibrary-loan/requesting-unavailable-items.html",
  "title": "Requesting Unavailable Items: Libraries - Northwestern University",
  "content": "If your materials are unavailable at Northwestern, you may be able to borrow them from another library. NUsearch: You can request a copy from another library directly from within NUsearch. Sign in to your account, and click \"ILL @ NU\" under Get It. Other Libraries: If the item you’re looking for isn’t in NUsearch, search other libraries to confirm that the item you’re looking for is available at other libraries. If you find it, you may request it through interlibrary loan. ILL Form: You may also fill out the ILL request form directly, and we will find the item for you. Interlibrary loaned materials are available for varying lengths of time, depending on the library it is borrowed from. We will try to find a copy of your requested item which will be available for the longest loan period. ILL materials can be picked up at the University Library Circulation desk. Off-campus delivery is available to Evanston-based faculty, graduate students and SPS affiliates. Please choose your pickup or delivery location in the request form. For delivery, provide a full street address and zip code in the Notes field for each request. We go to all reasonable lengths to obtain materials for users as quickly as possible and will pay associated fees to lending libraries. It takes an average of 7 to 10 days for loan materials to arrive. You may return items to the library book drops or via mail. Mailing address: Northwestern University LibrariesATTN: Circulation1970 Campus DriveEvanston, IL 60208 If there is a book, DVD, or journal that you believe should be in Northwestern Libraries' collections, complete the Purchase Suggestion form. The request will be forwarded on to the appropriate subject specialist who will contact you if your item has been purchased.",
  "timestamp": 1733797213.5676115
}