{
  "url": "https://www.library.northwestern.edu/libraries-collections/mccormick-library/collection-highlights/special-projects/make-your-mark.html",
  "title": "Make Your Mark: Libraries - Northwestern University",
  "content": "In 2019, Northwestern University Archives launched a project to help Northwestern undergraduate Residential Colleges and student organizations like yours archive their records as part of their everyday workflow and ultimately deposit them with us for long-term preservation and access. By participating in this project, you: Our end goal is to grow and diversify Northwestern University Archives' holdings to more accurately reflect the richness of undergraduate student life. Below are the four steps required for transferring your records to the Archives. You may also use the toolkit and detailed instructions to help guide you.  Thank you for volunteering in the Make Your Mark, Northwestern University Archives’ student organization archiving initiative! Here’s how you can get started: Discuss with your Residential College Executive Board, student organization's governing body, or fellow members what types of records you want to transfer this year to the Archives. See our Appraisal Tips for guidance. Some types of records you might consider transferring include: Complete all the fields in this form, then click to submit.   Create a folder on your Google Drive for all the files of the year you are transferring to the Archives. Be sure to name the file something descriptive, e.g., “Slivka 2018-2019 archives” - click here for tips on naming files. Share your folder with the Northwestern University Archives' Digital Archives account: digitalarchives@u.northwestern.edu What is appraisal? Appraisal (n) - the process of determining whether records and other materials have permanent (archival) value Your records tell a story. Think of the various records you create as storytellers of your group's history. To begin telling your story, consider questions like: Then consider what records document the answers to those questions. That's your story! Selecting what files to keep and ultimately transfer to the Archives is your decision, and it's an important one because what you select will ultimately tell the story of your organization as it exists today. So when appraising your files, consider what is absolutely necessary to tell that story but remember you can't (nor should you) save everything. Digital Citizenship is the practice of using computers, the Web, and digital devices responsibly. The majority of records created today are born-digital, and when you donate your records to the Archives it's important to keep digital citizenship principles in mind. Because digital records are at risk of being misused, altered, or even hacked, we practice digital preservation techniques that help prevent these risks once records are sent to the Archives. However, privacy concerns with digital records can be addressed at creation and prior to donation as well. If you are donating materials for an organization, such as a student group or residential college, ask questions such as: Perhaps your materials contain something you think is important—maybe it could even be considered controversial— but you’re worried about protecting the privacy of everyone involved. You can take some steps to help protect privacy. Talk to others in your organization and appraise your records. Assess the risks: Work with the archivists to document these issues and create plans for preservation and access. Digital preservation is more than just saving data online or on your computer. All hardware and software will eventually fail. Therefore, we use a combination of policies, strategies, and actions to help preserve digital files. Some steps include: Northwestern Libraries Digital Preservation Policy Find more information about how Northwestern Libraries practices digital preservation: NUL Digital Preservation Policy In a library setting, we take additional steps to preserve data for as long as possible. But there are some things you can do before you donate your digital records that will help: Websites can be part of your digital collection too! Web archiving includes capturing websites, their embedded content, preserving, and storing them in a separate repository for future access. Due to the changing nature of websites, web archiving ensures that we preserve information on sites as they evolve. Over time, the regular captures of one site creates a database-like environment where you can view a site's changes. When completing your Description of Gift Form, you'll be asked about which websites should be included or excluded from web archiving.",
  "timestamp": 1733797109.5428984
}