{
  "url": "https://www.library.northwestern.edu/about/administration/departments/preservation-conservation/preventative-conservation.html",
  "title": "Preventative Conservation: Libraries - Northwestern University",
  "content": "Use these links to explore environmental data collection and analysis: By maintaining environmental standards and monitoring pest populations in the library, the Preservation Department helps prevent the deterioration of paper materials, control mold outbreaks and inhibit pest infestations. The Environmental Monitoring Program helps maintain proper temperature and humidity levels within the Library. We collect data from PEM2 dataloggers, input and analyze the data using Climate Notebook software, produce detailed quarterly reports, and work with Campus Facilities to address any problems. Data is collected from 28 locations within University Library, Deering Library, Mudd Library as well as the Oak Grove Storage Facility. Integrated Pest Management (IPM) is the current standard for monitoring and controlling pest populations in library, archives and museum settings without the use of pesticides or other measures harmful to humans or collections materials. In conjunction with regular environmental monitoring, a successful IPM program identifies potential problem areas and provides concrete data for future planning, The first step of an IPM program is to monitor and identify the pest species present in order to determine whether or not more extensive pest control actions are necessary and, if so, which are most appropriate. The Preservation Department monitors all library facilities, setting pest traps, collecting data and submitting regular reports with recommendations to Library Facilities. Deacidification is a process that stabilizes acidic paper by introducing an alkaline buffer into paper fibers, which stops at-risk materials from becoming brittle. The Preservation Department evaluates discrete collections and sends appropriate materials to a vendor for mass deacidification. Library curators and selectors guide the priorities for deacidification treatment. Circulating and distinctive collections chosen for treatment include African language books, archival manuscripts, counter-culture newspapers, and subject areas of high use and importance.",
  "timestamp": 1733797182.9762337
}